[
 {
  "avatar": "https://pretalx.com/media/avatars/Niall_1_p357ACI.png",
  "name": "Niall Moran",
  "submissions": [
   "JFDMPR"
  ],
  "code": "33NEL3",
  "biography": "Niall is a computational scientist at the Irish Centre for High End Computing where he works on a variety of projects covering quantum computation, AI and data analytics."
 },
 {
  "avatar": null,
  "name": "Julius Krumbiegel",
  "submissions": [
   "3S8DGW"
  ],
  "code": "37WXQK",
  "biography": "I'm a PhD student researching speech processing at the Institute for Systemic Neuroscience in Hamburg, Germany. I'm a core contributor to Makie.jl and the author of packages such as MakieLayout.jl, Chain.jl, Animations.jl."
 },
 {
  "avatar": null,
  "name": "Flemming Holtorf",
  "submissions": [
   "HUUC3C"
  ],
  "code": "39MLZ3",
  "biography": "Flemming is a 3rd year PhD student in the Chemical Engineering Department at MIT working on the moment-based analysis of stochastic processes."
 },
 {
  "avatar": null,
  "name": "Valentin Churavy",
  "submissions": [
   "VK87Q3",
   "RXBMHE",
   "UDJ7SJ",
   "DZC7HN",
   "C3EBJM"
  ],
  "code": "3C7UBC",
  "biography": "PhD Student at MIT"
 },
 {
  "avatar": "https://pretalx.com/media/avatars/avatar_lOhh5vu.jpg",
  "name": "Gustavo Aroeira",
  "submissions": [
   "BBDRQ3"
  ],
  "code": "3DSWEY",
  "biography": "PhD candidate in chemistry at the University of Georgia. Currently working at the Center for Computational Quantum Chemistry under supervision of Prof. Henry Schaefer. \r\nI am originally from Sao Paulo, Brazil where I got my degree in chemistry. Upon realizing that I was not talented enough for lab work, I found a new passion in programming. Today my main interests are the development of wave function methods and their application in chemical problems."
 },
 {
  "avatar": "https://www.gravatar.com/avatar/1574f8d9fd9ac9c89c23dd6b4817a045",
  "name": "Phillip Alday",
  "submissions": [
   "7CQYQB",
   "A3FSL3",
   "BMMEGV"
  ],
  "code": "3EFERC",
  "biography": "Phillip was a struggling mathematician, then a linguist and now a neuroscientist, but always a hacker."
 },
 {
  "avatar": null,
  "name": "Paulito Palmes, PhD",
  "submissions": [
   "FHGWBQ",
   "KQAN8F",
   "Y9XWLM"
  ],
  "code": "3EKCYY",
  "biography": "I am a research scientist at the IBM Research working on the following areas: AutoML, AutoAI, RL/ML Optimization, and Decision Optimization."
 },
 {
  "avatar": "https://pretalx.com/media/avatars/me_HXaehZM.png",
  "name": "Gerardo Duran-Martin",
  "submissions": [
   "7WWKSK"
  ],
  "code": "3FK7YD",
  "biography": "Msc student in Mathematics at Queen Mary University of London"
 },
 {
  "avatar": null,
  "name": "Viral B. Shah",
  "submissions": [
   "WDFZWG"
  ],
  "code": "3HK3M7",
  "biography": null
 },
 {
  "avatar": "https://pretalx.com/media/avatars/LaberintoKimPaolo_NqjYhtJ.png",
  "name": "Kim Paolo Laberinto",
  "submissions": [
   "8KCB3E"
  ],
  "code": "3PPANS",
  "biography": "Started learning Julia a year ago! Electrical Engineering B.Sc graduate in May 2021 from Winnipeg, Canada. Aspiring Julia data scientist with interests in scientific machine learning."
 },
 {
  "avatar": null,
  "name": "Evangelos Paradas",
  "submissions": [
   "TYJXFL"
  ],
  "code": "3SFAMU",
  "biography": "I am Evangelos Paradas from Thessaloniki, Greece. I am physicist, holding a PhD in Particle Physics. The trip into the algorithms' world, started during my PhD, as I was responsible for a few algorithms of the High Level trigger of the CMS experiment at CERN.\r\nIn this context, the algorithms were written in C++. After a few years I moved to the Netherlands, working at ASML as Algorithm  Deployment architect."
 },
 {
  "avatar": null,
  "name": "Kiran Kate",
  "submissions": [
   "KQAN8F"
  ],
  "code": "3XBVLH",
  "biography": null
 },
 {
  "avatar": "https://pretalx.com/media/avatars/yoniImage_CtxIvlZ.jpg",
  "name": "Yoni Nazarathy",
  "submissions": [
   "A9KZCY"
  ],
  "code": "777AC8",
  "biography": "Associate Professor [Yoni Nazarathy](https://yoninazarathy.com/) from the University of Queensland Australia, specializes in data science, probability and statistics. His specific research interests include scheduling, control, queueing theory, and machine learning. He has been at The University of Queensland for nearly a decade, teaching courses in the Masters of Data Science program and working on research. Prior to his previous academic positions in Melbourne and the Netherlands, he worked in the aerospace industry in Israel. In recent years, he has also been heavily involved with primary and secondary mathematics education and is the co-founder of an EdTech mathematics organization called One on Epsilon. He is also the co-author of a data science book, \"Statistics with Julia: Fundamentals for Data Science, Machine Learning and Artificial Intelligence\". Recently his research has also focused on epidemics and he leads the [Safe Blues](https://safeblues.org/) program dealing with finding efficient and ethical methods to track social mobility with a goal of prediction and control of epidemics."
 },
 {
  "avatar": "https://pretalx.com/media/avatars/propic_confe_ZqUu5UZ.jpg",
  "name": "Alessandro Cheli",
  "submissions": [
   "F9PLVY"
  ],
  "code": "7ATBR8",
  "biography": "Computer Science undergraduate student at the University of Pisa. Interested in functional programming, programming language theory, category theory, algebraic and symbolic computation, computability theory."
 },
 {
  "avatar": "https://pretalx.com/media/avatars/index_vGgpsBz.png",
  "name": "Arsh Sharma",
  "submissions": [
   "XDX3SQ"
  ],
  "code": "7ESTQZ",
  "biography": "Arsh Sharma is a student at the National Institute of Technology, Hamirpur, India. He is currently working as a  GSoC student for the Julia Language Community building Javis.jl, a math viz tool."
 },
 {
  "avatar": "https://www.gravatar.com/avatar/68fd1b95c7265dc2756cf1d5a4cd8333",
  "name": "David Anthoff",
  "submissions": [
   "WCSKJ7",
   "AUYF3X",
   "MSTYCZ"
  ],
  "code": "7JQFVF",
  "biography": "David Anthoff is an environmental economist who studies climate change and environmental policy. He co-develops the integrated assessment model FUND that is used widely in academic research and in policy analysis. His research has appeared in Nature, Science, the American Economic Review and other academic journals. He contributed a background research paper to the Stern Review and has advised numerous organizations (including US EPA and the Canadian National Round Table on the Environment and the Economy) on the economics of climate change.\r\n\r\nHe is an assistant professor in the Energy and Resources Group at the University of California, Berkeley. Previously he was an assistant professor in the School of Natural Resources and the Environment of the University of Michigan, a postdoc at the University of California, Berkeley and a postdoc at the Economic and Social Research Institute in Ireland. He also was a visiting research fellow at the Smith School of Enterprise and the Environment, University of Oxford.\r\n\r\nHe holds a PhD (Dr. rer. pol.) in economics from the University of Hamburg (Germany) and the International Max Planck Research School on Earth System Modelling, a MSc in Environmental Change and Management from the University of Oxford (UK) and a M.Phil. in philosophy, logic and philosophy of science from Ludwig-Maximilians-Universität München (Munich, Germany)."
 },
 {
  "avatar": "https://pretalx.com/media/avatars/KlepperSmall_w1nbCLW.JPG",
  "name": "Mike Klepper",
  "submissions": [
   "ZS9XPN"
  ],
  "code": "7NGC73",
  "biography": "Mike Klepper is a software engineer working in web-database connectivity and IoT arenas. He holds a BSc in mathematics from the University That Shall Not Be Named, and a MSc in computer science from Franklin University in Columbus, Ohio.\r\n\r\nHe is the author of several blogs including \"Patriot Geek\" and \"Red White and Julia\".\r\n\r\nHe is currently pursuing a master's degree in mathematics from the Open University in the UK.\r\n\r\nIn his copious spare time he is the operations officer for a community support group in eastern Pennsylvania, where he is developing the concepts of \"counter-logistics\" and \"logistic system reverse engineering.\""
 },
 {
  "avatar": null,
  "name": "John Woolverton",
  "submissions": [
   "KWNMHU"
  ],
  "code": "7VQBNR",
  "biography": "Infrastructure programmer building high performance distributed systems, mobile applications, or embedded systems depending on the era.  Historically a C/C++ programmer, but have also spent parts of my career programming in pascal, perl, javascript and other more obscure languages.  Every seven years, I pick up a new tool for my toolbox and this time it was Julia."
 },
 {
  "avatar": "https://pretalx.com/media/avatars/23134958_AyMYvR1.jpeg",
  "name": "Vaibhav Dixit",
  "submissions": [
   "CLKYFN"
  ],
  "code": "7YFPLU",
  "biography": "Vaibhav is involved in building analysis tooling in the SciML ecosystem in Julia and one of the developers of Pumas (https://pumas.ai)."
 },
 {
  "avatar": null,
  "name": "Dhairya Gandhi",
  "submissions": [
   "ZEV3MR"
  ],
  "code": "83D8SQ",
  "biography": "Dhairya Gandhi is a data scientist at Julia Computing Inc. and is the lead developer of the Machine Learning framework Flux."
 },
 {
  "avatar": "https://www.gravatar.com/avatar/25aa43cb5b3358bf5ef306d0ff3acd71",
  "name": "Chandrasekhar Ramakrishnan",
  "submissions": [
   "SBLEKM"
  ],
  "code": "89TPKE",
  "biography": "Chandrasekhar Ramakrishnan studied mathematics at the University of California, Berkeley (B.A. 1997) and art and computer science at the University of California, Santa Barbara (M.A. 2003). He has worked as a software developer and data-science consultant for companies, research institutions, and NGOs in the US, Germany, and Switzerland. Since 2009, he has been at **ETH Zürich** supporting projects by developing software solutions for data management, analysis, and visualization."
 },
 {
  "avatar": null,
  "name": "Dr. Ronan Arraes Jardim Chagas",
  "submissions": [
   "E3MWHZ"
  ],
  "code": "8AFQPZ",
  "biography": null
 },
 {
  "avatar": null,
  "name": "Zhenghao Wu",
  "submissions": [
   "ECKGDE"
  ],
  "code": "8BCABC",
  "biography": "PhD student @ TU-Darmstadt"
 },
 {
  "avatar": null,
  "name": "Shuhei Kadowaki",
  "submissions": [
   "VY9UVX",
   "BNB888",
   "ZZ8KFP"
  ],
  "code": "8BZR7G",
  "biography": "A maintainer of Julia IDEs, [julia-vscode](https://www.julia-vscode.org/) and [Juno](https://junolab.org/).\r\nAlso involved with the Julia compiler development, mainly around its abstract interpretation based type inference implementation."
 },
 {
  "avatar": "https://pretalx.com/media/avatars/DSC_0069_X7Nviip.JPG",
  "name": "Tuomas Koskela",
  "submissions": [
   "WJTAME"
  ],
  "code": "8DCCQ8",
  "biography": "I am a senior research software developer at University College London. My background is in developing plasma physics simulations for supercomputers. I'm interested in a lot of things, often broadly related to physics, energy and computing. \r\n\r\n[website](https://www.ucl.ac.uk/research-it-services/about-rits/people#software)\r\n[github](https://github.com/tkoskela)\r\n[linkedin](https://www.linkedin.com/in/tuomas-koskela-6b8359ba/)"
 },
 {
  "avatar": null,
  "name": "Jie Wang",
  "submissions": [
   "XFC73Y"
  ],
  "code": "8GS7FH",
  "biography": null
 },
 {
  "avatar": null,
  "name": "Sebastian Pfitzner",
  "submissions": [
   "WCSKJ7"
  ],
  "code": "8GV8MU",
  "biography": "Software engineer at Julia Computing and one of the maintainers of the Julia extension for VSCode."
 },
 {
  "avatar": null,
  "name": "Yuki Nagai",
  "submissions": [
   "DTJYAC"
  ],
  "code": "8GZWHW",
  "biography": "Ph.D. Senior Scientist, Japan Atomic Enegy Agency"
 },
 {
  "avatar": "https://pretalx.com/media/avatars/MatthewWilhelm_2p52QXk.jpg",
  "name": "Matthew Wilhelm",
  "submissions": [
   "DRMPLU"
  ],
  "code": "8HFHCB",
  "biography": "Matthew E. Wilhelm received a B.S. in Applied Mathematics from the University of North Carolina at Greensboro, Greensboro, NC, USA (2009), and a M.S. in Chemical Engineering from Columbia University, New York, NY, USA (2011). He is currently a PhD Candidate in Chemical and Biomolecular Engineering at the University of Connecticut where his research interests include: nonconvex optimization, dynamic simulation and optimization, mathematical biology, and engineering & STEM pedagogy."
 },
 {
  "avatar": "https://pretalx.com/media/avatars/Ali_l8JI3xS.jpg",
  "name": "Ali Siahkoohi",
  "submissions": [
   "EVR3HZ"
  ],
  "code": "8HWGRT",
  "biography": "I am pursuing a Ph.D. in Computational Science and Engineering at Georgia Institute of Technology. Currently, my research is mainly focused on applications of deep learning in inverse problems and uncertainty quantification."
 },
 {
  "avatar": "https://pretalx.com/media/avatars/2012_1116_FHerrmann_017_ElAZcr1.jpg",
  "name": "Felix J. Herrmann",
  "submissions": [
   "EVR3HZ"
  ],
  "code": "8LWHMV",
  "biography": "Felix J. Herrmann graduated from Delft University of Technology in 1992 and received his Ph.D. in engineering physics from that same institution in 1997. After research positions at Stanford University and the Massachusetts Institute of Technology, he became back in 2002 faculty at the University of British Columbia. In 2017, he joined the Georgia Institute of technology where he is now a Georgia research Alliance Scholar Chair in Energy, cross-appointed between the Schools of Earth & Atmospheric Sciences, Computational Science & Engineering, and Electrical & Computer Engineering. His cross-disciplinary research program spans several areas of computational imaging including seismic, and more recently, medical imaging. Dr. Herrmann is widely known for tackling challenging problems in the imaging sciences by adapting techniques from randomized linear algebra, PDE-constrained and convex optimization, high-performance computing, machine learning, and uncertainty quantification. Over his career, he has been responsible for several cost-saving innovations in industrial time-lapse seismic data acquisition and wave-equation based imaging. In 2019, he toured the world presenting the SEG Distinguished Lecture \"Sometimes it pays to be cheap – Compressive time-lapse seismic data acquisition\". In 2020, he was the recipient of the SEG Reginald Fessenden Award for his contributions to seismic data acquisition with compressive sensing. At Georgia Tech, he leads the Seismic Laboratory for Imaging and modeling and he is co-founder/director of the Center for Machine Learning for Seismic (ML4Seismic), designed to foster industrial research partnerships to drive innovations in artificial-intelligence assisted seismic imaging, interpretation, analysis, and time-lapse monitoring."
 },
 {
  "avatar": "https://pretalx.com/media/avatars/Profile_picture_0fGGJLc.jpeg",
  "name": "Matthew Fishman",
  "submissions": [
   "39HB9T"
  ],
  "code": "8Q8AYS",
  "biography": "Matthew Fishman received a PhD in physics from Caltech in the spring of 2018. His thesis was on the development of new tensor network algorithms for studying quantum many-body systems. In the fall of 2019, he started as an Associate Data Scientist at the Center for Computational Quantum Physics, part of the Flatiron Institute in New York City. There, he is lead developer of the C++ and Julia versions of the ITensor library, a leading software package for performing tensor network calculations."
 },
 {
  "avatar": null,
  "name": "Bhushan Suwal",
  "submissions": [
   "AGCHEV"
  ],
  "code": "8XQH7L",
  "biography": "I am a computational researcher at the Metric Geometry and Gerrymandering Group at Tufts University, where I develop open-source tools for redistricting research."
 },
 {
  "avatar": null,
  "name": "Oleg Barbin",
  "submissions": [
   "3F88PP"
  ],
  "code": "8YXJSG",
  "biography": "Oleg is a data scientist at Fonterra, a New Zealand Dairy Co-operative.  Much of his work concerns milk production planning problems.  Previously, he worked at Suez, who supply systems for the control of water utilities based on integer programming."
 },
 {
  "avatar": "https://pretalx.com/media/avatars/head_shot_nwDcO2q.png",
  "name": "Sophie Libkind",
  "submissions": [
   "ARURL8"
  ],
  "code": "8ZZBEM",
  "biography": "Sophie is a math PhD student at Stanford University. Her research interests are focused on dynamical systems including topological invariants of dynamical systems, composing dynamical systems, and the question of how continuous dynamical systems compute."
 },
 {
  "avatar": null,
  "name": "Fearghal O'Donncha",
  "submissions": [
   "Y9XWLM"
  ],
  "code": "98LQ9B",
  "biography": "Fearghal O’Donncha is a research scientist at IBM Research — Ireland. His work focuses on applying simulation models, analytics, and machine learning techniques to assist industry operations. This encompasses developing and deploying simulation-based models, integrating sensor data from a variety of IoT platforms, developing AI-based models that extract value from sensor or expert data, and optimizing these tools to a variety of HPC and cloud-based platforms. He is an adjunct faculty member at the National University of Ireland, Galway."
 },
 {
  "avatar": null,
  "name": "Simon Schwarz",
  "submissions": [
   "TEKDX9"
  ],
  "code": "9CZU7T",
  "biography": "Postgraduate computer science student at the University of Cambridge, currently working with Markus Kuhn."
 },
 {
  "avatar": null,
  "name": "Ravinder Bhattoo",
  "submissions": [
   "YGLES8"
  ],
  "code": "9FJ38N",
  "biography": "Ravinder works on machine learning in material design, dynamic fracture and cracks propagation on ballistic impact, and two-dimensional materials. He completed his B.Tech in Civil Engineering from IIT Roorkee. He worked in the industry for a year after which joined M3RG, IIT Delhi as a research scholar."
 },
 {
  "avatar": "https://pretalx.com/media/avatars/Goran_Frehse_small_size_aSnpucD.jpg",
  "name": "Goran Frehse",
  "submissions": [
   "DRMPLU"
  ],
  "code": "9G8UXL",
  "biography": "Goran Frehse has a Diploma in Electrical Engineering and Information Technology from Karlsruhe Institute of Technology, Germany, and a PhD in Computer Science from Radboud University Nijmegen, the Netherlands. From 2006 to 2018, he was an associate professor at the University Grenoble Alpes, from which he obtained a habilitation in 2016. From 2016 to 2018, he held a research chair (Chaire Initiative Universitaire Alpes) at the Univ. Grenoble Alpes. Since 2018, he is a professor at ENSTA Paris, where he continues his research on safe cyber-physical systems."
 },
 {
  "avatar": "https://pretalx.com/media/avatars/headShot2018Dec10_hmogdQ5.jpeg",
  "name": "Erik J Dasbach",
  "submissions": [
   "TLGXCD"
  ],
  "code": "9GQ97K",
  "biography": "Erik Dasbach joined Merck 20+ years ago and his work experiences have included mathematical modeling, clinical trial design and analytics, population health and epidemiologic studies, patient reported outcome measure development and analytics, real-world database analytics, and platform development for sharing data, models, and analytics. \r\n\r\nPrior to joining Merck, Erik worked in a variety of scientific and technology roles in the healthcare industry including the Centers for Disease Control and Prevention, the National Cardiovascular Network, the hospital industry, business development, and software development.  \r\n\r\nErik received his Ph.D. from the University of Wisconsin-Madison in Industrial & Systems Engineering with a specialty in decision sciences and health technology assessment."
 },
 {
  "avatar": null,
  "name": "Kyrylo Simonov",
  "submissions": [
   "HWSUQN",
   "FEG39B"
  ],
  "code": "9MPXGK",
  "biography": "The author of PyYAML, LibYAML, HTSQL, and DataKnots."
 },
 {
  "avatar": "https://www.gravatar.com/avatar/21aeae1f260365557523718bc19640f7",
  "name": "Stefan Karpinski",
  "submissions": [
   "UJUE8P"
  ],
  "code": "9NNRE7",
  "biography": "Julia co-creator & co-founder of [Julia Computing](https://juliacomputing.com)."
 },
 {
  "avatar": null,
  "name": "Liliana Badillo Sanchez",
  "submissions": [
   "GD99DH"
  ],
  "code": "9P33LA",
  "biography": "I have been working as a data scientist and technical writer for about 2.5 years. In my projects, I try to combine both disciplines either by documenting thoroughly a data science project, or following a data-driven approach (if possible) when documenting products and technical processes."
 },
 {
  "avatar": null,
  "name": "Richard Weinhold",
  "submissions": [
   "9SVMZ3"
  ],
  "code": "9TJLXF",
  "biography": null
 },
 {
  "avatar": "https://pretalx.com/media/avatars/AA1_sTADHoz.jpg",
  "name": "Dr.Aftab Ara",
  "submissions": [
   "QLSE8R"
  ],
  "code": "9UW3XS",
  "biography": "I am a dynamic educational professional, data science enthusiast, speaker, board member, book author, researcher, and L&D coach greatly passionate about different applications of data science, and enjoy speaking on various data science topics and creating a learning experience by reinventing technology.\r\nCurrently, I am working on several projects to create more engaging and exciting educational opportunities by using Data Science, AI, and Machine Learning project for education\r\n\r\nI actively work to share insights and perspectives through writing, consulting, and coaching with clients, practitioners, students, and fellow academicians in the field of learning. When not reading or writing, one can find me doodling away to my heart’s content."
 },
 {
  "avatar": "https://pretalx.com/media/avatars/profile_btiPJUu.jpg",
  "name": "Mauricio Montanares",
  "submissions": [
   "TZUQYY"
  ],
  "code": "9VRJUR",
  "biography": "I'm a bachelors student of Automation Engineering. I have experience working on embedded systems, Data analysis, Machine learning Topics and Wireless Communications. All of these topics in real world applications.\r\n\r\nThe last two years i was be a part of the Chilean Antarctic Scientific Expeditions, I collaborated with scientists of different nationalities and specialities in interdisciplinary works relatives to Antarctic Sciences."
 },
 {
  "avatar": "https://pretalx.com/media/avatars/photo_id_XMny6hx.jpg",
  "name": "Benoit Pasquier",
  "submissions": [
   "FEZW9Q"
  ],
  "code": "9WPU3V",
  "biography": "Postdoc at the University of Southern California"
 },
 {
  "avatar": "https://pretalx.com/media/avatars/dolgert_t3Waz5n.png",
  "name": "Andrew Dolgert",
  "submissions": [
   "3LMU3W"
  ],
  "code": "9XHN8U",
  "biography": "Andrew Dolgert is a computational scientist at the University of Washington. He has been a high-performance computing consultant for many years, working on diverse projects such as parallelization of molecular dynamics, immersive visualization of fracture mechanics, provenance for the Large Hadron Collider, and time series analysis of the world's global health. His recent work is on continuous-time, discrete-event simulation and on testing of scientific code."
 },
 {
  "avatar": "https://www.gravatar.com/avatar/311f28d70bb1de3b0e9bb55e9d5fd26d",
  "name": "Tim Besard",
  "submissions": [
   "UGX8YR",
   "VK87Q3",
   "RXBMHE"
  ],
  "code": "9YQMAK",
  "biography": "I'm a software engineer at Julia Computing, working on Julia's GPU packages and compilers."
 },
 {
  "avatar": "https://pretalx.com/media/avatars/logo_YZnDt1D.png",
  "name": "Ole Kröger",
  "submissions": [
   "DMTYDS",
   "9KTFNJ"
  ],
  "code": "9ZGBBL",
  "biography": "I'm a master student in computer science in Heidelberg, Germany. I like to teach and blog about programming especially about Julia."
 },
 {
  "avatar": null,
  "name": "Ahan Sengupta",
  "submissions": [
   "RS9B7Q"
  ],
  "code": "A3J7CA",
  "biography": "I am a 15-year-old student, currently attending the City of London School. I have always had a deep interest in programming, first starting with Scratch when I was quite young, then moving onto Python, then finally, a few years ago, Julia. I have since presented at JuliaCon 2018, 2019 and 2020 and therefore have some experience with the language."
 },
 {
  "avatar": "https://pretalx.com/media/avatars/XG2010_Z489qI5.jpg",
  "name": "Xavier Gandibleux",
  "submissions": [
   "TP88SL"
  ],
  "code": "A3VNSX",
  "biography": "Full Professor in Operations Research and Computer Science, Université de Nantes (France)."
 },
 {
  "avatar": "https://www.gravatar.com/avatar/1c72ab08b1cb2d891e1c24f05d9010f1",
  "name": "Chad Scherrer",
  "submissions": [
   "U7AM33",
   "SLHLHX"
  ],
  "code": "A7PDM3",
  "biography": "Hi, I'm Chad. My interests range from applied problems through \"technology transfer\", to applied research. I've been involved in probabilistic programming for the last ten years, and have led design of a few prototype systems. Since 2015 I've been very interested in Julia, resulting in Soss.jl and MeasureTheory.jl, as well as some utility packages around these.\r\n\r\nMost recently I've founded Informative Prior, where I'm available for contract consulting work involving teaching, development, or application of probabilistic modeling software."
 },
 {
  "avatar": "https://pretalx.com/media/avatars/Roesch_Elisabeth_B73Q8Qb.jpeg",
  "name": "Elisabeth Roesch",
  "submissions": [
   "FBTSYM"
  ],
  "code": "A9GFJJ",
  "biography": "I am a Ph.D. student in the Theoretical Systems Biology Group at the University of Melbourne led by Prof. Michael Stumpf. I focus my research on hybrid models, in which I combine mechanistic modelling techniques, e.g. differential equations, with machine learning approaches such as neural networks. I am passionate about using hybrid models in developmental biology to enhance our understanding of cell fate decision making.\r\n\r\nIn 2017, I received a Bachelor of Science in Bioinformatics from the Technical University of Munich and the Ludwig Maximilian University of Munich. In 2018, I graduated from Imperial College London with a Master of Science in Bioinformatics and Theoretical Systems Biology."
 },
 {
  "avatar": "https://pretalx.com/media/avatars/2018-08-12_17.27.18.2_Qu0rRZO.jpg",
  "name": "Milan Klöwer",
  "submissions": [
   "E7HKVW"
  ],
  "code": "A9SQSW",
  "biography": "PhD student in Climate Computing  \r\nAtmospheric, Oceanic and Planetary Physics  \r\nUniversity of Oxford  \r\n\r\nmilan.kloewer@physics.ox.ac.uk  \r\n[www.milank.de](https://milank.de)  \r\ntwitter [@milankloewer](https://twitter.com/milankloewer)  \r\ngithub [@milankl](https://github.com/milankl)"
 },
 {
  "avatar": "https://pretalx.com/media/avatars/Mira_Tellegen_7t1xiwx.jpg",
  "name": "Mira Tellegen",
  "submissions": [
   "QNWEDW"
  ],
  "code": "ABQCVC",
  "biography": "I'm a third-year Math/Computer Science major at Grinnell College. I'm interested in data protection, cybersecurity, and user interface. In my free time, I'm a captain of Grinnell's Mock Trial Team, and I bake and cook."
 },
 {
  "avatar": "https://pretalx.com/media/avatars/DSC_8311-schmal_uoEPNX9.jpg",
  "name": "Gregor Kappler",
  "submissions": [
   "CQ9F37",
   "DKEJ97"
  ],
  "code": "ABRWNH",
  "biography": "Gregor Kappler carries out psychometric research and data science consulting, and is founder of FilingForest, a julia-focused startup developing solutions for fast unbiased measurement in graph data.\r\n\r\nGregor was initially trained as a mathematician and psychologist, has implemented solutions for semantic text analytics for his PhD in 2007, and developed psychometric models for measuring with texts.\r\nHe has worked as a lecturer and researcher at the University of Vienna and the University of Jena and worked on a series of predictive analytic projects for software vendors and customers.\r\n\r\nGregor has switched to Julia from R in 2018, and is creator of the CombinedParsers package which provides parser combinators for fast, recursive and type-save parsing in pure Julia."
 },
 {
  "avatar": null,
  "name": "Krisztián Schäffer",
  "submissions": [
   "FZ99RD"
  ],
  "code": "AFFMXZ",
  "biography": "Working on a sparse-AI actor runtime, researching decentralized algorithms, playing with runtime code generation."
 },
 {
  "avatar": "https://pretalx.com/media/avatars/portrait-2-square_KTbUg2J.jpg",
  "name": "Jonathan Laurent",
  "submissions": [
   "NLG9FQ"
  ],
  "code": "AKVCHV",
  "biography": "Jonathan Laurent is a PhD student in Computer Science at Carnegie Mellon University. His current research interests lie at the intersection of machine learning and automated theorem proving."
 },
 {
  "avatar": "https://pretalx.com/media/avatars/picture_EWNcSZP.jpg",
  "name": "Afonso Rufino",
  "submissions": [
   "DV3UWZ"
  ],
  "code": "ALDXWX",
  "biography": "I'm a Portuguese physics student starting his masters at Instituto Superior Técnico (Universidade de Lisboa).\r\nThis year I'm an exchange student at École Polytechnique Federale de Lausanne.\r\nBesides my love for physics, I've always been interested in software and programming languages."
 },
 {
  "avatar": "https://www.gravatar.com/avatar/7991445c6f182e1157148500f5493050",
  "name": "Curtis Vogt",
  "submissions": [
   "GWRZPV"
  ],
  "code": "AQLMAC",
  "biography": "I have been working with Julia since 2015 and have made a variety of contributions to the ecosystem. I am a member of the Julia Community Prize committee and work for Beacon Biosignals as a Principal Software Architect."
 },
 {
  "avatar": "https://pretalx.com/media/avatars/1282691_g7HPUjM.jpeg",
  "name": "Kristoffer Carlsson",
  "submissions": [
   "CPDWCV",
   "KHK7PA",
   "U9SZZU"
  ],
  "code": "AS3MKE",
  "biography": "I'm a contributor to the Julia language and many packages."
 },
 {
  "avatar": null,
  "name": "Andrea Neumayr",
  "submissions": [
   "YGWUVE"
  ],
  "code": "ATAFQL",
  "biography": null
 },
 {
  "avatar": "https://pretalx.com/media/avatars/Nicolas_TSE_sq_small_u0epcQv.jpg",
  "name": "Nicolas Lepage-Saucier",
  "submissions": [
   "EWFRHW"
  ],
  "code": "ATTQ9J",
  "biography": "Canadian economist currently living in Toulouse, France. I'm interested in many fields, including numerical methods. Scarred for life by the experience of waiting six months for my estimates to converge."
 },
 {
  "avatar": "https://www.gravatar.com/avatar/14929e6d5974f98b82bea621ad874207",
  "name": "Miroslav Kratochvíl",
  "submissions": [
   "MHNZUS"
  ],
  "code": "AVXQCK",
  "biography": "I'm a postdoctoral researcher at the Luxembourg Centre for Systems Biomedicine, recently finished my PhD at Charles university in Prague, Dept. of SW engineering. I'm working on various computationally intensive problems in bioinformatics and cheminformatics."
 },
 {
  "avatar": null,
  "name": "Ranjan Anantharaman",
  "submissions": [
   "7BDGGA"
  ],
  "code": "AZXJH3",
  "biography": "I am a PhD Candidate at the Julia Lab at MIT. I've been working in Julia for the past 6 years."
 },
 {
  "avatar": null,
  "name": "Pablo Zubieta",
  "submissions": [
   "EFYMME"
  ],
  "code": "B3DVHD",
  "biography": "I'm currently a postdoctoral researcher at the University of Chicago working on a class of strategies used to accelerate learning the properties of systems simulated with molecular dynamics."
 },
 {
  "avatar": null,
  "name": "Elliot Saba",
  "submissions": [
   "ZSPVMT"
  ],
  "code": "B98NWS",
  "biography": null
 },
 {
  "avatar": null,
  "name": "William Thompson",
  "submissions": [
   "ATNVGH"
  ],
  "code": "BHARS7",
  "biography": "I am a PhD student at the University of Victoria and Canada's National Research Council working on astronomy instrumentation and the science of exoplanet direct imaging."
 },
 {
  "avatar": null,
  "name": "David Widmann",
  "submissions": [
   "WPUYVZ",
   "8BWJXP"
  ],
  "code": "BKDQGH",
  "biography": "I am a PhD student at the [Division of Systems and Control](https://www.it.uu.se/research/systems_and_control)\r\nwithin the [Department of Information Technology](https://www.it.uu.se) and the\r\n[Centre for Interdisciplinary Mathematics](https://www.math.uu.se/CIM) in Uppsala,\r\nsupervised by [Fredrik Lindsten](https://liu.se/en/employee/freli29),\r\n[Dave Zachariah](http://www.it.uu.se/katalog/davza513), and Erik Sjöblom. The main focus of my PhD studies is [uncertainty-aware deep learning](http://www.math.uu.se/digitalAssets/396/c_396868-l_1-k_lindsten.pdf). Currently, I\r\nam particularly interested in analyzing and evaluating\r\n[calibration](https://en.wikipedia.org/wiki/Calibration_(statistics)) of\r\nprobabilistic models. Please visit [my webpage](https://widmann.dev/research/) for more information.\r\n\r\n[My GitHub profile](https://github.com/devmotion/) provides an overview of my contributions to the Julia ecosystem. Currently, I am a member of the [steering council of SciML](https://sciml.ai/governance.html) and the [Turing team](https://turing.ml/dev/team/)."
 },
 {
  "avatar": null,
  "name": "Rachel Kurchin",
  "submissions": [
   "ZQJAW3",
   "T7UFDU"
  ],
  "code": "BKJLVX",
  "biography": "Usually writing code (or docs!) or triathlon-ing.\r\n\r\nMore at [my website](https://rkurchin.github.io)."
 },
 {
  "avatar": "https://pretalx.com/media/avatars/headshot_qpuPSGL.png",
  "name": "Kirill Zubov",
  "submissions": [
   "BNUBRB"
  ],
  "code": "BMB8P3",
  "biography": "developer NeuralPDE"
 },
 {
  "avatar": null,
  "name": "Claus Fieker",
  "submissions": [
   "WQ8MJK"
  ],
  "code": "BPLE9V",
  "biography": "I am a professor for computational number theory at Kaiserslautern University. I  a  PI of the DFG (German research association) funded OSCAR project as well as a developer of both OSCAR and Hecke."
 },
 {
  "avatar": "https://pretalx.com/media/avatars/2018-09-14_10.36.43_1lFTwyD.jpg",
  "name": "Dean Markwick",
  "submissions": [
   "PLBXYX"
  ],
  "code": "BPSXJZ",
  "biography": "I am a quant for BestX and use Julia in my day to day work of assessing trading costs across different financial markets. Outside of my day job you'll find me writing on a variety of topics for my blog or tinkering away on different Julia packages."
 },
 {
  "avatar": null,
  "name": "Loan Vulliard",
  "submissions": [
   "Z7X3DP"
  ],
  "code": "BXUBLV",
  "biography": "Interested in networks medicine, systems biology and bioinformatics, I am currently a predoctoral researcher in the group of Jörg Menche at the Max Perutz Labs and the Research Center for Molecular Medicine in Vienna, Austria. You can learn more about me on [my personal website](http://hub.vulliard.loan/)."
 },
 {
  "avatar": "https://pretalx.com/media/avatars/2015_Foto_Paul_1_L7kwpUS.jpg",
  "name": "Paul Lang",
  "submissions": [
   "EZHEQL"
  ],
  "code": "BXYAMA",
  "biography": "I am a systems biology PhD student with background in molecular biology. My doctoral research at the University of Oxford aims at improving our mechanistic understanding of cell cycle dynamics with mathematical models. This involves (1) casting chemical reaction networks into executable models, (2) obtaining highly multiplexed snapshot measurements of cell cycle regulators, from which we reconstruct their time-courses, and (3) developing parameter optimisation and model reduction/selection toolboxes."
 },
 {
  "avatar": null,
  "name": "Lingling Fan",
  "submissions": [
   "9MGDGG"
  ],
  "code": "BYEANF",
  "biography": "Lingling Fan is a full professor at University of South Florida, working on the following research areas: control, dynamics, optimization, and system identification of power systems, power electronics and electric machines. Her recent research interests include mechanism analysis of various dynamics seen in real world (wind farm oscillations, solar PV tripping), computing, and programming with Julia."
 },
 {
  "avatar": null,
  "name": "Samuel Omlin",
  "submissions": [
   "CPH7SG"
  ],
  "code": "BYZ8MT",
  "biography": "N/A"
 },
 {
  "avatar": null,
  "name": "Zenna Tavares",
  "submissions": [
   "LRHPUH"
  ],
  "code": "BZXF73",
  "biography": "Zenna Tavares is a postdoctoral researcher at MIT under the supervision of Armando Solar Lezama. His interests are in probabilistic and causal inference, programming languages, and human-inspired artificial intelligence."
 },
 {
  "avatar": "https://pretalx.com/media/avatars/Profile_Cropped_lVLrV9P.png",
  "name": "Dino Butron",
  "submissions": [
   "ZRWZJW"
  ],
  "code": "C3WHVH",
  "biography": "Dino Butron is a Senior Applications Engineer at Hamamatsu Corporation in Bridgewater, NJ where his focus is on high sensitivity photodetectors for use in various markets. He is currently involved in leading discussions for detector selection and developing simulation tools.\r\n\r\nDino is an expert in the operating principles and application of various detectors such as photodiodes, avalanche photodiodes (APD), SPPC (SPAD), MPPC (SiPM), and photomultiplier tubes (PMT). He has worked on many photodetector experiments resulting in a deep understanding of detector performance. In addition, he has vast knowledge programming signal-to-noise ratio and output simulations. He received his Bachelor’s degree in Electrical Engineering from Manhattan College, Riverdale, NY, in 2012."
 },
 {
  "avatar": "https://pretalx.com/media/avatars/deepart_a5xlUzo.jpg",
  "name": "Tomas Pevny",
  "submissions": [
   "XFZWWA"
  ],
  "code": "C78D79",
  "biography": "Tomas Pevny has graduated from Faculty of Nuclear sciences and Physical Engineering, CTU, Prague, in 2003. From 2004-2008, he was pursuing Ph.D. at Binghamton University, SUNY, USA specializing on Steganalysis. In 2008-2009 he spent a wonderful post-doc year in Grenoble. Since 2009, he is with Faculty of electrical engineering, CTU, at Prague. From 2013-2019, he was also consulting scientist at Cisco and from 2019 he is consulting scientist at Avast. His specialization is machine learning in security domains. He is an active user of Julia since 2015."
 },
 {
  "avatar": null,
  "name": "Johann-Tobias Schäg",
  "submissions": [
   "YYJCM8"
  ],
  "code": "CCLRPG",
  "biography": "Student of Technical Cybernetics (Technische Kybernetik und Systemtheorie) at TU Ilmenau, Germany."
 },
 {
  "avatar": null,
  "name": "Xuan (Tan Zhi Xuan)",
  "submissions": [
   "PPG3CY",
   "CLRKFC",
   "RAFSMK",
   "3PGHMY"
  ],
  "code": "CFLQJP",
  "biography": "Xuan (Sh-YEN, IPA: ɕɥɛn) is a PhD student at MIT in the Computational Cognitive Science and Probabilistic Computing research groups. Their current research focuses on inferring the hidden structure of human motivations by modeling agents as probabilistic programs, in the hope of aligning AI with the higher-order goals, values, and principles that humans strive (in part) to live by."
 },
 {
  "avatar": "https://pretalx.com/media/avatars/PXL_20210119_190551213_K44EJch.jpg",
  "name": "Francis Poulin",
  "submissions": [
   "DZC7HN"
  ],
  "code": "CJ9SDV",
  "biography": "Professor in Applied Mathematics at the University of Waterloo"
 },
 {
  "avatar": null,
  "name": "Anthony Blaom",
  "submissions": [
   "AVZECZ"
  ],
  "code": "CK3MKJ",
  "biography": "Anthony Blaom is a mathematician, publishing chiefly in the areas of differential geometry and dynamical systems, and a scientific computing consultant. He is a co-creator and lead contributor for [MLJ](https://alan-turing-institute.github.io/MLJ.jl/dev/), an open-source machine learning platform written in Julia, which began as a project at the  Alan Turing Institute, London.\r\n\r\nInitially trained as an a mechanical engineer, Anthony earned a PhD in Mathematics at Caltech in 1998. He is currently a Senior Research Fellow in the Department of Computer Science, University of Auckland."
 },
 {
  "avatar": null,
  "name": "Michael Garstka",
  "submissions": [
   "UDWSEC"
  ],
  "code": "CLJWR7",
  "biography": null
 },
 {
  "avatar": null,
  "name": "Rainer Heintzmann",
  "submissions": [
   "J8CRXY",
   "8VL9R7",
   "88MYCE"
  ],
  "code": "CNV3SE",
  "biography": "My research focuses on developing tools to image cellular function at high resolution. We develop techniques to measure multidimensional information in small biological objects such as cells, cellular organelles or other small structures of interest. Computer-based reconstruction methods, especially inverse-modeling based in automatic differentiation are of primary interest."
 },
 {
  "avatar": null,
  "name": "Gajendra Deshpande",
  "submissions": [
   "CQVK8D"
  ],
  "code": "CPJQQS",
  "biography": "I hold Post Graduate Diploma in Cyber Laws and Cyber Forensics from National Law School of India University Bangalore. I have presented talks many conferences including PyData Global, JuliaCon 2018 and 2020, PyCon FR/HK/TW/ID/TZ/AU, COSCUP Taiwan, FOSDEM 2021, FOSSASIA 2021, PyCon Africa, BuzzConf, EuroPython, PiterPy Russia, SciPy India. Worked as a Reviewer and Program Committee member for reputed International conferences including SciPy USA, SciPy Japan, JuliaCon, JupyterCon, PyData Global, and PyCon India, and publishers include Manning USA and Oxford Univesity Press. I am also a GitHub Certified Campus Advisor. I lead the PyData Belagavi chapter and the OWASP Belagavi chapter. I am working as CFP Co-Chair for PyCon India 2021."
 },
 {
  "avatar": null,
  "name": "Colin Beckingham",
  "submissions": [
   "N3ANEL"
  ],
  "code": "CQ7UC3",
  "biography": "Economist by training and horticulturist by experience. Erstwhile volunteer CTA for Andrew Ng's early Coursera courses in machine learning."
 },
 {
  "avatar": "https://pretalx.com/media/avatars/werder_3C3WoW4.jpg",
  "name": "Mauro Werder",
  "submissions": [
   "CPH7SG"
  ],
  "code": "CRJ7BV",
  "biography": null
 },
 {
  "avatar": null,
  "name": "Shashi Gowda, Yingbo Ma",
  "submissions": [
   "WZ7YM9"
  ],
  "code": "CZ3CRC",
  "biography": "Shashi is a grad student at MIT. Yingbo is an undergrad at UMBC and works at Julia Computing. We like coding in Julia."
 },
 {
  "avatar": null,
  "name": "William Kimmerer",
  "submissions": [
   "YFPXCU"
  ],
  "code": "D8TKR8",
  "biography": "Recent graduate from the University of Kentucky in Computer Science and Mathematics. Passionate about graphs, machine learning, and logic programming."
 },
 {
  "avatar": "https://pretalx.com/media/avatars/WhatsApp_Image_2021-01-22_at_18.16.17_z7fvtLI.jpeg",
  "name": "Pepijn de Vos",
  "submissions": [
   "QUCAK3"
  ],
  "code": "DFVU3S",
  "biography": "Software developer, electrical engineer, IC designer. Author of Apicula FPGA tools and Mosaic IC design software."
 },
 {
  "avatar": null,
  "name": "Gleb Belov",
  "submissions": [
   "3BBA7L"
  ],
  "code": "DHETLD",
  "biography": null
 },
 {
  "avatar": "https://pretalx.com/media/avatars/bk_new_side_med_L7bQy9W.png",
  "name": "Bogumił Kamiński",
  "submissions": [
   "RJE93F",
   "FXZXMB",
   "VSMCQG"
  ],
  "code": "DHRPEA",
  "biography": "I am a researcher in the fields of operations research and computational social science.\r\nFor development I use the Julia language. I currently mostly contribute to DataFrames.jl and related packages."
 },
 {
  "avatar": "https://pretalx.com/media/avatars/wi2yu01a_pGq0YQC.jpeg",
  "name": "Mathieu Besançon",
  "submissions": [
   "X9BNQV",
   "99GSDN"
  ],
  "code": "DK9KDB",
  "biography": "Mathieu is a researcher in computational mathematics working at the Zuse Institute Berlin. His interests span mixed-integer, convex optimization, applications in engineering and statistics."
 },
 {
  "avatar": "https://pretalx.com/media/avatars/head_shot_32Fccg6.png",
  "name": "Carleton Coffrin",
  "submissions": [
   "XGCJBA"
  ],
  "code": "DNAPAH",
  "biography": "Dr. Carleton Coffrin is a staff scientist at Los Alamos National Laboratory in the Advanced Network Science Initiative, an interdisciplinary team that investigates the application of emerging optimization and machine learning methods to problems in critical infrastructure systems.  Dr. Coffrin’s work focuses on developing novel optimization methods for network design, operation, and restoration for power networks.  His work on power system optimization has been recognized by the IEEE PES 2014 Optimal Power Flow Competition, the ARPA-e 2020 Grid Optimization Competition and Los Alamos National Laboratory's Early Career Researcher award.  Dr. Coffrin is also exploring how novel computing devices, such as quantum computers and memristor networks, can improve the next generation of optimization algorithms.  Dr. Coffrin received his Ph.D. in Computer Science from Brown University in 2012, under the supervision of Pascal Van Hentenryck."
 },
 {
  "avatar": "https://pretalx.com/media/avatars/IMG_20161126_1428484_ipQpq38.jpg",
  "name": "Chris Elrod",
  "submissions": [
   "QDBNXV"
  ],
  "code": "DNZRRM",
  "biography": "Statistician and SIMD-enthusiast."
 },
 {
  "avatar": "https://pretalx.com/media/avatars/Kool_Dan-3919_6X21wfK.jpg",
  "name": "Daniel Kool",
  "submissions": [
   "KLPEG3"
  ],
  "code": "DRPANN",
  "biography": "I grew up in Grand Rapids, Michigan, but now I live in Ames, Iowa. Both are great places to live, but I hope to move closer to GR eventually. I first became truly interested in science in high school chemistry class. Later, I found organic chemistry to be the most fun, and this interest spread to biochemistry and math (BS double major). I decided to continue my exploration and get an MS in chemistry, during which I studied a family of DNA polymerases that are recruited to replicate past lesions in the DNA. After that, I still wanted more time to study, so here I am at Iowa State in a great bioinformatics and computational biology PhD program. I want my life to be about exploration of STEM, and my favorite set of tools is Julia."
 },
 {
  "avatar": null,
  "name": "Leonard Göke",
  "submissions": [
   "EUVCJY"
  ],
  "code": "DXRPDQ",
  "biography": "Research Associate and PhD candidate at TU Berlin, open-science and macro-energy system modeling, https://github.com/leonardgoeke"
 },
 {
  "avatar": null,
  "name": "Michael F. Herbst",
  "submissions": [
   "KK9KS7",
   "ZQJAW3"
  ],
  "code": "DZ7WHZ",
  "biography": "By training a chemist, who got more and more twisted towards the \"dark side\" of numerical analysis. Now working as a PostDoc at the [Applied and Computational Mathematics](http://www.acom.rwth-aachen.de) lab of RWTH Aachen University, Germany. Lead developer of [DFTK](https://dftk.org), a Julia code for mathematical research in on density-functional theory (a quantum chemistry method)."
 },
 {
  "avatar": null,
  "name": "Kim Louisa Auth",
  "submissions": [
   "CLRKFC",
   "RAFSMK"
  ],
  "code": "E3TDSM",
  "biography": "I am a PhD student in Computational Mechanics at Chalmers University of Technology (Sweden), where I use Julia for doing Finite Element simulations."
 },
 {
  "avatar": "https://www.gravatar.com/avatar/f0aa406188ec55a18281bdb7457212ec",
  "name": "Fons van der Plas",
  "submissions": [
   "BGLQ3U",
   "RXF8UK"
  ],
  "code": "ECC83Q",
  "biography": "Computers are too difficult!\r\n\r\n[https://github.com/fonsp](https://github.com/fonsp)"
 },
 {
  "avatar": null,
  "name": "Lyndon White",
  "submissions": [
   "FEEV9A",
   "A93QFU"
  ],
  "code": "ECUZBT",
  "biography": "Lyndon White (@oxinabox) is a research software engineer at Invenia Labs (Cambridge, UK). He helps researchers use machine learning, constrained optimization, and generally tools from the technical computing domain to optimize the power grid. He get to do all the best parts of being a software developer and all the best parts of being a researcher, its great.\r\nHe works a lot on the Julia AutoDIff code, and is the leader of the ChainRules project."
 },
 {
  "avatar": "https://pretalx.com/media/avatars/122163764_10223124648774013_8747495711344582654_o_fH5ek2O.jpg",
  "name": "Alejandro R. Urzúa",
  "submissions": [
   "Y7ENBL"
  ],
  "code": "EEVZ3F",
  "biography": "I'm a _theoretical physicist_ who is slowly evolved in an _algorithm researcher_. I specialize in mathematical methods in optics and mechanics, both classical and quantum paradigms. I'm currently signed at National Institute of Astrophysics, Optics and Electronics.\r\n\r\nMy current research projects are: \r\n\r\n1. Energy analysis of harmonic oscillators arrays \r\n2. Phase transitions under group theoretical approximation\r\n3. Quantum state tomography and unitary transformations\r\n4. Epistemological and ontological problems in quantum mechanics"
 },
 {
  "avatar": "https://pretalx.com/media/avatars/IMG_6194_DsIS1pR.JPG",
  "name": "Eric Neiva",
  "submissions": [
   "HFHLDS"
  ],
  "code": "EQAZAW",
  "biography": "Postdoctoral researcher at the International Centre for Numerical Methods in Engineering"
 },
 {
  "avatar": "https://pretalx.com/media/avatars/IMG_8621_7SKWTKc.jpg",
  "name": "Krithika Natarajan",
  "submissions": [
   "KTDNM8"
  ],
  "code": "EVDMDJ",
  "biography": "I am a 16 year old student at Wilton High School in Wilton, CT. Currently, I am self-teaching myself Julia and I am also learning Java in my AP Computer Science Class in school."
 },
 {
  "avatar": null,
  "name": "Thibaut Cuvelier",
  "submissions": [
   "EHUKWK"
  ],
  "code": "EVRZ99",
  "biography": null
 },
 {
  "avatar": null,
  "name": "Théo Galy-Fajou",
  "submissions": [
   "YZSNLC"
  ],
  "code": "EWDVK7",
  "biography": "Hi! I am a PhD student at TU Berlin and Julia adept since 0.4! I develop packages for probabilistic inference and more especially Gaussian Processes. For more info check my website [theogf.github.io](https://theogf.github.io)"
 },
 {
  "avatar": "https://www.gravatar.com/avatar/9f29cd78f0f8e0221285e608aadadd24",
  "name": "Gabriel Weymouth",
  "submissions": [
   "RPBHWE"
  ],
  "code": "EWGM8B",
  "biography": "Prof of marine hydrodynamics & biologically inspired engineering at University of Southampton, physics-based machine learning at Alan Turing Institute. https://weymouth.github.io/"
 },
 {
  "avatar": "https://pretalx.com/media/avatars/photo_gabrio_uxxRcrb.jpeg",
  "name": "Gabrio Rizzuti",
  "submissions": [
   "EVR3HZ"
  ],
  "code": "EXN8D7",
  "biography": "Postdoc at Utrecht University"
 },
 {
  "avatar": null,
  "name": "Philip Zucker",
  "submissions": [
   "F9PLVY"
  ],
  "code": "EYVZUS",
  "biography": null
 },
 {
  "avatar": null,
  "name": "Dmitry Bagaev",
  "submissions": [
   "J7Z9PL"
  ],
  "code": "F87RD7",
  "biography": "I am a PhD candidate in the SPS group of Electrical Engineering department in Eindhoven University of Technology. My research interests lie in the fields of computer science, software developing, numerical modeling, machine learning, computational optimization and high-performant parallelized applications."
 },
 {
  "avatar": "https://www.gravatar.com/avatar/a52d3af3aeb0bc53290d7da25da03ed2",
  "name": "Chris Foster",
  "submissions": [
   "73XKCM"
  ],
  "code": "FAS33Q",
  "biography": "I'm a long time enthusiastic user of Julia and enjoy contributing to various packages across the open source ecosystem, Julia standard libraries and compiler. I love hearing about people's fascinating technical computing adventures of all types! Find me at https://github.com/c42f"
 },
 {
  "avatar": "https://pretalx.com/media/avatars/wmoses_1_VVEugnL.jpg",
  "name": "William Moses",
  "submissions": [
   "UDJ7SJ"
  ],
  "code": "FEJFGM",
  "biography": "PhD Candidate @ MIT"
 },
 {
  "avatar": "https://pretalx.com/media/avatars/tomer_vII3oH8.jpeg",
  "name": "Tomer Arnon",
  "submissions": [
   "DRMPLU"
  ],
  "code": "FMXGKD",
  "biography": "Ph.D. candidate at the Stanford Intelligent Systems Laboratory, Stanford (USA)."
 },
 {
  "avatar": "https://pretalx.com/media/avatars/JasmineWHalo_tISsyQd.jpg",
  "name": "Jasmine Hughes",
  "submissions": [
   "LNPMBP"
  ],
  "code": "FPS93N",
  "biography": "Jasmine is the Director of Data Science at InsightRX, a precision medicine company. She writes software and develops models to help pharmacists tailor medications to their patients. Jasmine received her PhD in Bioengineering from the University of California, Berkeley. Her thesis was about the interplay between growth factors and mechanical cues in the progression of brain cancer. She also teaches introductory programming workshops."
 },
 {
  "avatar": null,
  "name": "John Brennan",
  "submissions": [
   "38TG38"
  ],
  "code": "FRCXZB",
  "biography": "I am a theoretical physicist working at Irelands national supercomputing centre ICHEC."
 },
 {
  "avatar": "https://pretalx.com/media/avatars/3235132_guYZRYE.png",
  "name": "Mishka (Michael Bukatin)",
  "submissions": [
   "BXEZAQ"
  ],
  "code": "FT77LL",
  "biography": "### main theme\r\n\r\nMy main research focus has been to find, study, and develop a **high-level computer programming formalism\r\nallowing to deform programs in a continuous fashion** (just as one can deform recurrent neural networks in a continuous fashion).\r\n\r\nI was trying to approach this problem from various angles: doing research in the mathematics of continuous domains\r\nfor denotational semantics of programming languages, studying theoretical neuroscience, and so on.\r\n\r\nFinally, our research collaboration was starting to see the hints of the possible solution from approximately Fall of 2012,\r\nand the formalism for continuously deformable programs was developed by our research collaborations in 2015-2016. \r\n\r\nThese days I am continuing to focus on studying and experimenting with this formalism and I am hoping that it will\r\neventually stop being a purely research subject and will become a technology.\r\n\r\nI maintain a Web site for this formalism here: https://anhinga.github.io/\r\n\r\nI also maintain a list of open problems and promising research and technological directions and interdisciplinary\r\nconnections related to this formalism: https://www.cs.brandeis.edu/~bukatin/dmm-collaborative-research-agenda.pdf\r\n\r\n### brief timeline\r\n\r\nMy background in software, mathematics, and science goes back to Soviet Union, to machine code, Algol-60, Fortran-4,\r\nand to punched cards; to Pushchino, the Biological Center of the Soviet Academy of Sciences, and to\r\nthe Mathematical class of Moscow High School number 7.\r\n\r\nI started to focus on continuous models of computations in college, then emigrated to USA, worked as\r\na scientific programmer for Alex Rashin at Biosym Technologies doing computational geometry and computational chemistry\r\n(I was the second author on several papers in _The Journal of Physical Chemistry_ and _Biophysical Chemistry_\r\nfrom that period), then did a PhD in Computer Science at Brandeis University focusing of mathematics\r\nof continuous domains for denotational semantics (this is a copy of my 2002 PhD thesis: https://arxiv.org/abs/1512.03868).\r\n\r\nIn parallel, I worked in various places in the software industry. There I had a chance to first touch\r\ndataflow programming, Common Lisp, and actor model of programming. \r\n\r\nThis century I have been working at a geographic software company (ownership of it went through acquisitions, spin-offs,\r\nand such, so one very long employment looks like several shorter ones from a formal viewpoint), \r\nwhile doing research in parallel. My research focus was mostly on theoretical neuroscience for a while,\r\nthen a research collaboration on deep connections between _partial metrics_ and _fuzzy equalities_, \r\nand finally (from approximately Fall of 2012) a research collaboration\r\non deep connections between _partial contradictions_ and _vector semantics of programming languages_ \r\nand, from 2014-2015 on, a series of research collaborations on _neuromophic computations with linear streams_. \r\n\r\nStarting from about 2011 I was gradually moving from just being a lover of computer animation and electronic music to\r\nmy first attempts to make some visual, audio, and audio-visual art of my own, and I am continuing to make new computer art every few months or so.\r\nIt involved playing a bit with MilkDrop 2 for WinAmp, mixing music a bit with Serato DJ,\r\ndoing a lot of animations and a bit of sound work in Processing, doing a tiny bit of that in Clojure,\r\nand finally working a bit with shader-based GLSL animations.\r\n\r\n### 2015-present\r\n\r\n_Linear streams_ are streams for which linear combinations of several streams are defined. If one makes sure that\r\nlinear computations and general (often non-linear) computations are interleaved, then one gets continuously deformable programs which\r\nwe call **Dataflow matrix machines (DMMs)**. Another way to obtain DMMs is to start with recurrent neural networks\r\nand replace streams of numbers with linear streams and allow complicated \"activation functions\"\r\n(that is, transformations of linear streams) with arbitrary arity.\r\n\r\nThis setup also allows these neural machines to have very natural and flexible self-modification facilities.\r\nThere are toy implementations in Processing with mutable matrices, and the reference implementation in Clojure with\r\nimmutable streams of tree-shaped \"flexible-rank tensors\". The reference paper on DMMs is https://arxiv.org/abs/1712.07447\r\n\r\nI hope to create the next application of this formalism in Julia \r\n(both **Julia Flux** and **JAX** are the machine learning frameworks which finally have sufficient flexibility\r\nwe need to take full advantage of the flexibility of DMMs). I started to switch to Julia in the early 2020.\r\nI recently sketched a three-page note outlining my hopes in this sense: https://www.cs.brandeis.edu/~bukatin/towards-practical-dmms.pdf"
 },
 {
  "avatar": null,
  "name": "Nicki Cartlidge",
  "submissions": [
   "XKJKTB"
  ],
  "code": "G39NKQ",
  "biography": "My coding and musical lives began early, starting piano lessons at the age of 4 and computing with the advent of the ZX80! After an undergrad Masters degree in Electronic Engineering Science and a 20+ year career in Software Testing, I recently completed a Masters of Applied Data Science at the University of Canterbury, New Zealand. I had the opportunity to bring together my love of data, computing and music to explore Sonification for my degree project and I hope to build on it beginning work on a PhD later this year. \r\nAlthough experienced in software engineering, I am new to Julia and keen to contribute to the friendly, supportive, growing community."
 },
 {
  "avatar": null,
  "name": "George Datseris",
  "submissions": [
   "KNWNHJ"
  ],
  "code": "GB8WTV",
  "biography": "Postdoc in climate physics in the MPI for Meteorology (Hamburg) and professional drummer. Lead dev for JuliaDynamics and JuliaMusic."
 },
 {
  "avatar": null,
  "name": "Eric P. Hanson",
  "submissions": [
   "HVSAW9"
  ],
  "code": "GBSYWE",
  "biography": "I recently finished my PhD in quantum information theory at the University of Cambridge. I’m now a Research Scientist working at Beacon Biosignals, trying to make brain monitoring easily accessible, interpretable, and actionable."
 },
 {
  "avatar": "https://pretalx.com/media/avatars/earl_hawaii_yzwLH1a.png",
  "name": "Earl Lawrence",
  "submissions": [
   "Q7WXPH",
   "GJRKY3"
  ],
  "code": "GEBDZP",
  "biography": "Group leader for Statistical Sciences at Los Alamos National Laboratory"
 },
 {
  "avatar": null,
  "name": "Luca Lubeto",
  "submissions": [
   "TQ8GS3"
  ],
  "code": "GEKS77",
  "biography": "My name is Luca Luberto and I am a PhD student at the Institute of Computational Phyiscs in Engineering, Technical University of Kaiserslautern. \r\nCurrently I am working on the simulation of selective laser melting."
 },
 {
  "avatar": "https://pretalx.com/media/avatars/zoom_me_ltDf7qR.png",
  "name": "Matthew A Tillman-Hart",
  "submissions": [
   "R7G87P"
  ],
  "code": "GJP3ZR",
  "biography": "Will Fill out later"
 },
 {
  "avatar": "https://www.gravatar.com/avatar/8af4d5971a2308b86a94f58fb98129c5",
  "name": "Jameson Nash",
  "submissions": [
   "YFCXJD"
  ],
  "code": "GKZDHU",
  "biography": "I work for Julia Computing on Julia compiler technology."
 },
 {
  "avatar": "https://pretalx.com/media/avatars/6C73732A-A749-4101-96D5-D36B6274B453_OSjFN66.jpeg",
  "name": "Pierre Walker",
  "submissions": [
   "7PVG8Z"
  ],
  "code": "GNS83F",
  "biography": "I am an Imperial chemical engineering undergraduate with a great interest in all things related to thermodynamics! I’ve been using Julia for the past two years to develop an extensible open-source implementation of equations of state: OpenSAFT"
 },
 {
  "avatar": "https://pretalx.com/media/avatars/avatar_rp1dkRf.png",
  "name": "Julian P Samaroo",
  "submissions": [
   "DAQSUR",
   "VK87Q3",
   "RXBMHE",
   "3TLU8P"
  ],
  "code": "GRFD9D",
  "biography": "I am an HPC software engineer working at the JuliaLab. I maintain Dagger.jl, AMDGPU.jl, and BPFnative.jl, and generally enjoy the challenge of hacking on compilers and HPC runtimes."
 },
 {
  "avatar": "https://pretalx.com/media/avatars/claudia_FJnXOmD.JPG",
  "name": "Claudia Solis-Lemus",
  "submissions": [
   "DQJNVA"
  ],
  "code": "GRHU7U",
  "biography": "I am an assistant professor at the Wisconsin Institute for Discovery and the Department of Plant Pathology at the University of Wisconsin-Madison. Originally from Mexico City, I did my Undergraduate degrees in Actuarial Sciences and Applied Mathematics at ITAM. Then, I did a MA in Mathematics and a PhD in Statistics at the University of Wisconsin-Madison.\r\nIn my spare time, I enjoy swimming, running, biking, climbing and yoga!\r\nPronouns: she/her"
 },
 {
  "avatar": "https://pretalx.com/media/avatars/profile2_5zANZDs.png",
  "name": "Júlio Hoffimann",
  "submissions": [
   "SLUMQM"
  ],
  "code": "GUDMS8",
  "biography": "Dr. Júlio Hoffimann is a research scientist with more than 10 years of experience in advanced statistical theories for geosciences. He is the author and lead developer of the [GeoStats.jl](https://github.com/JuliaEarth/GeoStats.jl) framework, as well as various other [open source projects](https://github.com/JuliaEarth) that are widely used by geoscientists around the world: https://juliohm.github.io"
 },
 {
  "avatar": "https://pretalx.com/media/avatars/Clayton_Artsy_3hVzSOX.jpg",
  "name": "Clayton E. Tillman",
  "submissions": [
   "M7WHPU"
  ],
  "code": "GUVNAG",
  "biography": "Highly trained and experienced analytics expert using proven and state-of-the-science statistical methods and machine learning to help eliminate waste, maximize return on investment, and improve business processes.\r\n\r\nExperienced .NET specialist specializing in custom Windows or Web-based applications that help make better decisions, track inventory and increase efficiency, improve marketing efforts, manage supply chain, and provide other analytics-based solutions.\r\n\r\nWhat I am really, really interested in is machine-learning created music. I am new to Julia and extremely excited to leverage the elegant language in my pursuit of human-machine musical collaboration."
 },
 {
  "avatar": "https://www.gravatar.com/avatar/7e76579d61a3dabf3576b93f7f078806",
  "name": "Bart Janssens",
  "submissions": [
   "EJASMD"
  ],
  "code": "H3TNC7",
  "biography": "Bart Janssens is a military associate professor at the mechanics department of the [Royal Military Academy](https://www.rma.ac.be), with a passion for computer graphics, high performance computing and fluid mechanics. For performance reasons, he used C++ until being introduced to Julia. His current work focuses on making scientific C++ libraries such as Trilinos interoperate with Julia, in order to port existing CFD code to Julia. He also uses JupyterLab and Pluto in his engineering (thermodynamics and gas turbines mostly) courses."
 },
 {
  "avatar": "https://pretalx.com/media/avatars/IMG_3860_2_pDkFlYO.jpg",
  "name": "Theo Diamandis",
  "submissions": [
   "8E9BAK"
  ],
  "code": "H8VVYE",
  "biography": "Theo Diamandis is a PhD student studying optimization at MIT."
 },
 {
  "avatar": "https://pretalx.com/media/avatars/photo_QZWCGHs.jpg",
  "name": "Christian Schilling",
  "submissions": [
   "DRMPLU",
   "9KGMHJ"
  ],
  "code": "HB7CMX",
  "biography": "[Christian Schilling](https://www.christianschilling.net/) received his Ph.D. degree in computer science from the University of Freiburg, Germany, in 2018 under the supervision of Andreas Podelski.  He was a postdoctoral research fellow at IST Austria in the group of Thomas A. Henzinger.  Since 2020 he is the interim professor for cyber-physical system at the University of Konstanz, Germany.  Christian's research in the area of formal methods is focused on the analysis, verification, and synthesis of systems with dynamical or machine-learned components. He is a co-lead developer in the JuliaReach ecosystem."
 },
 {
  "avatar": null,
  "name": "Krzysztof Herman",
  "submissions": [
   "TZUQYY"
  ],
  "code": "HE7REJ",
  "biography": "I am a full time academic teacher and researcher at the University of the Bio Bio, Concepcion, Chile.  My research interests are related with sensors and embedded solutions for extreme and hostile environments like polar regions. I am also interested in low level digital hardware development like FPGA and ASIC."
 },
 {
  "avatar": "https://pretalx.com/media/avatars/optomaticaLogo_OMe8UGG.png",
  "name": "Mohamed Zahran",
  "submissions": [
   "BYW9KR"
  ],
  "code": "HFKJQF",
  "biography": "A Machine Learning Engineer with a background in robotics and mechatronics system. My primary focus is in the areas of optimization and AI."
 },
 {
  "avatar": null,
  "name": "Paul Yew",
  "submissions": [
   "7PVG8Z"
  ],
  "code": "HHKEWV",
  "biography": "Thermodynamics enthusiast."
 },
 {
  "avatar": null,
  "name": "Boris Bonev",
  "submissions": [
   "D8E9HH"
  ],
  "code": "HJ78M8",
  "biography": "I am a PhD student in applied mathematics with Prof. Jan S. Hesthaven at EPFL. I am interested in novel computational methods for problems arising in engineering and scientific computing. I have been working in the field of Computational Linear Algebra to help develop new methods for solving linear systems. Coming from Matlab, Julia has taught me that fast code and readable code are not mutually exclusive."
 },
 {
  "avatar": "https://www.gravatar.com/avatar/a45f6d58f8e762f9d32ab7b0cf53da7a",
  "name": "Cruor",
  "submissions": [
   "NVLQT7"
  ],
  "code": "HJG83F",
  "biography": "Developer of [Ahorn](https://github.com/CelestialCartographers/Ahorn) and similar tools."
 },
 {
  "avatar": "https://www.gravatar.com/avatar/8f473e0939d6631fbe2d3c8f05343d06",
  "name": "Weiqi Ji",
  "submissions": [
   "GJQWXN"
  ],
  "code": "HMRW37",
  "biography": "I am a postdoc researcher in the mechanical engineering department at the Massachusetts Institute of Technology. I develop interpretable machine learning for modeling dynamics in thermal fluids and biomedical applications."
 },
 {
  "avatar": null,
  "name": "Przemysław Szufel",
  "submissions": [
   "NVSXHU"
  ],
  "code": "HNA89P",
  "biography": "Przemysław Szufel is an Assistant professor at SGH Warsaw School of Economics, Poland and an     Adjunct Professor, Cybersecurity Research Lab, Ted Rogers School of Management, Ryerson University, Toronto. \r\n\r\nHe has first started using Julia at the version 0.3. He is a co-author of the book “Julia 1.0 Programming Cookbook: Over 100 numerical and distributed computing recipes for your daily data science workﬂow” which has been translated by O’Reilly from English to Japanese. Przemysław also holds currently 4-th place on the StackOverflow portal answering Julia-related questions. He is the maintainer and co-auhtor of three Julia libraries in the public repository: [OpenStreetMapX](https://github.com/pszufe/OpenStreetMapX.jl),   [OpenStreetMapXPlot](https://github.com/pszufe/OpenStreetMapXPlot.jl) and [SimpleHypergraphs](https://github.com/pszufe/SimpleHypergraphs.jl). \r\n He is a co-author of over 40 publications, including handbooks and journal papers, in the area of applying advanced analytics, machine learning, simulation methods and optimization."
 },
 {
  "avatar": null,
  "name": "Toby Driscoll",
  "submissions": [
   "WJEXYM"
  ],
  "code": "HXUXL9",
  "biography": "Toby Driscoll is a Professor of Mathematical Sciences at the University of Delaware and founding director of the Center for Applications for Mathematics in Medicine. His research is in scientific computing, numerical methods for differential equations, modeling, and biomedical applications. He is the author of the Schwarz-Christoffel Toolbox for MATLAB and a leading contributor to the Chebfun software project. He is author or co-author of four books and is working on a Julia version of the textbook *Fundamentals of Numerical Computation*."
 },
 {
  "avatar": "https://www.gravatar.com/avatar/2989a078f4caff6fb86fa30e59bd9aa9",
  "name": "Tim Holy",
  "submissions": [
   "VY9UVX",
   "LE38LV"
  ],
  "code": "J9BSUH",
  "biography": "Timothy E. Holy is the Alan A. and Edith L. Wolff Professor of Neuroscience and Biomedical Engineering at Washington University in St. Louis. His lab combines technological innovation with analysis of the rules governing neuronal function and computation. His work on Julia includes contributions to the type system, the array and broadcasting infrastructure, the standard library, and developer tools like the profiler, debugger, Revise, and many others."
 },
 {
  "avatar": null,
  "name": "Alissa Johnson",
  "submissions": [
   "BEEHC8"
  ],
  "code": "J9CLTY",
  "biography": "Alissa is a first year research analyst at the Federal Reserve Bank of New York. She has a B.A. from Grinnell College, double-major in Economics and Computer Science."
 },
 {
  "avatar": "https://www.gravatar.com/avatar/d99ee1f43735c47968810bad35938825",
  "name": "Miguel Raz Guzmán Macedo",
  "submissions": [
   "G8LARY",
   "ZVAKDW"
  ],
  "code": "JE89PF",
  "biography": "Physics Undergraduate based in Mexico City, UNAM. I enjoy handstands and coding in Julia."
 },
 {
  "avatar": "https://pretalx.com/media/avatars/elujan_ixzGgJj.jpg",
  "name": "Emmanuel Lujan",
  "submissions": [
   "ZSCFTW"
  ],
  "code": "JERCK8",
  "biography": "Postdoctoral Associate at Julia Lab, Massachusetts Institute of Technology."
 },
 {
  "avatar": null,
  "name": "Zhen Wu",
  "submissions": [
   "FEZW9Q"
  ],
  "code": "JFA3PF",
  "biography": null
 },
 {
  "avatar": "https://pretalx.com/media/avatars/CARION_CIV_TAQnLBu.jpg",
  "name": "Tristan Carion",
  "submissions": [
   "KD7MR7"
  ],
  "code": "JFWGMZ",
  "biography": "Tristan Carion is a mechanical engineer from UCL (Université Catholique de Louvain-la-Neuve) in Belgium. After graduating in 2016, he spent a few years working for the industry. He also spent some time traveling the world. He went back to the academic world in 2020 where he joined the Royal Military Academy of Belgium (RMA) as a researcher. He is working for a joint project of RMA, ECMWF and RMI (Royal Meteorological Institute of Belgium), which consists of implementing atmospheric dispersion models and response models on the ECMWF Weather Cloud and use the ensemble forecasts from ECMWF to produce ensemble dispersion modeling."
 },
 {
  "avatar": null,
  "name": "Oswaldo A.M",
  "submissions": [
   "78L3MP"
  ],
  "code": "JHM77R",
  "biography": "PhD in Engineering Science by Tecnologico de Monterrey, Mexico. \r\nCurrent postdoctoral fellow at University of Waterloo.\r\nMy research interests include: optimal control, model predictive control, scheduling and nonlinear optimization of chemical and energy processes."
 },
 {
  "avatar": "https://www.gravatar.com/avatar/7b4b15f59f1cef4cbe60e69ad650fa6b",
  "name": "Vexatos",
  "submissions": [
   "NVLQT7"
  ],
  "code": "JHSX7T",
  "biography": "Developer of [Ahorn](https://github.com/CelestialCartographers/Ahorn) and similar tools. Using Julia professionally since 2017."
 },
 {
  "avatar": null,
  "name": "Alex Hall",
  "submissions": [
   "CAMR3P"
  ],
  "code": "JKQ7ND",
  "biography": null
 },
 {
  "avatar": null,
  "name": "Takafumi Arakaki",
  "submissions": [
   "3JQKRW",
   "MENJSR"
  ],
  "code": "JQB3XK",
  "biography": "I'm a postdoc at Julia Lab. I'm working on parallelism and compiler."
 },
 {
  "avatar": null,
  "name": "Avik Sengupta",
  "submissions": [
   "RS9B7Q"
  ],
  "code": "JR9GPS",
  "biography": "Avik Sengupta is the head of product development and software engineering at Julia Computing, contributor to open source Julia and maintainer of several Julia packages, including JavaCall, TextAnalysis and GameZero. Avik is the author of Julia High Performance, co-founder of two artificial intelligence start-ups in the financial services sector and creator of large complex trading systems for the world's leading investment banks."
 },
 {
  "avatar": "https://www.gravatar.com/avatar/832d10ca3b2825c42d2280cbeca6fef6",
  "name": "Simon Danisch",
  "submissions": [
   "FLQBDG"
  ],
  "code": "JSJDXE",
  "biography": "Simon Danisch is a senior developer at Beacon-Biosignals. Simon has been part of the Julia community for more than 8 years and has contributed many Julia packages:\r\n\r\n* [GeometryBasics](https://github.com/JuliaGeometry/GeometryBasics.jl)\r\n* [GPUArrays](https://github.com/JuliaGPU/GPUArrays.jl)\r\n* [Makie](https://github.com/JuliaPlots/Makie.jl/)\r\n* [PackageCompiler](https://github.com/JuliaLang/PackageCompiler.jl/)\r\n* [JSServe](https://github.com/SimonDanisch/JSServe.jl)\r\n* [FileIO](https://github.com/JuliaIO/FileIO.jl)"
 },
 {
  "avatar": "https://pretalx.com/media/avatars/clima-crop_5o14OCY.png",
  "name": "Gregory Wagner",
  "submissions": [
   "DZC7HN"
  ],
  "code": "JVB98C",
  "biography": "Research scientist and ocean physicist at MIT"
 },
 {
  "avatar": "https://pretalx.com/media/avatars/Doolittle_Brian__21011_CLKqN3v.jpg",
  "name": "Brian Doolittle",
  "submissions": [
   "L9EAPP"
  ],
  "code": "K3WUDL",
  "biography": "Brian Doolittle (They/Them) is 3rd year physics PhD student at the University of Illinois Urbana-Champaign where they research nonlocality in quantum networks. Before graduate school Brian worked as a  software engineer at AthenaHealth developing clinical decision support systems and open standards for healthcare interoperability."
 },
 {
  "avatar": "https://pretalx.com/media/avatars/profile_picture_jvnHESk.png",
  "name": "Johannes Blaschke",
  "submissions": [
   "QDHGNV"
  ],
  "code": "K9PVSE",
  "biography": "Johannes Blaschke is a computer systems engineer at the National Energy Research Scientific Computing Center (NERSC), where he is engaging with scientists to help them optimize their software for the next-generation supercomputers. His work focuses on enabling the real-time reconstruction of x-ray scattering data using extreme-scale computing environments. Johannes received his PhD in Theoretical Physics from the University of Goettingen, while researching statistical mechanics problems at the Max Planck Institute for Dynamics and Self-Organization. After his PhD, Johannes developed fluid-structure interaction codes for fluctuating hydrodynamics simulations of multi-phase and active matter simulations at the Technical University of Berlin and the Center for Computational Sciences and Engineering at Lawrence Berkeley National Laboratory. In 2019 Johannes joined the Data Science Engagement Group at NERSC."
 },
 {
  "avatar": "https://www.gravatar.com/avatar/1d9a68cf6dcb5209a50f3919408cb3b5",
  "name": "Max Horn",
  "submissions": [
   "WQ8MJK"
  ],
  "code": "KCSGU7",
  "biography": "Since April 2020 I am full professor for Algorithmic Algebra and Geometry at TU Kaiserslautern, Germany. My research focuses on computer algebra, group theory and algebraic Lie theory.\r\n\r\nBesides being one of the principal investigators on the grant behind OSCAR, and one of its developers, I am also core developer of the [GAP](https://www.gap-system.org) computer algebra system for computational group theory.\r\n\r\nOutside of mathematics, I've been involved in many open source projects over the past decades; e.g. in the distant past, I served as project leader for [ScummVM](https://www.scummvm.org) as well as the [Fink project](https://www.finkproject.org), and contributed to [TeXShop](https://texshop.org)."
 },
 {
  "avatar": "https://www.gravatar.com/avatar/6f75257683625cb2a5398f3d610c5355",
  "name": "Helge Eichhorn",
  "submissions": [
   "TJ3FNS",
   "GLTEMP"
  ],
  "code": "KDTCJJ",
  "biography": "I am a mechanical engineer working on ground systems software in the European space industry.\r\n\r\nWorking on reimagining space exploration with Open Source at [JuliaAstro](https://github.com/JuliaAstro), [JuliaSpace](https://github.com/JuliaSpace), and [OpenAstrodynamics](https://github.com/openastrodynamics)."
 },
 {
  "avatar": "https://pretalx.com/media/avatars/biswasPhoto_Hdx61n5.png",
  "name": "Ayan Biswas",
  "submissions": [
   "Q7WXPH"
  ],
  "code": "KDURNQ",
  "biography": "Ayan Biswas is a scientist in the Data Science at Scale team (CCS-3) at Los Alamos National Laboratory. His research interests include exascale data analysis and reduction, in situ workflows, uncertainty quantification, statistical analysis/inference and high-dimensional data visualization. He also has vast experience in working with vector fields and information theory applications for visualization and analysis. He received his PhD in Data Visualization from The Ohio State University in 2016. Contact him at ayan@lanl.gov."
 },
 {
  "avatar": "https://pretalx.com/media/avatars/Sk%C3%A4rmavbild_2020-05-11_kl._19.43.35_3qEJgTN.png",
  "name": "Axel Larsson",
  "submissions": [
   "WWP7DR"
  ],
  "code": "KGLG9D",
  "biography": "Hi there! My name is Axel and I'm an intern at TNO, the Netherlands Organisation for Applied Scientific Research, working with Scientific Machine Learning for predicting structural responses. The internship is a part of my master thesis at University College London.\r\n\r\nMy fields of interest are computational structural engineering and computational design. Over the years, I've become more interested in more computing related topics like HPC, parallell processing and machine learning. This fall, I will move to the U.S. to start my PhD in Civil Engineering at Princeton University. I'm very interested in Julia for my future research and seeking collaborators in the Julia community."
 },
 {
  "avatar": null,
  "name": "Annika Faucon",
  "submissions": [
   "PDMYDR"
  ],
  "code": "KJRBM3",
  "biography": "I am a doctoral candidate in Vanderbilt’s human genetics PhD training program."
 },
 {
  "avatar": null,
  "name": "Rainer Heintzmann",
  "submissions": [
   "XWXEH3"
  ],
  "code": "KTPRLZ",
  "biography": null
 },
 {
  "avatar": "https://pretalx.com/media/avatars/53456660_2234851459871400_8967006156216074240_n_mWCBAES.jpg",
  "name": "Richard Gankema",
  "submissions": [
   "CAMR3P"
  ],
  "code": "KUKVJF",
  "biography": "Richard Gankema is a Computer Scientist at RelationalAI, working on various systems-related topics such as data structures, memory management and query execution. Before joining RelationalAI he worked as a PhD candidate at CWI’s Database Architectures group in Amsterdam, which sparked his interest in vectorization and other techniques for optimizing the performance of data-processing."
 },
 {
  "avatar": "https://pretalx.com/media/avatars/jf_portrait_current_RRowBAu.jpg",
  "name": "Johannes Fleck",
  "submissions": [
   "THTPGL"
  ],
  "code": "KUUWQU",
  "biography": "I am a PhD candidate in economics at the European University Institute in Florence, a guest researcher at the University of Oslo and a visiting scholar at the University of Minnesota and the Federal Reserve Bank of Minneapolis.\r\n\r\nMy research interests are macroeconomics, fiscal policy and computational methods. I also work on household finance and machine learning.\r\n\r\nhttps://www.jofleck.com  //  https://twitter.com/_jofleck"
 },
 {
  "avatar": null,
  "name": "Clayton Barrows",
  "submissions": [
   "88EDGD"
  ],
  "code": "KUWVG3",
  "biography": "Clayton Barrows is a member of the Forecasting and Modeling Group at the National Renewable Energy Laboratory. His research focuses on improving the technical and economic efficiency of energy systems through advanced computation and analysis. At NREL, Clayton leads a team in developing and utilizing energy and infrastructure systems models to gain new insights into pathways towards system modernization. In his research, Clayton draws upon deep experience in applying the tools of network science and optimization to improve the fidelity and scalability of infrastructure systems models. He has applied these techniques to inform policy in studies and applications around the world."
 },
 {
  "avatar": "https://pretalx.com/media/avatars/markus4-512x512_6shkmn7.jpg",
  "name": "Markus Kuhn",
  "submissions": [
   "TEKDX9"
  ],
  "code": "KXAMEK",
  "biography": "Senior Lecturer (associate professor) with the University of Cambridge Department of Computer Science."
 },
 {
  "avatar": null,
  "name": "Santiago Badia",
  "submissions": [
   "HFHLDS"
  ],
  "code": "KYRPFM",
  "biography": "Santiago Badia is Professor of Computational Mathematics at Monash since June 2019. He obtained his PhD at Universitat Politècnica de Catalunya (UPC) in 2006. Previously, he worked at the Applied Mathematics departments at Politecnico di Milano (Italy) in 2006 and Sandia National Labs (New Mexico, USA) in 2007-08. He joined UPC in 2009, where he was appointed Professor of Computational Science and Engineering in 2017. He is adjoint researcher at CIMNE (Barcelona), where he leads the Large Scale Scientific Computing Department.\r\n\r\nHe works on the numerical approximation of partial differential equations (PDEs), e.g., using finite element methods, for modelling fluid and solid mechanics, electromagnetics, and multiphysics problems. He is particularly interested in large scale scientific computing and numerical linear algebra.\r\n\r\nAs a by-product of his research, Prof Badia leads some high-performance scientific projects, like FEMPAR. FEMPAR provides state-of-the-art numerical discretizations of PDEs and highly scalable numerical linear algebra solvers. FEMPAR has been used to model metal additive manufacturing, superconductor devices, breeding blankets in fusion reactors, or nuclear waste repositories. It has attained perfect weak scalability up to 458,672 cores in JUQUEEN (Germany) solving up to 60 billion unknowns. In 2019 he co-started the Gridap project, which heavily relies on functional programming and multiple dispatching in Julia, with the aim to create an easy-to-use but very efficient PDE solver."
 },
 {
  "avatar": null,
  "name": "Russell Bent",
  "submissions": [
   "ACVGEZ"
  ],
  "code": "LJTGEG",
  "biography": "Russell Bent (Ph.D.) is a scientist in the Applied Mathematics and Plasma Physics Group (T-\r\n5), where he leads LANL’s inter-organizational Advanced Network Sciences Initiative (ANSI).\r\nANSI is an interdisciplinary initiative that enables fundamental and applied research to\r\naddress long-term challenges in critical infrastructure design, operation, and security. Dr.\r\nBent is the principal investigator for several DOE projects in critical infrastructure systems\r\nresearch and development that focus on improving robustness of infrastructure systems to\r\nextreme events, increasing resilience of distribution networks, modeling interdependencies\r\nbetween systems, managing disasters that impact critical infrastructure, modeling smart\r\ngrid technologies, and developing methods for mixed-integer, non-linear optimization. He is\r\nalso the lead developer for the software Alpine, A Global Solver for Nonconvex MINLPS and\r\nthe software GasModels.jl, a toolbox for modeling natural gas systems. He is the author of\r\none book, Online Stochastic Combinatorial Optimization, and over 100 peer reviewed\r\njournal and conference publications."
 },
 {
  "avatar": "https://www.gravatar.com/avatar/e8b4c754f59079ee0f56ba77d7f2066f",
  "name": "Daniel Molina",
  "submissions": [
   "KJNRGA"
  ],
  "code": "LM37DY",
  "biography": "I am associate professor at the University of Granada, in Computer Science, with experience in Artificial Intelligence, in particular in Intelligence Optimization and in Machine Learning. In my daily life I am a  believer of free software (use daily Emacs, Linux, ...). I have been for years a great Python fan, and more recently fan of Julia, in which I have created several small  but useful packages.  [personal website](https://dmolina.github.io/)."
 },
 {
  "avatar": null,
  "name": "Connor Burns",
  "submissions": [
   "39ZFBF"
  ],
  "code": "LNLWJE",
  "biography": "Soon-to-be college student who loves everything related to computers and virtual reality"
 },
 {
  "avatar": null,
  "name": "Will Tebbutt",
  "submissions": [
   "3BFJZ7"
  ],
  "code": "LQKANJ",
  "biography": "I'm a PhD student in the Machine Learning group in Cambridge.\r\nI primarily work on Gaussian processes -- how to scale them to large data sets, how to use them in climate science, and how best to write software that implements them."
 },
 {
  "avatar": null,
  "name": "Matthew Sun",
  "submissions": [
   "AGCHEV"
  ],
  "code": "LQVD7M",
  "biography": "Computer Science PhD student at Princeton University's Center for Information Technology Policy (CITP)."
 },
 {
  "avatar": null,
  "name": "Joaquim Dias Garcia",
  "submissions": [
   "WULB78"
  ],
  "code": "LRPWKX",
  "biography": null
 },
 {
  "avatar": "https://pretalx.com/media/avatars/zoe_2021_headshot_4pd2EIw.jpg",
  "name": "Zoe McCarthy",
  "submissions": [
   "VLVRKK"
  ],
  "code": "LRPXDZ",
  "biography": "Zoe McCarthy is a research engineer with a background in robotics, deep learning, reinforcement learning, and virtual reality.  She is currently working at the MIT Julia Lab to make extensions and maintenance in the SciML ecosystem."
 },
 {
  "avatar": "https://pretalx.com/media/avatars/witte_profile_picture_GwOx8ka.png",
  "name": "Philipp A. Witte",
  "submissions": [
   "TXAWKU",
   "EVR3HZ"
  ],
  "code": "LSJRYM",
  "biography": "Philipp A. Witte is a researcher at Microsoft Research for Industry (RFI), a new initiative within Microsoft for developing innovative research solutions for industry-related problems ranging from AI/ML to edge- and high-performance computing. Prior to Microsoft, Philipp received his B.Sc. and M.Sc. in Geophysics from the University of Hamburg and his Ph.D. in Computational Science and Engineering from the Georgia Institute of Technology. During his Ph.D., Philipp worked with Professor Felix J. Herrmann at the Seismic Laboratory for Imaging and Modeling (SLIM) on computational aspects of least squares seismic imaging and full-waveform inversion. He has authored and contributed to multiple open-source software packages, including Devito, the Julia Devito Inversion framework (JUDI) and InvertibleNetworks.jl, a Julia framework for deep learning with normalizing flows."
 },
 {
  "avatar": "https://pretalx.com/media/avatars/GH_headshot_VdSytpj.png",
  "name": "Glen Hertz",
  "submissions": [
   "QUCAK3"
  ],
  "code": "LSR3KJ",
  "biography": "Glen Hertz has spent 15 years as a field applications engineer supporting customers of commercial SPICE simulators.  He joined Julia Computing as the Principal EDA Solutions Architect in 2021 to direct the JuliaSPICE product."
 },
 {
  "avatar": null,
  "name": "Sungho Shin",
  "submissions": [
   "A3Z33C"
  ],
  "code": "LTCS8H",
  "biography": null
 },
 {
  "avatar": "https://pretalx.com/media/avatars/19895089_10155351735541397_5962411915609773178_n_rnCs9oM.jpg",
  "name": "Stuart Baumann",
  "submissions": [
   "NXJYHT"
  ],
  "code": "LTPLMY",
  "biography": "I hold a PhD Economics from the University of Edinburgh. I work in London as a quantitative research in cash equities. I have done a few open source numerical mathematics packages mainly in fixed point acceleration and shape preserving splines."
 },
 {
  "avatar": null,
  "name": "Raj Dandekar",
  "submissions": [
   "FJLE7U"
  ],
  "code": "LWEMM8",
  "biography": "4th year PhD student at the Julia Lab, MIT."
 },
 {
  "avatar": "https://pretalx.com/media/avatars/Paul_2015_nUF45Ox.jpg",
  "name": "Paul Bayer",
  "submissions": [
   "PFWXF9"
  ],
  "code": "LXNRLJ",
  "biography": "Profession: Mechanical engineer\r\nLocation: Germany, Landshut\r\nGithub: https://github.com/pbayer\r\nLinkedin: https://www.linkedin.com/in/paul-bayer-4104a78/"
 },
 {
  "avatar": null,
  "name": "Jean-François BAFFIER (azzaare@github)",
  "submissions": [
   "8LL9QH"
  ],
  "code": "LZTBFS",
  "biography": "Jean-François Baffier is an academic researcher at the RIKEN Center for Advanced Intelligence Project (AIP), and a consultant in Artificial Intelligence, Big Data Science, Data Structures, and Algorithms. As an academic, he gives back to society through fundamental research in computer science supplemented by open source libraries and softwares.\r\nHis current research project involves the study of the “Analysis of information networks,” the “Smart compression for high-scalability of data structures,” and “Explainable Artificial Intelligence.” Other topic of interest covers modeling of failures and routing in Networks, Game Analysis, and AI for Games."
 },
 {
  "avatar": null,
  "name": "Valentin Churavy",
  "submissions": [
   "ZYPPNH"
  ],
  "code": "M33JR7",
  "biography": null
 },
 {
  "avatar": null,
  "name": "Simone Azeglio",
  "submissions": [
   "X9RATL"
  ],
  "code": "M938SQ",
  "biography": null
 },
 {
  "avatar": null,
  "name": "Matt Brzezinski",
  "submissions": [
   "Z9UL8P"
  ],
  "code": "M99LZJ",
  "biography": "Software Developer at Invenia Technical Computing."
 },
 {
  "avatar": "https://pretalx.com/media/avatars/headshot_yM1sK3z.jpg",
  "name": "David M Fobes",
  "submissions": [
   "F8BBVZ"
  ],
  "code": "MBYSCD",
  "biography": "David Fobes (Ph.D.) is a scientist at Los Alamos National Laboratory in the Information Systems and Modeling group. Prior to joining LANL in 2015, he obtained a PhD in physics from Tulane University. At LANL, he specializes in development and implementation of algorithms for critical infrastructure systems, focusing on optimization of unbalanced multi-phase electric distribution systems, and post-event system evaluation and restoration, and has served on multiple projects for DOE and DHS in these areas. He is the lead developer of PowerModelsDistribution, a critical library for distribution system optimization relied upon by several ongoing projects, and has led and participated in a variety of other software development efforts in the infrastructure modeling space, including serving as Scrum Master and developer for a team focused on modeling the inter-dependencies between electric and natural gas infrastructure systems using co-simulation. He is an author of over 43 peer reviewed journal and conference publications, is a certified Scrum Master, and has received multiple awards for his infrastructure optimization works."
 },
 {
  "avatar": "https://pretalx.com/media/avatars/Saranjeet-Kaur-Bhogal_zon7FNE.jpg",
  "name": "Saranjeet Kaur Bhogal",
  "submissions": [
   "SKNH7J"
  ],
  "code": "MCGB3X",
  "biography": "I am currently pursuing MPhil in Statistics from University of Pune, India. I have worked as a Student Developer for Google Summer of Code 2020 with The Julia Language Organisation, during which I built the algorithmic variants of the nested sampling algorithm in Julia. I am also working with the R Contribution Working Group to develop a novice-friendly \"R Developer's Guide\"."
 },
 {
  "avatar": null,
  "name": "Jeremiah DeGreeff",
  "submissions": [
   "P8ZEEB"
  ],
  "code": "MDTTZU",
  "biography": "Second year undergraduate at MIT studying Computer Science and Engineering.\r\n\r\ndegreeff@mit.edu\r\nhttps://github.com/jrdegreeff"
 },
 {
  "avatar": null,
  "name": "Alinson Santos Xavier",
  "submissions": [
   "XNVLKH"
  ],
  "code": "MF33DM",
  "biography": null
 },
 {
  "avatar": null,
  "name": "Jeremiah Lewis",
  "submissions": [
   "ZUPX83"
  ],
  "code": "MHJGHB",
  "biography": "Over the course of six years in data I’ve optimized digital marketing, applied machine learning to the contemporary art world, and contributed to the digitization of the automobile industry. I am currently a Master’s student in Economics at the Humboldt University in Berlin."
 },
 {
  "avatar": "https://pretalx.com/media/avatars/cropped_1800x1800_300dpi_XOb5zbZ.png",
  "name": "Jonathan Doucette",
  "submissions": [
   "WT8PHT"
  ],
  "code": "MJ9ECN",
  "biography": "MRI physics PhD student at the University of British Columbia. I study brain tissue microstructure by simulating MRI signals and using Bayesian learning for fast parameter inference."
 },
 {
  "avatar": null,
  "name": "Stephan Sahm",
  "submissions": [
   "UQGV9C",
   "BB97DT"
  ],
  "code": "MJPZGQ",
  "biography": "Stephan Sahm is Senior Data Science and ML Engineering Consultant. Having programmed in Java, Matlab, Python, R, Scala and Julia he appreciates the combination of simplicity and speed which the Julia language brings to Data Science. With master degree in math/stochastics and cognitive science together with 5 years industry experience he can help you bring your favourite Data idea into production."
 },
 {
  "avatar": "https://www.gravatar.com/avatar/0a94fac444acd899548d393a55ee5b3c",
  "name": "Benoît Legat",
  "submissions": [
   "PRFW3N",
   "L8DTE3"
  ],
  "code": "MLJG3F",
  "biography": "Benoît Legat is a postdoctoral associate at MIT with Prof. Pablo Parrilo\r\nin the Laboratory for Information and Decision Systems (LIDS).\r\nHe received his Ph.D. degree in applied mathematics from the UCLouvain, Belgium, in 2020.\r\nHis research interests include mathematical optimization, invariant set computation and\r\noptimal control."
 },
 {
  "avatar": "https://www.gravatar.com/avatar/d788bf7fd037ebef5798d8881c5faa2f",
  "name": "Jacob Quinn",
  "submissions": [
   "Z7ZLTP"
  ],
  "code": "MQ3SJP",
  "biography": "Been a Julia enthusiast for a long time, since Julia 0.1! Always been interested in data engineering, making data processing more efficient, and various data formats, and Julia is just such a fun tool to dive into these kinds of problems."
 },
 {
  "avatar": "https://www.gravatar.com/avatar/749aed7820b87920c03fab45475ce1af",
  "name": "Caleb Winston",
  "submissions": [
   "3CJQWH"
  ],
  "code": "MQTPBB",
  "biography": "Caleb Winston is a co-creator of Banyan and the creator of Emu, a GPGPU framework for Rust. In the past, he has worked on GPU-accelerated data science at NVIDIA and virtualization for wet labs at the Molecular Information Systems Lab at the University of Washington, Seattle. His primary interests are in making computing at both massive scale and the edge accessible for anyone to easily program."
 },
 {
  "avatar": "https://pretalx.com/media/avatars/119168518_10223620075676122_5169123052777546821_n_TCKzV9f.jpg",
  "name": "Saravana Kumar",
  "submissions": [
   "V3N73B"
  ],
  "code": "N9LFTG",
  "biography": "I'm a software engineer at Amazon working on Amazon Braket, a managed quantum computing platform. I graduated from The Ohio State University with a Master's in Computer Science in August 2019. I worked on high performance computing for representation learning in graphs at the Data Mining Research Laboratory at OSU. I dabble in quantum computing, graphs, high performance computing and most recently in serverless compute."
 },
 {
  "avatar": null,
  "name": "Gustavo Nunes Goretkin",
  "submissions": [
   "CBDFPN"
  ],
  "code": "N9TKUU",
  "biography": "I am a late-stage Ph.D. student in Robotics at MIT CSAIL, and I first used \"Julia\" in 2012!"
 },
 {
  "avatar": null,
  "name": "Luca Bottero",
  "submissions": [
   "X9RATL"
  ],
  "code": "NARPBB",
  "biography": "I am an undergraduate physics student at the University of Turin. I have a strong interest in many aspects of physics, ranging from theoretical physics to HEP and cosmology. Currently I am doing my undergraduate thesis about the study of the properties of the hypertriton nuclei with ALICE's data using machine learning techniques. Meanwhile, I am one of the co-founder of MLJC, a student association that focuses on ML research and know-how sharing. My interest are mainly on scientific ML, NLP & NLU, and the theoretical aspects of ML. One of my strongest motivation is to help accelerating pure sciences using ML approaches. I participated in the ProjectX 2020 competition held by the University of Toronto in the UniTo team."
 },
 {
  "avatar": null,
  "name": "Chen Zhao",
  "submissions": [
   "NWFRP9"
  ],
  "code": "NBKREV",
  "biography": "Quantum computing | quantum machine learning\r\n\r\nGitHub: [ChenZhao44](https://github.com/ChenZhao44), \r\nTwitter: [@ChenZhao44](https://twitter.com/ChenZhao44)"
 },
 {
  "avatar": null,
  "name": "Valerio Pagliarino",
  "submissions": [
   "X9RATL"
  ],
  "code": "NGFW3E",
  "biography": "Valerio is a student in Physics (Bachelor) at the University of Turin. He is interested in electronics, embedded systems, computing and signal processing as tools for investigating physics, such as the technology of  the detectors employed in high energy physics."
 },
 {
  "avatar": "https://pretalx.com/media/avatars/profilepic_nNdbcSl.jpg",
  "name": "Francesco Martinuzzi",
  "submissions": [
   "NDQTSP"
  ],
  "code": "NGLZHC",
  "biography": "Physics graduate student interested in Scientific Machine Learning."
 },
 {
  "avatar": "https://pretalx.com/media/avatars/20099589_Wt9miMn.png",
  "name": "Ali Ramadhan",
  "submissions": [
   "DZC7HN"
  ],
  "code": "NH7ZDP",
  "biography": "I am a grad student working in computational climate science at MIT. In the Julia world I've mostly been developing Oceananigans.jl. We're building a new climate written in Julia as part of the Climate Modeling Alliance project."
 },
 {
  "avatar": "https://pretalx.com/media/avatars/Foto_NathanaelBosch_smDpR8y.jpg",
  "name": "Nathanael Bosch",
  "submissions": [
   "ZTDMHC"
  ],
  "code": "NHKMML",
  "biography": "I'm a PhD student at University of Tübingen, working on probabilistic numerics, machine learning, and Bayesian inference."
 },
 {
  "avatar": null,
  "name": "Andrei Sarychev",
  "submissions": [
   "EWMZKD"
  ],
  "code": "NRJTSD",
  "biography": "Andrei Sarychev has taught Economics at the University of British Columbia and London School of Economics before joining the UK financial sector regulator. He devised the first scenario design framework for use in the UK stress-testing. At the Bank of England he developed a broad variety of analytical models for use in forecasting, policy analysis, and risk assessment. He also designed the European Central Bank's macro-financial platform. His research interests lie in modelling complex multivariate distributions and Bayesian methods."
 },
 {
  "avatar": "https://pretalx.com/media/avatars/faroe_selfie_ImoBZDN.jpg",
  "name": "Zachary Sunberg",
  "submissions": [
   "HLFY9G"
  ],
  "code": "NRUUVW",
  "biography": "Assistant Professor of Aerospace Engineering at the University of Colorado"
 },
 {
  "avatar": null,
  "name": "John Paul Ryan",
  "submissions": [
   "LXATFU"
  ],
  "code": "NWJDLX",
  "biography": "PhD Candidate in Computer Science at Cornell University"
 },
 {
  "avatar": "https://www.gravatar.com/avatar/48dd40cafb01add09252c631b588f43d",
  "name": "Clark C. Evans",
  "submissions": [
   "FEG39B",
   "9XJTRW"
  ],
  "code": "NWXJWH",
  "biography": "Collaborator on YAML, HTSQL, DataKnots, and other projects that advance the usability of software systems."
 },
 {
  "avatar": "https://pretalx.com/media/avatars/avatar_CyBnV7s.png",
  "name": "Jorge Pérez Zerpa",
  "submissions": [
   "DRMPLU"
  ],
  "code": "PC8YRX",
  "biography": "Jorge Pérez Zerpa obtained a Doctorate in Engineering degree by Universidad de la República in Uruguay, a MSc in Mechanical Engineering degree by Universidade Federal de Rio de Janeiro in Brazil, and did a stage at INRIA's TAO team in France. He is Assistant Professor at the Structures Department of the School of Engineering in Universidad de la República, and Researcher level 1 at ANII.uy . His research work includes the development and application of numerical methods in computational modelling of solids and structures, with focus in constitutive parameter identification methods. He leads the development of the Open Nonlinear Structural Analysis Solver (onsas.org) based in the application of the Finite Element Method."
 },
 {
  "avatar": null,
  "name": "Guilherme Bodin",
  "submissions": [
   "8YGNYU"
  ],
  "code": "PCLZTQ",
  "biography": null
 },
 {
  "avatar": null,
  "name": "Deleted User",
  "submissions": [
   "DRMPLU"
  ],
  "code": "PCUKUA",
  "biography": ""
 },
 {
  "avatar": "https://pretalx.com/media/avatars/personal_photo_f7sorNx.jpg",
  "name": "Mohamed Tarek",
  "submissions": [
   "XV3AH8",
   "MVCXHB"
  ],
  "code": "PFTTSC",
  "biography": "A topology optimization researcher, a co-maintainer of Turing.jl, a scientist at Pumas-AI, and an enthusiastic learner of anything \"scientific computing\"."
 },
 {
  "avatar": null,
  "name": "Gael Forget",
  "submissions": [
   "GBJ3HG",
   "VEUKD9",
   "FEZW9Q"
  ],
  "code": "PFYSJ9",
  "biography": "I work as a reseach scientist at the Massachusetts Institute of Technology (MIT) where I investigate oceanography and climate. As part of the Department of Earth, Atmospheric and Planetary Sciences, my work focuses on ocean modeling and the analysis of global ocean data sets such as Argo profile collections, satellite records of sea level, or ocean color retrievals. I co-develop computer programs in various languages and carry out ocean state estimation using the MIT general circulation model in order to interpolate and interpret ocean observations. My scientific interests include: ocean circulation and climate variability; tracer transport and turbulent transformation processes; interaction of ecological, geochemical, and physical processes; global cycles of heat, water, and carbon; observational statistics; forward and inverse modeling."
 },
 {
  "avatar": "https://pretalx.com/media/avatars/edited_3N65r3t.jpg",
  "name": "Miha Zgubic",
  "submissions": [
   "LWVB39"
  ],
  "code": "PG7DEE",
  "biography": "Miha is a theoretical physicist by training and holds an MSci degree from Imperial College London. After completing his Masters, he moved to the countryside to pursue a PhD at the University of Oxford where he analysed the data from the Large Hadron Collider at CERN searching for a rare decay of the Higgs boson. He now works as a Research Software Engineer at Invenia Labs, where he builds tools that accelerate research in electricity grid efficiency."
 },
 {
  "avatar": null,
  "name": "Romain VELTZ",
  "submissions": [
   "RERJWC"
  ],
  "code": "PGWM93",
  "biography": "I am a researcher at INRIA Sophia Antipolis (France) with interest in Mathematical neurosciences, modeling synaptic plasticity and analysis of PDEs. Please, have a look at my [website](http://romainveltz.pythonanywhere.com)."
 },
 {
  "avatar": "https://www.gravatar.com/avatar/5ac7b1da0f2e9107b5020f88023a15e5",
  "name": "Simon Byrne",
  "submissions": [
   "C3EBJM",
   "KHK7PA",
   "U9SZZU",
   "MXSRY8"
  ],
  "code": "PKSECG",
  "biography": "Simon is the lead software engineer at the [CliMA project](https://clima.caltech.edu/)."
 },
 {
  "avatar": "https://pretalx.com/media/avatars/TobiasKnopp_L0XxMX2.jpg",
  "name": "Tobias Knopp",
  "submissions": [
   "N9JPV7"
  ],
  "code": "PM3B8U",
  "biography": "Tobias Knopp received his Diplom degree in computer science in 2007 and his PhD in 2010, both from the University of Lübeck with highest distinction. For his PhD on the tomographic imaging method Magnetic Particle Imaging (MPI) he was awarded with the Klee award from the DGBMT (VDE) in 2011. From 2010 until 2011 he led the MAPIT project at the University of Lübeck and published the first scientific book on MPI. In 2011 he joined Bruker Biospin to work on the first commercially available MPI system. From 2012 until 2014 he worked at Thorlabs in the field of Optical Coherence Tomography (OCT) as a software developer. Since 2014, Tobias Knopp is a professor for Biomedical Imaging at the University Medical Center Hamburg-Eppendorf and the Hamburg University of Technology in Hamburg, Germany. Beside his work as a researcher in the field of tomographic imaging method Tobias Knopp is an open-source developer and part of the Julia community since 2012."
 },
 {
  "avatar": "https://pretalx.com/media/avatars/monty20210529-body_XPwmcCJ.jpg",
  "name": "Velimir Vesselinov",
  "submissions": [
   "UKASBZ",
   "DXEEDM",
   "93E8GZ"
  ],
  "code": "PMRGDL",
  "biography": "My expertise is in applied mathematics, computer science and engineering. My research is in the general area of data analytics, model diagnostics and machine learning. I am the inventor and lead developer of a series of novel theoretical methods and computational related to machine learning, data analytics, model diagnostics, and data inference tools. I am also a co-inventor of LANL-patented machine-leaning methodology. Over the years, I have been the principal investigator of several projects for machine learning, model development, model analyses, uncertainty quantification and decision support"
 },
 {
  "avatar": "https://pretalx.com/media/avatars/photo_2021-03-30_16-40-27_1RCfOfV.jpg",
  "name": "Marco Bonici",
  "submissions": [
   "8ATSN3"
  ],
  "code": "PPMTQ9",
  "biography": "I am a PhD Student at Università degli Studi di Genova. I am a memeber of the Euclid Consortium. Euclid is a space-based mission which will map the galaxy distribution in order to study the nature and origin of Dark Energy and Dark Matter. In the consortium, I am active in the developement of tools used to analyze data and perform cosmological analysis."
 },
 {
  "avatar": "https://pretalx.com/media/avatars/prof_pic_1_FButrfF.jpeg",
  "name": "Parker J. Rule",
  "submissions": [
   "AGCHEV"
  ],
  "code": "PRBVXZ",
  "biography": "I am a research associate and software engineer at Tufts University's MGGG Redistricting Lab, an interdisciplinary research group that applies mathematical techniques to the study of gerrymandering."
 },
 {
  "avatar": "https://pretalx.com/media/avatars/cvkuva_3KTnHmo.jpeg",
  "name": "Luca Ferranti",
  "submissions": [
   "WA7BP8"
  ],
  "code": "PTCVCM",
  "biography": "PhD student in computer science at the University of Vaasa. Research interests in compuational methods for efficient and reliable positioning."
 },
 {
  "avatar": "https://pretalx.com/media/avatars/kolia3_Qw3dQ5f.jpg",
  "name": "Kolia Sadeghi",
  "submissions": [
   "9LCKEQ"
  ],
  "code": "PYEFR8",
  "biography": "Senior Machine Learning Engineer at [Beacon Biosignals](https://beacon.bio/), working with julia since 1.0."
 },
 {
  "avatar": "https://pretalx.com/media/avatars/Foto_MLJC_sito_vGyoNyI.jpeg",
  "name": "Francesco Calisto",
  "submissions": [
   "X9RATL"
  ],
  "code": "PZLRAZ",
  "biography": "I am in the second year of the Bachelor Degree in Physics at the University of Turin. I am mainly interested in the theoretical and mathematical aspects of physics. I also conduct research in machine learning, with a particular interest towards the connection between machine learning and physics. Recently I have worked in the field of Scientific Machine Learning using Julia libraries, such as NeuralPDE.jl."
 },
 {
  "avatar": "https://pretalx.com/media/avatars/girih_EpTUrFO.jpg",
  "name": "Moritz Schauer",
  "submissions": [
   "LUVWJZ"
  ],
  "code": "PZQ7NJ",
  "biography": "I am Associate Senior Lecturer at the Department of Mathematical Sciences of Chalmers University of Technology and University of Gothenburg and working on statistical theory and methodology for dynamical stochastic models. In general, dynamical stochastic models describe the evolution of processes and systems which have dynamics with temporal or spatial interactions and show stochastic behaviour. Applications of such models are found in all areas, be it to model the change in the extension of the West Antarctic ice shelf, the interaction of neurons in the brain or the deformation of tissue during tumour growth. \r\n\r\n* Github: https://github.com/mschauer\r\n* Academic website: http://www.math.chalmers.se/~smoritz/index.htm\r\n* Twitter: [@MoritzSchauer](https://twitter.com/MoritzSchauer)"
 },
 {
  "avatar": "https://pretalx.com/media/avatars/me20-crop_GfRsA77.jpg",
  "name": "Maarten Pronk",
  "submissions": [
   "ADKMPS"
  ],
  "code": "Q33DZA",
  "biography": "GeoData Scientist at [Deltares](https://www.deltares.nl/en/). Github: [@evetion](https://github.com/evetion/)"
 },
 {
  "avatar": null,
  "name": "Lysandros Anastasopoulos",
  "submissions": [
   "FLLZNF"
  ],
  "code": "Q9SQD7",
  "biography": "After completing studies in mechanical engineering in Germany, worked for a coupled of years in the industry and academia. Now working in Switzerland in the aviation sector and developing code as a hobby."
 },
 {
  "avatar": "https://pretalx.com/media/avatars/avatar_KJ6Gryq.png",
  "name": "JinGuo Liu",
  "submissions": [
   "E9PXP9"
  ],
  "code": "QBUZQE",
  "biography": "https://giggleliu.github.io/about/"
 },
 {
  "avatar": null,
  "name": "Jorge Alberto Vieyra Salas",
  "submissions": [
   "TYJXFL"
  ],
  "code": "QCZCDE",
  "biography": "Born in Mexico City. Studied a Bachelors in Chemical Engineering at UNAM. M.Sc. on Materials Science and Engineering at MIT. Studied PhD at TU Eindhoven on Applied Physics.\r\nWorked for Philips Research 1 year.\r\nWorking at ASML for 7 years on algorithms."
 },
 {
  "avatar": null,
  "name": "Sam Urmy",
  "submissions": [
   "R7G87P"
  ],
  "code": "QJ98Z7",
  "biography": "Sam Urmy, PhD (@ElOceanografo), is a Research Fish Biologist at the US National Oceanic and Atmospheric Administration's Alaska Fisheries Science Center.  He has used Julia for simulating seabirds, detecting dolphin clicks, and, currently, analyzing sonar surveys of fish in Alaska."
 },
 {
  "avatar": null,
  "name": "Juan M Requena-Mullor",
  "submissions": [
   "STAZ9L"
  ],
  "code": "QQ7JQE",
  "biography": "I am a quantitative ecologist currently working as a postdoctoral research fellow at the University of Michigan. My research is focused on using quantitative methods and scientific programming to move forward in our understanding of how species, ecological, and ecosystem processes are affected by Global Change. I am particularly interested in encouraging the use of Julia language for ecological research and to this end, I am developing programming resources for ecologists. Some examples can be found at my GitHub repository (https://github.com/jmrmcode)."
 },
 {
  "avatar": "https://pretalx.com/media/avatars/8177701_jKilj4H.jpg",
  "name": "Oscar Dowson",
  "submissions": [
   "X7QCPU"
  ],
  "code": "QREN8R",
  "biography": "Oscar Dowson is a core-developer of JuMP and member of the JuMP steering committee."
 },
 {
  "avatar": "https://www.gravatar.com/avatar/41f2bb9bac0d0575d5bdd554196575ee",
  "name": "Satvik Souza Beri",
  "submissions": [
   "GXLNHG"
  ],
  "code": "QX7UTF",
  "biography": "Satvik is a co-founder and head of Machine Learning at Temple Capital, a crypto currency quant fund."
 },
 {
  "avatar": null,
  "name": "Ludovic Salomon",
  "submissions": [
   "UZJWTT"
  ],
  "code": "QXEXMD",
  "biography": null
 },
 {
  "avatar": "https://pretalx.com/media/avatars/iravanian_LBZuga4.jpg",
  "name": "Shahriar Iravanian",
  "submissions": [
   "EZHEQL"
  ],
  "code": "QZQELJ",
  "biography": "Shahriar Iravanian, MD, MSE, is a practicing cardiac electrophysiologist and biophysical researcher with an interest in non-linear dynamics and high-performance computing with a focus on the modeling of cardiac arrhythmias. He received a Master of Science in computer science from Johns Hopkins University and finished his cardiology and electrophysiology training at the Emory University in 2011."
 },
 {
  "avatar": "https://pretalx.com/media/avatars/stanford2_moreblurred_cut_github_E1Kahzs.jpg",
  "name": "Carsten Bauer",
  "submissions": [
   "C3EBJM"
  ],
  "code": "R3SWQF",
  "biography": null
 },
 {
  "avatar": "https://pretalx.com/media/avatars/3390820_FiKLmkI.jpg",
  "name": "Mark Schulze",
  "submissions": [
   "VDMLMY"
  ],
  "code": "R9LNUF",
  "biography": "Mark Schulze is a legal expert on corporate law & tax, but that only happened to happen after trying to settle in the information & electrical engineering field. After working as an audio engineer in the first place, he continued to work on web applications as a hobby and now approaches to learn backend orientated skills in Julia, that would help to go further in legal tech practises and knowledge engineering."
 },
 {
  "avatar": "https://pretalx.com/media/avatars/amit_h5fC2yc.png",
  "name": "Amit Shukla",
  "submissions": [
   "ACFGRM"
  ],
  "code": "R9ZVLC",
  "biography": "Hands-on Executive Consultant, ERP Implementation, AI Data Science, Machine Learning, Deep Learning, Business Intelligence, Flutter DART Angular Mobile apps."
 },
 {
  "avatar": "https://pretalx.com/media/avatars/schaefer_41ZPk7D.png",
  "name": "Frank Schäfer",
  "submissions": [
   "ZLXBVA"
  ],
  "code": "RFETFM",
  "biography": "PhD candidate in physics at the University of Basel.\r\nMember of the SciML open source software organization for scientific machine learning.\r\nGoogle Summer of Code 2020 student with the project: High weak order SDE solvers and their utility in neural SDEs. Google Summer of Code 2021 student with the project: Neural Hybrid Differential Equations and Adjoint Sensitivity Analysis.\r\n\r\nGithub & Slack: @frankschae"
 },
 {
  "avatar": null,
  "name": "Oriol Colomes",
  "submissions": [
   "HFHLDS"
  ],
  "code": "RHYTX3",
  "biography": null
 },
 {
  "avatar": null,
  "name": "Zac Nugent",
  "submissions": [
   "AUYF3X"
  ],
  "code": "RUJKSU",
  "biography": null
 },
 {
  "avatar": "https://pretalx.com/media/avatars/m_8HO5O7S.png",
  "name": "Marek Kaluba",
  "submissions": [
   "L8DTE3"
  ],
  "code": "RYTVJE",
  "biography": "I'm a mathematician, researcher in geometric group theory at KIT (Karlsruhe, Germany); I received my PhD in pure mathematics in 2014 and since then changed my scientific focus to aspects including more computational problems. I've been coding in julia since 2016, mostly around group theory, mathematical optimization and certified computation."
 },
 {
  "avatar": "https://pretalx.com/media/avatars/IMG-20190211-WA0020_Dt5Ya7S.jpg",
  "name": "Ashrya Agrawal",
  "submissions": [
   "KNDFHC"
  ],
  "code": "RYYMUN",
  "biography": "Senior year CS undergraduate at BITS Pilani - Pilani campus India. As a JSOC '20 student I worked on Fairness.jl . I am interested in fairness in machine learning, causality, counterfactual fairness and reinforcement learning. Lately, I have been exploring Quantum AI and causal RL. Happy to chat at ashryaagr@gmail.com or julia slack :-)\r\nTo know more about me, visit www.ashrya.in"
 },
 {
  "avatar": null,
  "name": "Megan Franke",
  "submissions": [
   "YKHNVR"
  ],
  "code": "SF3FVR",
  "biography": null
 },
 {
  "avatar": null,
  "name": "James D Foster",
  "submissions": [
   "TMXKDM"
  ],
  "code": "SHJAQB",
  "biography": null
 },
 {
  "avatar": null,
  "name": "Dave Kleinschmidt",
  "submissions": [
   "YJACBJ"
  ],
  "code": "SLNRF8",
  "biography": "Research scientist at [Beacon Biosignals](https://beacon.bio/)"
 },
 {
  "avatar": "https://www.gravatar.com/avatar/b1b9938790729d96af6f168d8ce0f917",
  "name": "Mosè Giordano",
  "submissions": [
   "HVSAW9",
   "ZSPVMT"
  ],
  "code": "ST7KZT",
  "biography": "Research Software Developer at UCL during the day, binary builder during the night."
 },
 {
  "avatar": null,
  "name": "Siddharth Bhatia",
  "submissions": [
   "DX7DCQ"
  ],
  "code": "SYTUPE",
  "biography": null
 },
 {
  "avatar": null,
  "name": "Sebastian Ament",
  "submissions": [
   "LXATFU"
  ],
  "code": "T3U8MQ",
  "biography": "PhD Candidate at Cornell University"
 },
 {
  "avatar": null,
  "name": "Michiel Stock",
  "submissions": [
   "QB8EC8"
  ],
  "code": "T3ZCAP",
  "biography": "I am a postdoctoral researcher at Ghent University. My interest is in using computational intelligence to understand and design biological systems."
 },
 {
  "avatar": null,
  "name": "Shuvomoy Das Gupta",
  "submissions": [
   "SWBYRL"
  ],
  "code": "T8F8UF",
  "biography": null
 },
 {
  "avatar": null,
  "name": "Shlok Goyal",
  "submissions": [
   "BEEHC8"
  ],
  "code": "T9LFAY",
  "biography": "Shlok is a Senior Research Analyst at the Federal Reserve Bank of New York working on the DSGE team in the Research group. He holds a B.S. in Economics and a B.S. in Statistics and Machine Learning from Carnegie Mellon University. He is interested in using Julia to develop scalable models for macroeconomic forecasting and spatial economics research."
 },
 {
  "avatar": null,
  "name": "Nikhil Mitra",
  "submissions": [
   "U9SZZU"
  ],
  "code": "T9LQRQ",
  "biography": "Senior Machine Learning Engineer at Second Spectrum."
 },
 {
  "avatar": null,
  "name": "Shivay Lamba",
  "submissions": [
   "KAJGA9"
  ],
  "code": "T9TYF8",
  "biography": "Shivay Lamba is a software developer specializing in DevOps, Machine Learning and Full Stack Development. \r\n\r\nHe is an Open Source Enthusiast and has been part of various programs like Google Code In and Google Summer of Code as a Mentor and is currently a MLH Fellow. He has also worked at organizations like Amazon, EY, Genpact. He is a Tensorflow.JS SIG member and community lead from India."
 },
 {
  "avatar": "https://pretalx.com/media/avatars/93312757_10222780446325975_8387414832315367424_n1_a2V6O6Y.jpg",
  "name": "Ayush Patnaik",
  "submissions": [
   "GFEPY7"
  ],
  "code": "TAXX8K",
  "biography": "Research consultant xKDR"
 },
 {
  "avatar": null,
  "name": "Kevin Squire",
  "submissions": [
   "KHK7PA",
   "U9SZZU"
  ],
  "code": "TDJYFM",
  "biography": "Kevin Squire is a Senior Software Engineer at Second Spectrum, Inc., where he works in the AI group on machine learning algorithms and infrastructure.  Previously, he completed a postdoc in Computational Genetics at UCLA and taught Computer Science at the Naval Postgraduate School.  He received his PhD in Electrical Engineering from the University of Illinois.  Kevin has been interested in Julia since its first public release and was an early contributor to the language."
 },
 {
  "avatar": "https://pretalx.com/media/avatars/IMG-6412_X2vsiRr.jpg",
  "name": "Ian Slagle",
  "submissions": [
   "NUFWBU"
  ],
  "code": "TEFWKB",
  "biography": "Ian Slagle is an junior undergraduate student studying Computer Science, Mathematics, and Physics at Coe College in Cedar Rapids, IA who utilizes Julia in his research. He currently plans to attend graduate school for Data Science."
 },
 {
  "avatar": null,
  "name": "Brian Guenter",
  "submissions": [
   "X3SAWW"
  ],
  "code": "TGSYQC",
  "biography": "Brian Guenter is a Senior Principal Researcher at Microsoft Research, where he manages the Interactive Media Group."
 },
 {
  "avatar": null,
  "name": "David P. Sanders",
  "submissions": [
   "RXF8UK",
   "ZYPPNH",
   "GNB93V",
   "DWEMBV",
   "DRMPLU",
   "BR7WG8",
   "BRG8Z3"
  ],
  "code": "TJJRTG",
  "biography": "Professor of Computational Science at the Universidad Nacional Autónoma de México and visiting professor at MIT.\r\n\r\nInterested in computational science, interval arithmetic, and numeric-symbolic computing.\r\n\r\nAuthor of the JuliaIntervals suite of packages for interval arithmetic, and various tutorials on Julia."
 },
 {
  "avatar": null,
  "name": "Francesc Verdugo",
  "submissions": [
   "HFHLDS"
  ],
  "code": "TJKSVY",
  "biography": "Francesc Verdugo PhD is assistant research professor at CIMNE (Barcelona, Spain) and he is interested in the research of new discretization methods to solve partial differential equations (PDEs). He is co-founder of the Gridap.jl project to solve PDEs in Julia."
 },
 {
  "avatar": null,
  "name": "Ivet Galabova",
  "submissions": [
   "FHWUR9"
  ],
  "code": "TMSADH",
  "biography": null
 },
 {
  "avatar": "https://pretalx.com/media/avatars/IMG_20191106_163708-square_h5dIHFY.png",
  "name": "Dan Padilha",
  "submissions": [
   "SB7HWT"
  ],
  "code": "TPQNLW",
  "biography": "Dan Padilha is a Masters (Aerospace Engineering) student at The University of Tokyo and JAXA Institute of Space & Astronautical Science (ISAS). He has a background in computer science and 6 years of professional experience as a software systems and research engineer in quantum computing (at Rigetti in London), machine learning (at QxBranch in Adelaide), and embedded systems (at NICTA in Sydney). He has been involved in two successful start-up companies, presented at high-performance computing and emerging technologies conferences, run software workshops at over a dozen multinational corporations and universities, and led technical engagements designing novel algorithms and analytics platforms. He is currently a member of the Tsuda Laboratory at ISAS, working on software tools for astrodynamics research."
 },
 {
  "avatar": null,
  "name": "Owen Lynch",
  "submissions": [
   "NWRPGY"
  ],
  "code": "TY8PJL",
  "biography": "I am a master's student at Utrecht University, and a contributor for Catlab.jl"
 },
 {
  "avatar": null,
  "name": "Martin Otter",
  "submissions": [
   "YGWUVE"
  ],
  "code": "TYBGHT",
  "biography": null
 },
 {
  "avatar": null,
  "name": "Peter Zhiping Zhang",
  "submissions": [
   "WHD7HK"
  ],
  "code": "TZ33RB",
  "biography": "Ph.D. in Chemical & Biomolecular Engineering at Cornell University"
 },
 {
  "avatar": "https://pretalx.com/media/avatars/felix_wechsler_2020_fxlb1HS.JPG",
  "name": "Felix Wechsler",
  "submissions": [
   "8UR3U3",
   "J8CRXY",
   "XWXEH3"
  ],
  "code": "U3YH9P",
  "biography": "[Felix Wechsler](https://felixwechsler.science) studied Physics and Informatics at the Technical University of Munich in Germany. For his master studies in Photonics he moved to Jena (city of light). Currently he finishes his master thesis in the field of computational microscopy at the [Biomedical Imaging Group of Leibniz Institute of Photonic Technology](https://nanoimaging.de/) under the joint supervision of Rainer Heintzmann and Ivo Ihrke."
 },
 {
  "avatar": null,
  "name": "Rory Finnegan",
  "submissions": [
   "A93QFU"
  ],
  "code": "UAYRQP",
  "biography": null
 },
 {
  "avatar": null,
  "name": "Glenn Moynihan",
  "submissions": [
   "GFHKV7"
  ],
  "code": "UBLH3G",
  "biography": "I'm a Research Software Engineer at InveniaLabs, UK.\r\nInterested in the application of Julia for scalable, sustainable, research."
 },
 {
  "avatar": "https://pretalx.com/media/avatars/calbert_MAyEnGk.jpeg",
  "name": "Julien Calbert",
  "submissions": [
   "DRMPLU"
  ],
  "code": "UBWNWX",
  "biography": "Ph.D. candidate at the Institute of Information and Communication Technologies, Electronics and Applied Mathematics (ICTEAM) of Université Catholique de Louvain (UCL), Louvain-la-Neuve, Belgium."
 },
 {
  "avatar": null,
  "name": "Alan Edelman",
  "submissions": [
   "RXF8UK"
  ],
  "code": "UCVDU3",
  "biography": null
 },
 {
  "avatar": "https://pretalx.com/media/avatars/PhotoBas_Hg1s3Vf.jpg",
  "name": "Bas Peters",
  "submissions": [
   "EVR3HZ"
  ],
  "code": "UHXALN",
  "biography": "Bas Peters is visiting assistant professor in the mathematics department at Emory University. Previously, Bas worked for Computational Geosciences Inc as a research scientist, and received his PhD degree from the University of British Columbia in 2019. His main research interests are constrained optimization; design, optimization, and regularization of deep neural networks, geoscientific and geospatial applications, inverse problems, reinforcement learning, image processing, and numerical linear algebra."
 },
 {
  "avatar": "https://pretalx.com/media/avatars/Headshot_4VYG0cP.JPG",
  "name": "Logan Kilpatrick",
  "submissions": [
   "VM7PSF",
   "AEP3PA"
  ],
  "code": "UNR7XZ",
  "biography": "Logan is the Community Manager for the Julia Language. Get in contact with him here: https://twitter.com/OfficialLoganK"
 },
 {
  "avatar": "https://pretalx.com/media/avatars/rusty-river-full_IMpJQkp.png",
  "name": "Rusty Conover",
  "submissions": [
   "F3TMMU"
  ],
  "code": "UNSA8X",
  "biography": "Rusty is an experienced and innovative software executive with a track record of building businesses, platforms, and applications. He has expert-level knowledge of distributed systems, databases, networks, and operating systems.  He enjoys problem-solving on his own but also enjoys growing teams that make a difference for customers and the wider world."
 },
 {
  "avatar": "https://pretalx.com/media/avatars/tapo_eBGLKrs.png",
  "name": "Thomas A. Poulsen",
  "submissions": [
   "7VNJWV"
  ],
  "code": "UPFEMA",
  "biography": "MS in mathematics, Phd in mechanical engineering. Has worked in biotechnology for 20 years. Programmed in FORTRAN 3 years, Perl 5 years and R 15 years. Has been dipping toes in Julia for 2 years."
 },
 {
  "avatar": "https://pretalx.com/media/avatars/me_DUrAfiN.jpg",
  "name": "Jack Chan",
  "submissions": [
   "BRTTKB"
  ],
  "code": "UQWF7L",
  "biography": "I am a software developer from Deloitte Digital Australia, currently working with a talented team of individuals on Deloitte's Optimal Reality offering (https://optimalreality.com/),  a cloud based platform for delivering digital twin capability based on simulation techniques pioneered in Formula One racing."
 },
 {
  "avatar": "https://pretalx.com/media/avatars/20180813_141024_cropped_2BWNFJe.jpg",
  "name": "Mark Kittisopikul, Ph.D.",
  "submissions": [
   "FRTBV8"
  ],
  "code": "USMVVE",
  "biography": "Mark Kittisopikul is a postdoctoral Scientific Computing Associate at the Janelia Research Campus of the Howard Hughes Medical Institute working with the Scientific Computing team to support the computational needs of the lab of Philipp Keller for next-generation light-sheet microscopy."
 },
 {
  "avatar": null,
  "name": "Peter Bräuer",
  "submissions": [
   "WDAW7R"
  ],
  "code": "UTNWKL",
  "biography": "Scientific programmer at University of Leipzig."
 },
 {
  "avatar": null,
  "name": "Mathias Louboutin",
  "submissions": [
   "EVR3HZ"
  ],
  "code": "UUDHSP",
  "biography": null
 },
 {
  "avatar": "https://pretalx.com/media/avatars/IMG_0628-2_KSwS1fR.jpeg",
  "name": "Manuela Vanegas Ferro",
  "submissions": [
   "LHQEPZ"
  ],
  "code": "UVC9SM",
  "biography": "Manuela Vanegas Ferro is a PhD candidate in Biological Design at Arizona State University. She earned a Bachelor of Science degree in Biology and Microbiology and a Master of Science degree in Computational Biology from Universidad de los Andes in Colombia. Manuela has experience in modeling complex biological systems at different scales. Currently, she is developing an individual-based model that integrates biological features of coffee rust disease and socio-economic aspects of coffee farmers' management practices to find optimal long-term farming strategies."
 },
 {
  "avatar": null,
  "name": "Miles Lubin",
  "submissions": [
   "ANYQTY"
  ],
  "code": "UYK3EM",
  "biography": null
 },
 {
  "avatar": null,
  "name": "Guilherme Gomes Haetinger",
  "submissions": [
   "UZXFSE"
  ],
  "code": "V8B8TS",
  "biography": "I am a Computer Science student at the *Universidade Federal do Rio Grande do Sul*. My interests hop around the fields of Operating Systems, Algorithm Design, Computer Graphics and Image Processing. Currently, I am working as a Back End Development intern at DeepX , using Elixir and Rust. I've been using Julia for a couple of years in order to get fast image processing results with easy-on-the-eyes code."
 },
 {
  "avatar": "https://pretalx.com/media/avatars/avatar_marcelo_KTnSE8R.png",
  "name": "Marcelo Forets",
  "submissions": [
   "DRMPLU",
   "9KGMHJ"
  ],
  "code": "V93HYB",
  "biography": "[Marcelo Forets](https://github.com/mforets) is an Applied Mathematician that works as Assistant Professor at Universidad de la República (Uruguay). Born in Uruguay (Montevideo, 1988), he graduated in Physics and in Electrical Engineering, then moved to France for a PhD in Mathematics and Informatics (Univ. Joseph Fourier,  France) on the quantum random walk, a model of particular interest to Quantum Computing. He was a post-doc researcher at VERIMAG laboratory of Université Grenoble Alpes (France) under the supervision of Oded Maler and Goran Frehse, where he started to develop what is now the [JuliaReach](http://juliareach.com) package ecosystem. His research has to do with developing innovative numerical tools that impact decisions regarding reliability, correctness and safety of control systems, hybrid dynamical systems, and robustness analysis of neural networks."
 },
 {
  "avatar": null,
  "name": "Albert Gnadt",
  "submissions": [
   "NYNJMJ"
  ],
  "code": "VAWVFX",
  "biography": "PhD candidate at MIT AeroAstro"
 },
 {
  "avatar": "https://www.gravatar.com/avatar/c0d60e9cebf22b77e94c2d2eb4386539",
  "name": "Joris Kraak",
  "submissions": [
   "CY88QP"
  ],
  "code": "VCBWCT",
  "biography": "I'm a senior software engineer with GN Advanced Science and have been working with Julia since 2014. My Julia work is focused on platform development for rapid prototyping of audio signal processing algorithm personalization and cloud-based deployment. I'm passionate about making software development accessible from a technical perspective through abstraction and automation."
 },
 {
  "avatar": "https://pretalx.com/media/avatars/tim_JVRN224.jpg",
  "name": "Tim DuBois",
  "submissions": [
   "E8SVYT"
  ],
  "code": "VFYSEH",
  "biography": "Head of Scientific Computing at Cervest, working on Climate Intelligence solutions which quantify climate risk on a per-asset level, globally.\r\n\r\nPhD in Physics from RMIT University in Melbourne, Australia; focusing on defects in the Josephson junctions of superconducting phase-qubits. Followed up by a postdoctoral position at Chalmers University in Gothenburg, Sweden investigating high energy laser-plasma interactions and fusion energy. More recently a researcher at the Stockholm Resilience Centre, with research areas concerning Planetary Boundaries, global climate-economy models, social ecological systems and other Earth system sciences."
 },
 {
  "avatar": "https://pretalx.com/media/avatars/profile_picture_I3yIf63.png",
  "name": "Germán Abrevaya",
  "submissions": [
   "QEANKW"
  ],
  "code": "VLASWP",
  "biography": "PhD student in Physics at University of Buenos Aires."
 },
 {
  "avatar": null,
  "name": "Maxime Bouton",
  "submissions": [
   "7GYDRZ"
  ],
  "code": "VQFKCJ",
  "biography": "I am an AI Researcher at Ericsson Research. My research interests lie in reinforcement learning, planning under uncertainty, and AI safety. Prior to joining Ericsson I completed my PhD at Stanford University under the supervision of Prof. Mykel Kochenderfer. My thesis was about safe and scalable planning under uncertainty for autonomous driving and all the code was written in Julia. At Juliacon 2021 I will present work I did during my thesis."
 },
 {
  "avatar": null,
  "name": "Manuel Berkemeier",
  "submissions": [
   "Z8AJ9J"
  ],
  "code": "W7Q33Z",
  "biography": "PhD student at Paderborn University. My main research interest lies in multiobjective (non-linear) optimization."
 },
 {
  "avatar": "https://pretalx.com/media/avatars/Chris-Hill_aVVbozz.jpg",
  "name": "Chris Hill",
  "submissions": [
   "DZC7HN"
  ],
  "code": "W7TEDS",
  "biography": "Chris Hill is a principal researcher at MIT. He is a lead architect of the widely used MIT General Circulation Model (MITgcm). He has been working with the Julia community for almost a decade."
 },
 {
  "avatar": null,
  "name": "François Pacaud",
  "submissions": [
   "P8KJSW"
  ],
  "code": "WC3WU3",
  "biography": "François Pacaud is a postdoctoral appointee at Argonne National Lab, supervised by Mihai Anitescu. His work focuses on the development of new nonlinear optimization algorithms on GPU architectures."
 },
 {
  "avatar": null,
  "name": "Ilia Ilmer",
  "submissions": [
   "QCR9JA"
  ],
  "code": "WGLCHQ",
  "biography": null
 },
 {
  "avatar": null,
  "name": "Jacob Zelko",
  "submissions": [
   "DMTYDS",
   "N7REEK"
  ],
  "code": "WNALCB",
  "biography": "My Name Is Jacob S. Zelko – Pleasure To Meet You!\r\n\r\nI am a graduate of Georgia Institute of Technology with a BS in biomedical engineering. While pursuing my BS, I worked as a data information specialist and biomedical informaticist in the Department of Biomedical Informatics at Emory University doing research in the areas of computational psychiatry and worked with The Center for Discovery as an engineering consultant to aid in caring for their juvenile neurocognitively diverse population. Currently, I work as a Health Data Analytics and Informatics Researcher at Georgia Tech Research Institute and as a Consultant with the Centers for Disease Control."
 },
 {
  "avatar": null,
  "name": "James Fairbanks",
  "submissions": [
   "ARURL8"
  ],
  "code": "WPZLWJ",
  "biography": null
 },
 {
  "avatar": "https://pretalx.com/media/avatars/mary_main_tFYbsOV.jpg",
  "name": "Mary McGrath",
  "submissions": [
   "3PCHLJ"
  ],
  "code": "WQEVD7",
  "biography": "Mary is a Senior Research Software Engineer at Brown University’s Center for Computation and Visualization, and a consulting Senior Software Engineer at RelationalAI. She works with researchers to provide scientific and technical computing expertise, combined with best practices, to advance computational research. She received her B.S. in Engineering Science from Smith College and her M.S. in Computer Science from Brown University."
 },
 {
  "avatar": "https://www.gravatar.com/avatar/0649583d75adfd14d9473c89f356e173",
  "name": "Chris Rackauckas",
  "submissions": [
   "NNVXZC",
   "ETY3B7"
  ],
  "code": "WUWQQ3",
  "biography": "Chris Rackauckas is an Applied Mathematics Instructor at MIT and the Director of Scientific Research at Pumas-AI. He is the lead developer of the SciML open source scientific machine learning organization which develops widely used software for scientific modeling and inference. One such software is DifferentialEquations.jl for which its innovative solvers won an IEEE Outstanding Paper Award and the inaugural Julia Community Prize. Chris' work on high performance differential equation solving is seen in many applications from the MIT-CalTech CLiMA climate modeling initiative to the SIAM DSWeb award winning DynamicalSystems.jl toolbox. Chris is also the creator of Pumas, the foundational software of Pumas-AI for nonlinear mixed effects modeling in clinical pharmacology. These efforts on Pumas led to the International Society of Pharmacology's (ISoP) Mathematical and Computational Special Interest Group Award at the American Conference of Pharmacology (ACoP) 2019 for his work on improved clinical dosing via Koopman Expectations, along with the ACoP 2020 Quality Award for his work on GPU-accelerated nonlinear mixed effects modeling via generation of SPMD programs. For this work in pharmacology, Chris received the Emerging Scientist award from ISoP in 2020, the highest early career award in pharmacometrics."
 },
 {
  "avatar": "https://pretalx.com/media/avatars/C56C90EF-D08B-4CA6-874E-9B2FF093F78F_uLCy72Z.jpeg",
  "name": "Charlie Hewitt",
  "submissions": [
   "X3SAWW"
  ],
  "code": "WVBJJK",
  "biography": "Research scientist at Microsoft mixed reality and AI labs. Interested in computer graphics and vision."
 },
 {
  "avatar": null,
  "name": "Youngdae Kim",
  "submissions": [
   "LMLJS8"
  ],
  "code": "WVYDVW",
  "biography": "* B.S. in Mathematics and Computer Science, Pohang University of Science and Technology, 2007\r\n* M.S. in Computer Science, Pohang University of Science and Technology, 2009\r\n* Ph.D. in Computer Science, University of Wisconsin-Madison, 2017\r\n* Postdoctoral Appointee, Argonne National Laboratory, 2018-Current"
 },
 {
  "avatar": "https://pretalx.com/media/avatars/silmore_square_AX4yyOb.png",
  "name": "Kevin Silmore",
  "submissions": [
   "9PXXFE"
  ],
  "code": "WYGWZR",
  "biography": "I'm a PhD candidate in Chemical Engineering and Computation and DOE Computational Science Graduate Fellow at MIT."
 },
 {
  "avatar": "https://pretalx.com/media/avatars/ranocha_2019_10b__520_quadratic_s4EhQU2.jpg",
  "name": "Hendrik Ranocha",
  "submissions": [
   "VAGFD7"
  ],
  "code": "WYXDAB",
  "biography": "I am a Postdoctoral Fellow in the Cluster of Excellence at the University of Münster, Germany. My research is focused on the analysis and development of numerical methods for partial and ordinary differential equations. In particular, I am interested in the stability of these schemes as well as mimetic and structure-preserving techniques, allowing the transfer of results from the continuous level to the discrete one."
 },
 {
  "avatar": "https://pretalx.com/media/avatars/Crop2AV_yup8Y1H.JPG",
  "name": "Bishmer Sekaran",
  "submissions": [
   "ZHJ9SD"
  ],
  "code": "X3PWGN",
  "biography": "Bishmer Sekaran is an Artificial Intelligence researcher based in Singapore. He first discovered Julia in 2020 and has been a vocal proponent ever since."
 },
 {
  "avatar": null,
  "name": "Joey Huchette",
  "submissions": [
   "REKLVV"
  ],
  "code": "X3VPLE",
  "biography": null
 },
 {
  "avatar": "https://pretalx.com/media/avatars/sam_wNh892K.jpg",
  "name": "Samuel Ozminkowski",
  "submissions": [
   "CMYWPV"
  ],
  "code": "X8DQ9H",
  "biography": "Samuel Ozminkowski is a M.S. student in Statistics at the University of Wisconsin-Madison, in the Solis-Lemus lab. His work is focused on using Bayesian models with network predictors, specifically focusing on microbiome networks. He earned his undergraduate degree in Computer Science at the University of Michigan."
 },
 {
  "avatar": "https://pretalx.com/media/avatars/Misha_portret_8x10_square_scaled_riz19vM.jpg",
  "name": "Mikhail Mikhasenko",
  "submissions": [
   "TRMZFB"
  ],
  "code": "XBMXGQ",
  "biography": "I am a physicist studying exotic matter formation via resonance phenomena of the QCD.\r\n\r\nField: elementary particles, hadron spectroscopy\r\n\r\nOrganizations: CERN (LHCb, COMPASS), JPAC, ORIGINS Cluster"
 },
 {
  "avatar": null,
  "name": "Winston Wu",
  "submissions": [
   "XR9MLU"
  ],
  "code": "XDXAHF",
  "biography": "PhD student at Johns Hopkins University, studying computational linguistics."
 },
 {
  "avatar": "https://pretalx.com/media/avatars/icon_copy_L8vM3zD.jpg",
  "name": "Akio Tomiya",
  "submissions": [
   "DTJYAC"
  ],
  "code": "XHFFLZ",
  "biography": "I got PhD in 2015 about physics, particle physics, in Osaka university in Japan. From June 2021, I am a faculty member of International Professional University of Technology in Osaka in Japan. September 2018 - May 2021, a postdoc in Riken Brookhaven research center in the USA. October 2015 - August 2018, a postdoc in central china normal university in China. I am interested in application of machine learning on lattice QCD and physics. I published a book \"Deep Learning and Physics\" from springer."
 },
 {
  "avatar": "https://pretalx.com/media/avatars/IMG_4113_TkDEXd2.jpg",
  "name": "Claiton Nardini",
  "submissions": [
   "MFAQKW"
  ],
  "code": "XKFD7A",
  "biography": "Forest Engineer, from the Federal University of Santa Maria (UFSM) Frederico Westphalen Campus. Currently a Master's student in the Graduate Program in Agronomy: Agriculture and Environment at UFSM - FW. He develops works in the areas of Forest Engineering, Agrometeorology, Vegetable Production, Forest Biomass, Agroforestry Systems and Julia Language applied in the Forest Inventory."
 },
 {
  "avatar": "https://pretalx.com/media/avatars/personal_atco_cropped_face_jD3SRX6.png",
  "name": "Ilya Orson Sandoval",
  "submissions": [
   "TJ3J79"
  ],
  "code": "XMHEGM",
  "biography": "I am a PhD student in Imperial College working at the intersection of reinforcement learning, optimal control and process systems engineering. Previously, I worked in data science and software engineering within the energy and food industries in Mexico. I have a background in physics."
 },
 {
  "avatar": "https://pretalx.com/media/avatars/DSC08662_copy2_XTGtCg6.jpg",
  "name": "Matthew S Johnson",
  "submissions": [
   "ME7JE9"
  ],
  "code": "XPJDU7",
  "biography": "MIT Chemical Engineering Ph.D. Student"
 },
 {
  "avatar": null,
  "name": "Jürgen Fuhrmann",
  "submissions": [
   "ZZTJ3U"
  ],
  "code": "XR3TFU",
  "biography": "Born 1961 in Erfurt, Germany. Diploma in mathematics from Moscow State University in 1984,  Ph.D from Technical University Chemnitz-Zwickau in 1995.  Joined the Karl-Weierstraß-Institute Institute of Mathematics of the Academy of Sciences of the GDR in 1984.\r\nSince  1992 with Weierstrass Institute for Applied Analysis and Stochastics (WIAS). Currently, deputy head of the Numerical Analysis group of WIAS. Main field of activity is algorithm and software development for nonlinear systems of partial differential equations. Interdisciplinary research activities include numerical modeling of various phenomena in fuel cells, batteries, semiconductors, subsurface flow processes."
 },
 {
  "avatar": null,
  "name": "Andy Ferris",
  "submissions": [
   "WRNAEN"
  ],
  "code": "XWRVMT",
  "biography": "I first used Julia to perform research during postdocs in quantum simulation, before using it in industry with a team working on various geospatial applications. Nowadays we use Julia at [ELARA AI](https://www.elaraai.com) to simulate, analyze and optimize real-world businesses. I have contributed packages including *StaticArrays*, *CoordinateTransformations*, *Rotations*, *TypedTables*, *SplitApplyCombine*, *AcceleratedArrays* and *Dictionaries*."
 },
 {
  "avatar": null,
  "name": "Mia Kramer",
  "submissions": [
   "P7KQMT"
  ],
  "code": "Y37GJU",
  "biography": "Mia is a graduate student at the University of British Columbia, working with Michael Friedlander. She's been interested in computers and programming since being in elementary school, and after finishing her undergraduate in astrophysics at UBC she is very excited to continue learning in (and hopefully contributing to!) the field."
 },
 {
  "avatar": null,
  "name": "LI TANG",
  "submissions": [
   "GJRKY3"
  ],
  "code": "Y8SZVN",
  "biography": "Dr Tang is a research scientist in the CCS-7 Programming Models team at Los Alamos National Laboratory. His research interests include programming model, co-design, performance/energy analysis and modeling. Dr Tang received his Ph.D. from the Department of Computer Science and Engineering at University of Notre Dame in 2017."
 },
 {
  "avatar": null,
  "name": "George Stavrinos",
  "submissions": [
   "MVZKVK"
  ],
  "code": "YDL7VL",
  "biography": "www.github.com/gstavrinos"
 },
 {
  "avatar": null,
  "name": "Cong Van",
  "submissions": [
   "BJZVLV"
  ],
  "code": "YECHQU",
  "biography": "Dr. Cong Van is a mathematician, currently a Postdoc fellow at FedEx Institute of Technology, working on Structured Illumination Microscopy (SIM), one type of super-resolution fluorescence microscopes. Dr. Cong Van used Julia during his PhD and during his previous position at Mitsubishi Electric Research Labs (MERL) for thermodynamic property models."
 },
 {
  "avatar": "https://pretalx.com/media/avatars/26233299_1989868764374810_9003691900656884808_o_1_Jhptxwf.jpg",
  "name": "José Pereira",
  "submissions": [
   "XU9DTB"
  ],
  "code": "YK78JV",
  "biography": "I am a PhD Student in Universidade de Aveiro, Portugal, currently pursuing Biochemistry with a twist. Over the past 5 years I've directed my research efforts towards Computational Chemistry, more specifically, for the development of scientific software. I started learning Julia 3 or 4 years ago, and have since grown more and more in love with its syntax and ecosystem. Currently, my main PhD project is the development of ProtoSyn, a simple and intuitive package for the molecular manipulation and simulation of peptides."
 },
 {
  "avatar": null,
  "name": "Laura",
  "submissions": [
   "RAFSMK"
  ],
  "code": "YK9PFQ",
  "biography": "Mathematics undergraduate student and Economics graduate. I love playing computational statistics using Julia."
 },
 {
  "avatar": "https://www.gravatar.com/avatar/1311bb150d2c7a24d22ded286b2e7d51",
  "name": "Gillot",
  "submissions": [
   "V3FWTU"
  ],
  "code": "YMLF99",
  "biography": "Frédéric Gillot is Assistant Professor at École Centrale de Lyon within the Department of Solid Mechanics, Mechanical Engineering and Civil Engineering. He carries out his research at the Tribology and System Dynamics Laboratory (LTDS), a French CNRS joint research unit (no. 5513). He graduated in Engineering from École nationale supérieure des arts et métiers (ENSAM) and the University of Wien, Austria. An alumnus of École normale supérieure, he holds an agrégation in Mechanical Engineering, a research master and a PhD from École Centrale de Nantes and the University of Nantes. He pursued post-doctoral research for two years at the University of Tokyo (Todai) with funding from the Japan Society for the Promotion of Science. His current research interests address parametric shape optimisation, multi-objective optimisation and robust optimisation."
 },
 {
  "avatar": "https://pretalx.com/media/avatars/icon_HyrctTY.png",
  "name": "Seth Chapman",
  "submissions": [
   "TCBRVL"
  ],
  "code": "YMTEYP",
  "biography": "they/them\r\n\r\nSeth is a frontend web developer for [Beacon Biosignals](beacon.bio) and part-time [Exercism](exercism.io) mentor for the Julia language. They've been developing in Julia since November 2019 and are a contributor to [StaticArrays.jl](https://github.com/JuliaArrays/StaticArrays.jl). Their specialty is [esoteric languages](https://github.com/OTDE/GalaxyBrain.jl)."
 },
 {
  "avatar": null,
  "name": "Joshua Pulsipher",
  "submissions": [
   "YVCM8B"
  ],
  "code": "YNHAFQ",
  "biography": null
 },
 {
  "avatar": "https://pretalx.com/media/avatars/feedback_-_Copy_2_IFtYUOp.jpg",
  "name": "Anand Jain",
  "submissions": [
   "EZHEQL"
  ],
  "code": "YQY9SF",
  "biography": "I am interested in the intersection of mathematics and physiology. I am a computer science student at the University of Chicago on a gap year. I am working at Julia Computing on building surrogates of systems biological models for JuliaSim."
 },
 {
  "avatar": "https://pretalx.com/media/avatars/apple-red_tXu5r66.jpg",
  "name": "Chris Peel",
  "submissions": [
   "7XFSZB"
  ],
  "code": "YXRYYS",
  "biography": "Chris ran the [Bay Area Julia Users](https://www.meetup.com/Bay-Area-Julia-Users/) group from 2016 to 2020."
 },
 {
  "avatar": null,
  "name": "Katharine Hyatt",
  "submissions": [
   "V3N73B"
  ],
  "code": "YYDPCZ",
  "biography": "I am a longtime Julia contributor with a special interest in GPU programming and HPC. I currently work at Amazon Braket as a scientist."
 },
 {
  "avatar": null,
  "name": "Kusti Skytén",
  "submissions": [
   "J7BFBM",
   "EWWNFZ",
   "Y3DRKK"
  ],
  "code": "Z7JSAN",
  "biography": "A Biostatistics PhD student from the University of Oslo. I'm working on combining computer simulations with Bayesian statistical models. I have been a big fan of Julia since version 0.4. My research interests are Bayesian statistics, symbolic computing and applied category theory."
 },
 {
  "avatar": null,
  "name": "Malcolm Miller",
  "submissions": [
   "SHHKEM"
  ],
  "code": "ZA9RUN",
  "biography": "Malcolm is a simulation engineer at Deloitte Digital Australia with a background in real-time simulation in the automotive and transport domains. Currently he is developing real-time simulations of large transport networks as part of the [Optimal Reality](https://optimalreality.com) team, and enjoying [contributing](https://github.com/mmiller-max) to Julia."
 },
 {
  "avatar": null,
  "name": "Radhika Ivaturi",
  "submissions": [
   "CMPNPF"
  ],
  "code": "ZAHQEL",
  "biography": "Age: \r\n10 Years\r\n\r\nEducation: \r\n6th Grade, Sree VidyaNikethan International School, Hyderabad, India"
 },
 {
  "avatar": "https://www.gravatar.com/avatar/f1243c6af6112630ad368516ae9c94c1",
  "name": "Michael Schlottke-Lakemper",
  "submissions": [
   "VAGFD7",
   "C3EBJM"
  ],
  "code": "ZBB3MC",
  "biography": "I am a postdoctoral fellow and research software engineer at the [Numerical Simulation Research Group](https://www.mi.uni-koeln.de/NumSim) of the University of Cologne, Germany. My research focus is on numerical methods for adaptive multi-physics simulations, high-order schemes, and high-performance computing."
 },
 {
  "avatar": "https://pretalx.com/media/avatars/mug_Vl6jeo0.png",
  "name": "Grisha Szep",
  "submissions": [
   "QTLENJ"
  ],
  "code": "ZBMJRN",
  "biography": "Russian/Hungarian biophysics and machine learning PhD student at King's College London, collaborating with Microsoft Research Cambridge. Born in Vienna. Wanted to become an actor but luckily landed in research"
 },
 {
  "avatar": null,
  "name": "Chris Coey",
  "submissions": [
   "7KECGM"
  ],
  "code": "ZBXW73",
  "biography": null
 },
 {
  "avatar": null,
  "name": "Simon Schoelly",
  "submissions": [
   "39QSBR",
   "8HRTW8",
   "BX9YY3"
  ],
  "code": "ZCWVXE",
  "biography": "Simon is a Software Engineer from Switzerland. Most of Julia contributions are related the the JuliaGraphs ecosystem."
 },
 {
  "avatar": null,
  "name": "Khalil CHRIT",
  "submissions": [
   "BSTFEQ"
  ],
  "code": "ZDLC3M",
  "biography": "PhD student in the University of Évora"
 },
 {
  "avatar": null,
  "name": "Marta",
  "submissions": [
   "UDTRW3"
  ],
  "code": "ZGSAME",
  "biography": "Ph.D. student in Electrical Engineering @KU Leuven and @Energyville, Belgium."
 },
 {
  "avatar": "https://www.gravatar.com/avatar/65e4f94724adca1422de4eb944d644e7",
  "name": "Ellis Brown",
  "submissions": [
   "FGUEAM"
  ],
  "code": "ZH8QUF",
  "biography": "Engineer at BlackRock AI Labs"
 },
 {
  "avatar": null,
  "name": "Max Kapur",
  "submissions": [
   "ALS3ZQ"
  ],
  "code": "ZJHGRZ",
  "biography": "I am a graduate student  in the department of industrial engineering at Seoul National University in South Korea.\r\n- Github: [https://github.com/maxkapur](github.com/maxkapur)\r\n- Email: maxkapur@gmail.com\r\n- Blog: [maxkapur.com](maxkapur.com)"
 },
 {
  "avatar": "https://pretalx.com/media/avatars/Hilding_HWkOyAR.jpg",
  "name": "Hilding Elmqvist",
  "submissions": [
   "YGWUVE"
  ],
  "code": "ZPRJKM",
  "biography": "PhD from Department of Automatic Control, Lund Institute of Technology in 1978 about a new modeling language. Started Dynasim 1992, sold to Dassault Systèmes in 2006. Chief architect for modeling software Dymola. Initiated design of Modelica modeling language in 1996.\r\n\r\nPrevious experience include: Mogram AB (CEO), Dassault Systèmes (CTO Systems), Dynasim AB (CEO).\r\n\r\nWorking with Julia since 2015 and with Modia since 2016."
 },
 {
  "avatar": "https://pretalx.com/media/avatars/Lissajous2-2_8R4JOm0.png",
  "name": "Ander Gray",
  "submissions": [
   "DRMPLU"
  ],
  "code": "ZQLCJF",
  "biography": "Ander Gray received  an MSci in Physics from Queen’s University Belfast (2017). Since then, he has been a PhD student at the University of Liverpool and  Culham  Centre for Fusion Energy, studying Uncertainty Quantification. For his thesis work, Ander  researches  methods for efficiently propagating uncertainty in radiation transport simulations. He is also involved in developing methods and software for calibrating and propagating uncertainties through computational models, in the form of imprecise probabilities."
 },
 {
  "avatar": null,
  "name": "Andrés Riedemann",
  "submissions": [
   "7PVG8Z"
  ],
  "code": "ZQMLJ9",
  "biography": "Chemical engineering"
 },
 {
  "avatar": "https://pretalx.com/media/avatars/image_6483441_5257qOG.JPG",
  "name": "Joe Carpinelli",
  "submissions": [
   "BPJ3N7"
  ],
  "code": "ZR87UR",
  "biography": "I'm an aerospace engineering MS student who will be graduating in May 2021. My academic research has primarily been space robotics software development. I've worked on an open source Julia package, `UnitfulAstrodynamics.jl`, throughout my graduate astrodynamics courses. I'll be working as an aerospace controls engineer on the Orion project starting in July 2021."
 },
 {
  "avatar": null,
  "name": "Ludovic Räss",
  "submissions": [
   "CPH7SG"
  ],
  "code": "ZTATFJ",
  "biography": "[Geo-HPC, GPUs, supercomputing & Julia](https://github.com/luraess) @ [VAW ETHZ](https://vaw.ethz.ch/forschung/glaziologie.html)."
 },
 {
  "avatar": null,
  "name": "Tom Kwong",
  "submissions": [
   "JC8S3R"
  ],
  "code": "ZVXXQA",
  "biography": "Tom Kwong is an experienced software engineer with over 28 years of industry programming experience. He has spent the majority of his career in the financial services industry. His expertise includes software architecture, design and development. In 2017, he discovered the Julia language and started working on several open-source projects such as SASLib.jl, BinaryTraits.jl and ContextTracking.jl. He has an MS Computer Science degree from University of California, Santa Barbara. He currently works at Facebook."
 },
 {
  "avatar": "https://www.gravatar.com/avatar/0857902b3ed99084e80ece0da08b334d",
  "name": "Dheepak Krishnamurthy",
  "submissions": [
   "88EDGD"
  ],
  "code": "ZWPRXJ",
  "biography": null
 },
 {
  "avatar": null,
  "name": "Said Rahal",
  "submissions": [
   "CEFANG"
  ],
  "code": "ZXG8YP",
  "biography": null
 },
 {
  "avatar": "https://pretalx.com/media/avatars/IMG_1315_small_2jT70eq.jpg",
  "name": "Rafael Fourquet",
  "submissions": [
   "KUVB9C"
  ],
  "code": "ZY8YGR",
  "biography": "A random Julia enthusiast, occasional contributor."
 }
]
