[
 {
  "avatar": null,
  "name": "Julius Krumbiegel",
  "submissions": [
   "FBLWD3"
  ],
  "code": "37WXQK",
  "biography": "Julius is a psychologist-turned-programmer who enjoys transforming raw data into visualizations that are both aesthetically pleasing and easy to understand."
 },
 {
  "avatar": null,
  "name": "Flemming Holtorf",
  "submissions": [
   "YBH93M",
   "QJ8YRN"
  ],
  "code": "39MLZ3",
  "biography": "Flemming is a PhD student at MIT working on computational techniques for uncertainty quantification and optimization under uncertainty."
 },
 {
  "avatar": "https://pretalx.com/media/avatars/avatar_eMiOJHW.jpg",
  "name": "Qingyu Qu",
  "submissions": [
   "UQNLK3"
  ],
  "code": "3AZBYK",
  "biography": "Developer and maintainer of [SciFracX](https://github.com/SciFracX), interested in differential equations and fractional order modeling."
 },
 {
  "avatar": null,
  "name": "Valentin Churavy",
  "submissions": [
   "X3UUFD",
   "QVESXM",
   "VAHYFE",
   "QMZUZH",
   "RHYB8M",
   "S8D3NM"
  ],
  "code": "3C7UBC",
  "biography": "asads"
 },
 {
  "avatar": "https://pretalx.com/media/avatars/git_clustered_16_k3p4Zth.png",
  "name": "Adrian Hill",
  "submissions": [
   "MFU9MN",
   "FXMQPQ"
  ],
  "code": "3CFNUV",
  "biography": "Adrian Hill is a PhD student in the Machine Learning Group at TU Berlin."
 },
 {
  "avatar": "https://www.gravatar.com/avatar/1574f8d9fd9ac9c89c23dd6b4817a045",
  "name": "Phillip Alday",
  "submissions": [
   "HFG3AW"
  ],
  "code": "3EFERC",
  "biography": "Phillip is a neuroscientist and contributor to the MixedModels.jl ecosystem. Additionally, he has contributed substantially to Effects.jl and StandardizedPredictors.jl"
 },
 {
  "avatar": "https://pretalx.com/media/avatars/ppp_gzilMNs.jpeg",
  "name": "Paulito Palmes",
  "submissions": [
   "K7VNZJ"
  ],
  "code": "3EKCYY",
  "biography": "I am a research scientist at the IBM Research Europe (Dublin Research Lab) working in the areas of analytics, datamining, machine learning, reinforcement learning, automated decisions, and AI.\r\n\r\nI finished my Doctor of Engineering degree from the Toyohashi University of Technology in Japan (2005). I have a Master's degree in Computer Science majoring in Artificial Intelligence (Ateneo de Manila University, 1995) and a Bachelor's degree in Applied Mathematics (cum laude, valedictorian) at the University of the Philippines in the Visayas (1991).\r\n\r\nI created and maintain the following Julia packages:\r\n- [AutoMLPipeline (Automated Machine Learning Pipeline)](https://github.com/IBM/AutoMLPipeline.jl)\r\n- [TSML (Time Series Machine Learning)](https://github.com/IBM/TSML.jl)\r\n- [Julia wrapper for Lale in Python](https://github.com/IBM/Lale.jl)"
 },
 {
  "avatar": "https://pretalx.com/media/avatars/1583588391082_CzJE2KJ.jpg",
  "name": "Jeremiah Lasquety-Reyes",
  "submissions": [
   "AUPPZY",
   "PTFQER"
  ],
  "code": "3EY8FS",
  "biography": "Jeremiah Lasquety-Reyes is a digital market analyst based in Hamburg, Germany. He uses R and Python on a daily basis, but has recently started to turn his sights on Julia, especially for the purpose of agent-based modeling."
 },
 {
  "avatar": "https://pretalx.com/media/avatars/265266424_6834515163257241_164130782207290776_n_eBv8Zcq.jpg",
  "name": "Olga Eleftherakou",
  "submissions": [
   "PUN7AF",
   "PTFQER"
  ],
  "code": "3FZJ7K",
  "biography": "Born in 1999 in Athens, Greece. A postgraduate student in Applied Statistics (fields of Data Science and Biostatistics) with a Bachelor's degree in Statistics and Actuarial Science, University of Piraeus. Passionate about Machine Learning. Currently learning Julia language by myself."
 },
 {
  "avatar": "https://pretalx.com/media/avatars/8075494_ucTWOym.jpeg",
  "name": "Josh Day",
  "submissions": [
   "WCKJQB"
  ],
  "code": "3JXPXF",
  "biography": "Dr. Josh Day (PhD Statistics, NC State) is a Senior Research Scientist at Julia Computing where he develops technical R&D software.  He's motivated by unsolved problems and his research interests are on-line algorithms (OnlineStats.jl), numerical optimization, and data visualization.  He maintains many Julia packages which can be viewed on [Github](https://github.com/joshday)."
 },
 {
  "avatar": null,
  "name": "Ander Murua",
  "submissions": [
   "VAZYBR"
  ],
  "code": "3L7JKD",
  "biography": null
 },
 {
  "avatar": "https://pretalx.com/media/avatars/IMG_3204_square_2ZRf7Vt.jpg",
  "name": "Adrian Salceanu",
  "submissions": [
   "BH8WSR"
  ],
  "code": "3MGMJN",
  "biography": "Computer Scientists and software developer with over 20 years of experience creating full stack web and data centric applications. Creator of Genie, the highly productive Julia web application. Julia open source contributor since 2017. Author of \"Julia Programming Projects\" (Packt, 2018) and co-author \"Julia Programming Complete Reference Guide\" (Packt, 2019)."
 },
 {
  "avatar": "https://pretalx.com/media/avatars/Capture_decran_2022-03-01_a_09.54.17_uE0V7f0.png",
  "name": "Louis Bouvier",
  "submissions": [
   "P7XJCV"
  ],
  "code": "3T8PAH",
  "biography": "PhD student in Machine Learning and Operations Research at CERMICS, Ecole des Ponts."
 },
 {
  "avatar": "https://pretalx.com/media/avatars/Heron_DEQVESO.jpg",
  "name": "Francisco Heron de Carvalho Junior",
  "submissions": [
   "DQHQZ8"
  ],
  "code": "3VFNZC",
  "biography": "DSc in Computer Science from the Federal University of Pernambuco, Recife, Brazil\r\n\r\nAssociate Professor, Department of Computing, Federal University of Ceará, Fortaleza, Brazil\r\n\r\nVisiting researcher at Northeastern University, Boston, USA.\r\n\r\nMain areas of interest: programming languages and high performance computing\r\n\r\nMost recent project: http://www.hpcshelf.org\r\n\r\nCurriculum: http://lattes.cnpq.br/4164818158160492\r\n\r\nLinkedIn: https://www.linkedin.com/in/francisco-heron-de-carvalho-junior-6bb58949/"
 },
 {
  "avatar": "https://pretalx.com/media/avatars/115566_sHWSJBh.jpeg",
  "name": "Ronny Bergmann",
  "submissions": [
   "ZT7AZZ"
  ],
  "code": "3W8BBF",
  "biography": "I am a mathematician and computer scientist working on optimization on manifolds."
 },
 {
  "avatar": "https://pretalx.com/media/avatars/yoniImage_CtxIvlZ.jpg",
  "name": "Yoni Nazarathy",
  "submissions": [
   "F7WDXE"
  ],
  "code": "777AC8",
  "biography": "Associate Professor Yoni Nazarathy from the University of Queensland Australia, specializes in data science, probability and statistics. His specific research interests include scheduling, control, queueing theory, and machine learning. He has been at The University of Queensland for over a decade, teaching courses in the Masters of Data Science program and working on research. Prior to his previous academic positions in Melbourne and the Netherlands, he worked in the aerospace industry in Israel. He is the co-author of a data science book, [Statistics with Julia: Fundamentals for Data Science, Machine Learning and Artificial Intelligence](https://statisticswithjulia.org/) as well as an ongoing book with drafts available [The Mathematical Engineering of Deep Learning](https://deeplearningmath.org/)."
 },
 {
  "avatar": "https://www.gravatar.com/avatar/68fd1b95c7265dc2756cf1d5a4cd8333",
  "name": "David Anthoff",
  "submissions": [
   "JPYJS8",
   "J9AX9Y"
  ],
  "code": "7JQFVF",
  "biography": "David Anthoff is an environmental economist who studies climate change and environmental policy. He co-develops the integrated assessment model FUND that is used widely in academic research and in policy analysis. His research has appeared in Nature, Science, the American Economic Review, Nature Climate Change, the Journal of the Association of Environmental and Resource Economists and other academic journals. He contributed a background research paper to the Stern Review and has advised numerous organizations (including US EPA, the German Bundesumweltamt and the Canadian National Round Table on the Environment and the Economy) on the economics of climate change.\r\n\r\nHe is an associate professor in the Energy and Resources Group at the University of California, Berkeley. Previously he was an assistant professor in the School of Natural Resources and the Environment of the University of Michigan, a postdoc at the University of California, Berkeley and a postdoc at the Economic and Social Research Institute in Ireland. He also was a visiting research fellow at the Smith School of Enterprise and the Environment, University of Oxford.\r\n\r\nHe holds a PhD (Dr. rer. pol.) in economics from the University of Hamburg (Germany) and the International Max Planck Research School on Earth System Modelling, a MSc in Environmental Change and Management from the University of Oxford (UK) and a M.Phil. in philosophy, logic and philosophy of science from Ludwig-Maximilians-Universität München (Munich, Germany)."
 },
 {
  "avatar": "https://pretalx.com/media/avatars/CGeoga_4LR_C1LSp8W.jpg",
  "name": "Christopher J Geoga",
  "submissions": [
   "N3J9KR"
  ],
  "code": "7WKFVY",
  "biography": "PhD student at Rutgers University, Dept. of Statistics"
 },
 {
  "avatar": "https://pretalx.com/media/avatars/23134958_AyMYvR1.jpeg",
  "name": "Vaibhav Dixit",
  "submissions": [
   "PDCANR"
  ],
  "code": "7YFPLU",
  "biography": "I am a Software Engineer at Julia Computing where I am involved in building tools for pharmaceutical industry. I am also a maintainer in the SciML ecosystem of packages for parameter estimation and global sensitivity analysis. I would love to talk to people about bayesian statistics and scientific machine learning as well as building software for EHRs and healthcare in general."
 },
 {
  "avatar": null,
  "name": "Sam Buercklin",
  "submissions": [
   "G9SQQD"
  ],
  "code": "7YNMYP",
  "biography": "Sam Buercklin is a research software engineer at Metalenz. \r\n\r\nAt Metalenz, Sam develops computational E&M tools for optical metasurfaces. His work touches on high performance computing, numerical optimization, and user-facing tools to specify and solve complex technical problems.\r\n\r\nSam has previously worked in various computational domains, including quantum computing, optics, and neuroscience."
 },
 {
  "avatar": null,
  "name": "Dhairya Gandhi",
  "submissions": [
   "LJRHQR"
  ],
  "code": "83D8SQ",
  "biography": "I am a data scientist at Julia Computing, and also the core developer in the FluxML ecosystem."
 },
 {
  "avatar": null,
  "name": "Jeffrey Vetter",
  "submissions": [
   "LUWYRJ",
   "CJZ3MV"
  ],
  "code": "898839",
  "biography": null
 },
 {
  "avatar": null,
  "name": "Mathieu Morlighem",
  "submissions": [
   "UNVUDM"
  ],
  "code": "89P8MK",
  "biography": null
 },
 {
  "avatar": null,
  "name": "Zhenghao Wu",
  "submissions": [
   "8M3NQ7"
  ],
  "code": "8BCABC",
  "biography": "Multiscale simulation for better life."
 },
 {
  "avatar": "https://pretalx.com/media/avatars/avatar_K2fis16.jpeg",
  "name": "Patrick Altmeyer",
  "submissions": [
   "HU8FVH",
   "TAYUVT",
   "Z7MXFS",
   "PTFQER"
  ],
  "code": "8DGYCX",
  "biography": "I am an economist and computer scientist currently studying for a PhD in Trustworthy Artificial Intelligence (AI) at Delft University of Technology. My research is on the intersection of AI and Financial Economics. In particular, I'm interested in Explainable AI, Counterfactual Explanations, Bayesian ML and Causal Inference and their applications to Financial Economics.\r\n\r\nPreviously, I worked as an economist for Bank of England where I was involved in research, monetary policy briefings and market intelligence. I hold bachelor's and master's degrees in Economics, Finance and Data Science."
 },
 {
  "avatar": "https://pretalx.com/media/avatars/headshot_gab_C78rwdQ.png",
  "name": "Gabriel Gobeil",
  "submissions": [
   "XMXJTD"
  ],
  "code": "8EDXNB",
  "biography": "I am a research associate at Polytechnique Montréal in the group of [Jonathan Jalbert](https://www.polymtl.ca/expertises/jalbert-jonathan)."
 },
 {
  "avatar": "https://pretalx.com/media/avatars/Profile_picture_0fGGJLc.jpeg",
  "name": "Matthew Fishman",
  "submissions": [
   "CSARPH"
  ],
  "code": "8Q8AYS",
  "biography": "Associate Data Scientist (Research Software Engineer) at the Center for Computational Quantum Physics (CCQ) at the Flatiron Institute in New York. I'm lead developer of ITensors.jl (co-developed with Miles Stoudenmire), a software library for easily developing and running efficient tensor network calculations. Co-developer of PastaQ.jl with Giacomo Torlai."
 },
 {
  "avatar": null,
  "name": "Eduardo M. G. Vila",
  "submissions": [
   "Z9Y73V"
  ],
  "code": "9AMMJ7",
  "biography": "PhD Student at Imperial College London"
 },
 {
  "avatar": null,
  "name": "Miguel Marcelino",
  "submissions": [
   "3VSJHV"
  ],
  "code": "9H8PN8",
  "biography": "I am a Master Thesis student at Instituto Superior Técnico and I am currently working on a transpiler to translate Python libraries into Julia. I also have experience in Java, Python, TypeScript, C, a hint of Haskell and, most recently, Julia, which surprised me for how fast and simple programming can be.\r\nBesides my programming activities, I am also a fan of photography, sports and writing."
 },
 {
  "avatar": null,
  "name": "Nguyen Quang Chien",
  "submissions": [
   "97XBUP"
  ],
  "code": "9KM37W",
  "biography": "I am a researcher and also a hobby programmer. I think (non-computer) scientists should now produce code that is not only functional, but also elegant as well."
 },
 {
  "avatar": "https://pretalx.com/media/avatars/IMG_0711_nM3MhzB.jpeg",
  "name": "Tim Gymnich",
  "submissions": [
   "X3UUFD"
  ],
  "code": "9LZBUX",
  "biography": "Tim is a postgraduate student at TU Munich, where he is studying for his M.Sc. in Computer Science. His main interests are in compiler optimizations for high performance computing and programming languages."
 },
 {
  "avatar": null,
  "name": "Mathieu Tanneau",
  "submissions": [
   "CFGAUV"
  ],
  "code": "9PVKLD",
  "biography": "Mathieu is currently a Post-doctoral fellow at Georgia Tech, where he is part of the Risk-Aware Market Clearing (RAMC) project (https://ramc.isye.gatech.edu/). His interests are in mixed-integer linear and nonlinear optimization, and their applications to Power Systems."
 },
 {
  "avatar": null,
  "name": "Philippe Gras",
  "submissions": [
   "EA7NVT"
  ],
  "code": "9RZAWU",
  "biography": "Philippe Gras is a physicist working at the Institute of Research of the Fundamental Laws of the Universe (Irfu). He is using Julia in the context of his research, to analyze data from High Energy Physics experiments."
 },
 {
  "avatar": "https://pretalx.com/media/avatars/picture_6vdfueQ.JPG",
  "name": "Waïss Azizian",
  "submissions": [
   "PFHGSD"
  ],
  "code": "9WJ7KH",
  "biography": "Phd student at ENS Paris & Université Grenoble Alpes"
 },
 {
  "avatar": null,
  "name": "Viral B Shah",
  "submissions": [
   "SSUNVP"
  ],
  "code": "9XGHYS",
  "biography": null
 },
 {
  "avatar": "https://www.gravatar.com/avatar/311f28d70bb1de3b0e9bb55e9d5fd26d",
  "name": "Tim Besard",
  "submissions": [
   "XKGBAM",
   "RHYB8M",
   "AAJJGP"
  ],
  "code": "9YQMAK",
  "biography": "Tim Besard is a software engineer at Julia Computing, working on GPU support for the Julia language. He holds a Ph.D. in computer science engineering from Ghent University, Belgium, for research on abstractions to program hardware accelerators in high-level programming languages."
 },
 {
  "avatar": "https://pretalx.com/media/avatars/2018-08-12_17.27.18.2_Qu0rRZO.jpg",
  "name": "Milan Klöwer",
  "submissions": [
   "DZFPGX"
  ],
  "code": "A9SQSW",
  "biography": "Post-Doctoral Research Assistant, University of Oxford, UK"
 },
 {
  "avatar": "https://pretalx.com/media/avatars/relax_TbiTd8l.png",
  "name": "Frankie Robertson",
  "submissions": [
   "FXVHE9"
  ],
  "code": "A9TESC",
  "biography": "I am a Doctoral Student in Educational Technology at the University of Jyväskylä in Finland. My research interests include educational technology and psychometrics, lexical semantics, Finnish Natural Language Processing and Computer Aided-Language Learning. My mission is to teach a computer Finnish, so that the computer can teach me Finnish. My PhD project centers around using background knowledge to model language learner knowledge and needs at an unprecedented level of detail."
 },
 {
  "avatar": null,
  "name": "Justin Mimbs",
  "submissions": [
   "UTT8SE"
  ],
  "code": "ADFHVG",
  "biography": "Justin Mimbs is a software engineer at ISEA TEK (Industrial & Systems Engineering Analysis Technologies) in Maitland, Florida."
 },
 {
  "avatar": "https://pretalx.com/media/avatars/Foto_de_Perfil_7uGWlJr.png",
  "name": "Agustin Covarrubias",
  "submissions": [
   "M3NG7A",
   "PTFQER"
  ],
  "code": "AKYARE",
  "biography": "Estudiante de ingeniería en UC | Chile que hace un poco de todo, nada especialmente bien. Trabajo como Jefe de Plataformas Digitales en la Fundación América Transparente."
 },
 {
  "avatar": "https://www.gravatar.com/avatar/7991445c6f182e1157148500f5493050",
  "name": "Curtis Vogt",
  "submissions": [
   "PWSDHS"
  ],
  "code": "AQLMAC",
  "biography": "I have been working with Julia since 2015 and have made a variety of contributions to the ecosystem. I am a member of the Julia Community Prize committee and work for Beacon Biosignals as a Principal Software Architect."
 },
 {
  "avatar": null,
  "name": "Lars Hellemo",
  "submissions": [
   "STM8PM"
  ],
  "code": "ASSCEF",
  "biography": "Lars Hellemo is a Senior Research Scientist at [SINTEF](https://www.sintef.no/en/), working on optimization and decision support, mainly in the energy and health care sectors."
 },
 {
  "avatar": "https://pretalx.com/media/avatars/Headshot_yFHKb56.jpg",
  "name": "Guilherme Fahur Bottino",
  "submissions": [
   "PMAYRF"
  ],
  "code": "ATAGTB",
  "biography": "Computational Chemist (Ph.D. Candidate) @ University of Campinas, Brazil; incoming Postdoc Researcher @ Wellesley College, USA. Chemistry teacher, Julia developer, Scientific Computing and Machine Learning enthusiast, casual MMORPG gamer, bartender and home cook. Programming makes Science even cooler! (He/Him/His)"
 },
 {
  "avatar": "https://pretalx.com/media/avatars/Conway_headshot_ZxC9daQ.jpg",
  "name": "Matthew Wigginton Bhagat-Conway",
  "submissions": [
   "DHYP8U"
  ],
  "code": "AVA9TW",
  "biography": "Matthew Bhagat-Conway is an Assistant Professor in the Department of City and Regional Planning. His research interests are in travel behavior, urban transportation, and statistical methods for transportation data analysis. He is also jointly appointed in the Odum Institute for Research in the Social Sciences, where he is available to assist researchers with statistics and data analysis.\r\n\r\nDr. Bhagat-Conway has a PhD and MA in Geography from Arizona State University, and a BA in Geography from the University of California, Santa Barbara. Prior to graduate school, he was a software developer and project manager for Conveyal, a public transport planning consulting firm, and a fellow in the Data Science for Social Good fellowship at the University of Chicago."
 },
 {
  "avatar": null,
  "name": "Diogo Netto",
  "submissions": [
   "LXSC3P"
  ],
  "code": "AZ8F99",
  "biography": "Masters student at MIT Julia Lab."
 },
 {
  "avatar": null,
  "name": "Ranjan Anantharaman",
  "submissions": [
   "MDCJKK",
   "S8D3NM"
  ],
  "code": "AZXJH3",
  "biography": "I am a PhD candidate at the Julia Lab at MIT."
 },
 {
  "avatar": null,
  "name": "Julia Gender Inclusive",
  "submissions": [
   "YLSWBC"
  ],
  "code": "B38TN3",
  "biography": "An initiative to promote gender diversity and inclusion within the wider Julia community. We aim to do this through a combination of community building, targeted outreach, education, mentorship, and mutual support."
 },
 {
  "avatar": "https://pretalx.com/media/avatars/IMG_20210429_111642_Bokeh_2_Hh5YUaf.jpeg",
  "name": "Zachary Morrell",
  "submissions": [
   "XNRBWC"
  ],
  "code": "B3K3DN",
  "biography": "I am a Postbac working at Los Alamos National Laboratory researching Quantum Annealing.  I recently graduated from the University of New Mexico with a double major in Computer Science and Computational Mathematics."
 },
 {
  "avatar": "https://pretalx.com/media/avatars/mugshot_bkDhIwg.png",
  "name": "Elliot Saba",
  "submissions": [
   "YED3MP"
  ],
  "code": "B98NWS",
  "biography": "Elliot Saba is a senior research engineer at Julia Computing, where he design next-generation tools for the Julia programming language. He received his Ph.D. from the University of Washington in Electrical Engineering in 2018, specializing in Digital Signal Processing and Machine Learning. Elliot received the Julia community prize at JuliaCon 2018, recognizing his open source contributions to the Julia project. When he is not building fundamental infrastructure for the Julia language, he enjoys dreaming up ever more complex strategies to automate watering his houseplants."
 },
 {
  "avatar": null,
  "name": "William Thompson",
  "submissions": [
   "VVPY9G"
  ],
  "code": "BHARS7",
  "biography": "Astronomy PhD candidate and Julia Enthusiast at the University of Victoria.\r\nMaintainer of PairPlots.jl"
 },
 {
  "avatar": null,
  "name": "Ben Arthur",
  "submissions": [
   "UTTHUM"
  ],
  "code": "BJR7KW",
  "biography": "Principal Software Engineer in Scientific Computing at Howard Hughes Medical Institute's Janelia Research Campus"
 },
 {
  "avatar": null,
  "name": "Rachel Kurchin",
  "submissions": [
   "JYDQEB",
   "LJYRGJ"
  ],
  "code": "BKJLVX",
  "biography": "rkurchin.github.io"
 },
 {
  "avatar": "https://pretalx.com/media/avatars/2018-09-14_10.36.43_1lFTwyD.jpg",
  "name": "Dean Markwick",
  "submissions": [
   "PRYQ8N",
   "QNAEBY"
  ],
  "code": "BPSXJZ",
  "biography": "I've been using Julia user since 2015 and maintain a number of packages from HawkesProcesses.jl to a number of data API wrappers. \r\n\r\nIn my day job I’m currently an electronic trading quant working on both principal and algo execution. I build models, analyse data and construct algorithms to try and get the best prices in the market with the lowest impact.\r\n\r\nOutside of my day job I enjoy writing about technology and sports on my blog."
 },
 {
  "avatar": "https://pretalx.com/media/avatars/Vikas_profile_pic_8NMia4Z.jpeg",
  "name": "Dr. Vikas Negi",
  "submissions": [
   "8MGPAT",
   "XXBPDM",
   "PTFQER"
  ],
  "code": "BQF8LN",
  "biography": "I currently work as a Metrology Design Engineer at ASML in the Netherlands. I love coding, and my language of choice is Julia. Besides that, I occasionally tinker with my Raspberry Pi. My other hobbies include listening to podcasts (big fan of Lex Fridman) during long walks, running and watching new shows/documentaries on Netflix. I am also a proud owner of a custom built PC and a Xbox One S. Whenever time permits, I dabble with Web 3.0 and blockchain based technologies. Curious to know more? Feel free to visit my web3 powered [site](https://vikasnegi.eth.link/)."
 },
 {
  "avatar": "https://pretalx.com/media/avatars/image_from_ios_iHnr3a1.jpg",
  "name": "Eric Brown",
  "submissions": [
   "8SMB3Q"
  ],
  "code": "BUDMWC",
  "biography": "Recent graduate specializing in neural PDE research. Currently employed as a machine learning engineer applying neural differential equations to financial forecasting and creditworthiness modeling."
 },
 {
  "avatar": "https://pretalx.com/media/avatars/Andrea-Vigliotti_7v6glaQ.jpg",
  "name": "Andrea Vigliotti",
  "submissions": [
   "UPQFKL"
  ],
  "code": "BVAVX8",
  "biography": "Researcher at the Italian Aerospace Research Center. My interests are in solid mechanics at large, both numerical and experimental."
 },
 {
  "avatar": "https://pretalx.com/media/avatars/DrArturoErdely_8uujM80.jpg",
  "name": "Arturo Erdely",
  "submissions": [
   "GXCNEZ",
   "PTFQER"
  ],
  "code": "BVRHH3",
  "biography": "Profesor de tiempo completo en la Universidad Nacional Autónoma de México (UNAM), miembro nivel 1 del Sistema Nacional de Investigadores (CONACYT - México), Actuario y Doctor en Ciencias Matemáticas (UNAM)."
 },
 {
  "avatar": "https://pretalx.com/media/avatars/2894312_s1hZnsJ.jpeg",
  "name": "Janis Erdmanis",
  "submissions": [
   "XJTDWH"
  ],
  "code": "BYKXMD",
  "biography": "I own a PhD degree titled \"Quantum effects of superconducting phase\" at TU Delft. Since then, I have found my passion in programming and designing cryptosystems. I like to expand boundaries and build frames where complexity becomes manageable. May be excited about job opportunities using Julia as the main driver."
 },
 {
  "avatar": "https://pretalx.com/media/avatars/Lelarge_Marc_uuuSKlC.jpg",
  "name": "marc lelarge",
  "submissions": [
   "PFHGSD"
  ],
  "code": "C7FG3K",
  "biography": "Dr. Lelarge is a researcher at INRIA in the DYOGENE Research team which is part of the computer science department of Ecole Normale Superieure, (Paris, France). He is also a lecturer in deep learning at Ecole Polytechnique (Palaiseau, France) and Ecole Normale Superieure. He graduated from Ecole Polytechnique, qualified as an engineer at Ecole Nationale Superieure des Telecommunications (Paris) and received a PhD in Applied Mathematics from Ecole Polytechnique in 2005. His research interests include machine learning, deep learning, graphs and data analytics.\r\nDr. Lelarge received the NetGCoop 2011 Best Paper Award with his PhD student E. Coupechoux, was awarded the 2012 SIGMETRICS rising star researcher award and the 2015 Best Publication in Applied Probability Award with Mohsen Bayati and Andrea Montanari for their work on compressed sensing."
 },
 {
  "avatar": "https://pretalx.com/media/avatars/5058E55E-66DD-47E4-8D7D-5F421A5801BC_1_201_a_bUoK3wj.jpeg",
  "name": "Christine Flood",
  "submissions": [
   "8VQAAD"
  ],
  "code": "C9Q9NL",
  "biography": "Christine Flood has worked in academia, industry, and government.  She's worked on commercially successful programming language implementations like java and academically interesting ones like Fortress, Lisp, and Id  She's  now focused on improving memory management performance in Julia."
 },
 {
  "avatar": "https://pretalx.com/media/avatars/avatar_huac055f77da59689772d9b68d89f1ca44_1188801_270x270_fill_lanczos_center_3_YczsC2d.png",
  "name": "Victor Boussange",
  "submissions": [
   "ZNEVTB"
  ],
  "code": "CEKMLK",
  "biography": "I’m Victor, a fourth year Ph.D candidate in the Landscape Ecology Group at ETH Zürich and at the Swiss Federal Institute for Forest, Snow & Landscape (WSL), Switzerland. I am interested in understanding evolutionary processes that affect the dynamics of ecosystems and economic systems. I conduct my investigations with mathematical models capturing eco-evolutionary dynamics. In parallel, I develop machine learning methods to combine these models with empirical data and infer scientific knowledge. I believe that the combination of mechanistic models and machine learning provides a powerful approach to better understand and forecast the dynamics of real ecosystems and economies."
 },
 {
  "avatar": "https://pretalx.com/media/avatars/picrew3_6CrDTRv.png",
  "name": "Xuan (Tan Zhi Xuan)",
  "submissions": [
   "FUKHEN",
   "A9SRVU"
  ],
  "code": "CFLQJP",
  "biography": "PhD student studying AI, cognitive science, automated planning, and probabilistic programming."
 },
 {
  "avatar": null,
  "name": "Jeremiah Lewis",
  "submissions": [
   "HCJNL3"
  ],
  "code": "CGNBCS",
  "biography": "Data scientist and Master's student in economics."
 },
 {
  "avatar": "https://pretalx.com/media/avatars/PXL_20210119_190551213_K44EJch.jpg",
  "name": "Francis Poulin",
  "submissions": [
   "VAHYFE"
  ],
  "code": "CJ9SDV",
  "biography": "Professor of Applied Mathematics at the University of Waterloo."
 },
 {
  "avatar": null,
  "name": "Cailin Winston",
  "submissions": [
   "LKFWFU",
   "QNAQV9",
   "HPAHBV",
   "ZMKHUZ",
   "VC7JEJ"
  ],
  "code": "CJVEWU",
  "biography": null
 },
 {
  "avatar": null,
  "name": "Anthony Blaom",
  "submissions": [
   "Q7WJ9F"
  ],
  "code": "CK3MKJ",
  "biography": "[Anthony Blaom](https://ablaom.github.io) Anthony Blaom is a mathematician, publishing in areas of pure mathematics, and a scientific computing consultant. He is a co-creator and lead contributor for MLJ, an open-source machine learning platform written in Julia.\r\n\r\nDr. Blaom was initially trained as a mechanical engineer at the University of Melbourne in 1991. After completing a MSc in Aeronautics and a PhD in Mathematics at Caltech in 1998, he joined the University of Auckland as a Lecturer. For a while he switched to adjunct teaching, focusing on his young children, whom he homeschooled while living on the small island of Waiheke.\r\n\r\nDr. Blaom is currently a Senior Research Fellow in the Department of Computer Science, University of Auckland."
 },
 {
  "avatar": null,
  "name": "Torkel Loman",
  "submissions": [
   "98UQX3"
  ],
  "code": "CKKFMJ",
  "biography": "Torkel Loman is a PhD student at the University of Cambridge, working on mathematical modelling of biochemical reaction networks in bacterial stress response."
 },
 {
  "avatar": "https://pretalx.com/media/avatars/RainerHeintzmann_quadrat300_AMShUlZ.jpg",
  "name": "Rainer Heintzmann",
  "submissions": [
   "X89FYS"
  ],
  "code": "CNV3SE",
  "biography": "Rainer Heintzmann works as a research head and university professor at the Leibniz Institute of Photonic Technology and the Friedrich Schiller University Jena.\r\nHis research focuses on imaging cellular function at high resolution. His group develops techniques to measure multidimensional information in small biological objects such as cells, cellular organelles or other small structures of interest. A further interest is in computer-based reconstruction methods.\r\nSoftware packages in Julia and other languages are developed for scientific computing and visualization with a special focus on optics and deconvolution."
 },
 {
  "avatar": "https://pretalx.com/media/avatars/44AC5597-FFB2-4BEA-AA4A-DD466C92A2C5_BniaaTe.jpeg",
  "name": "Ludger Paehler",
  "submissions": [
   "X3UUFD"
  ],
  "code": "CPB7FG",
  "biography": "Grad Student at TU Munich"
 },
 {
  "avatar": "https://pretalx.com/media/avatars/werder_3C3WoW4.jpg",
  "name": "Mauro Werder",
  "submissions": [
   "YPGNCS"
  ],
  "code": "CRJ7BV",
  "biography": "Glaciologist and Julia programmer"
 },
 {
  "avatar": null,
  "name": "Prem Chintalapudi",
  "submissions": [
   "NEKFDC"
  ],
  "code": "CVAUHS",
  "biography": "M. Eng. student at MIT"
 },
 {
  "avatar": "https://pretalx.com/media/avatars/profilepic_kWq38XI.jpg",
  "name": "Alex Jones",
  "submissions": [
   "8AYKB7"
  ],
  "code": "CVFTKF",
  "biography": "From a background in electronic engineering, radar and electromagnetics to working developing PDE tooling in Julia.\r\n\r\nLanguages - English, German"
 },
 {
  "avatar": null,
  "name": "Erin LeDell",
  "submissions": [
   "NPPKUW"
  ],
  "code": "CZATPB",
  "biography": null
 },
 {
  "avatar": "https://pretalx.com/media/avatars/me_oXcoH4m.png",
  "name": "Avik Pal",
  "submissions": [
   "NLDVYU"
  ],
  "code": "D3QNBC",
  "biography": null
 },
 {
  "avatar": null,
  "name": "William Kimmerer",
  "submissions": [
   "U8EC39",
   "UDLRAS"
  ],
  "code": "D8TKR8",
  "biography": "Research Software Engineer at the MIT JuliaLab. Focused on the Julia sparse ecosystem, and graph algorithms!"
 },
 {
  "avatar": "https://www.gravatar.com/avatar/0451cf68d776e5f47ba103445dbcaccd",
  "name": "Francesco Fucci",
  "submissions": [
   "GUQBSE"
  ],
  "code": "DADE9R",
  "biography": "Lead software-engineer @ ASML, passionate about algorithm design, software engineering and programming languages. Besides, I love to make electronic music and experiment with sound-design."
 },
 {
  "avatar": "https://pretalx.com/media/avatars/2021-09-24-155507_KYl8IK6.jpg",
  "name": "Erich Focht",
  "submissions": [
   "QMZUZH"
  ],
  "code": "DF8WEQ",
  "biography": "Erich has worked on optimizing CFD and structural mechanics algorithms for parallel vector supercomputers, did Linux kernel development and research in distributed systems software and parallel file systems. Currently he leads a research and development group at NEC HPC Europe, his work topics cover system software and compilers for heterogeneous computing with NEC's SX-Aurora Vector Engine, augmenting HPC simulations with AI and integrating cloud technologies into HPC clusters."
 },
 {
  "avatar": "https://pretalx.com/media/avatars/profilbild3_KQaCv3G.jpg",
  "name": "Fredrik Bagge Carlson",
  "submissions": [
   "ZSCNR7"
  ],
  "code": "DGDNGV",
  "biography": "I received my MSc and PhD 2019 from the Dept. Automatic Control in Lund, Sweden, working within the fields of control, machine learning and robotics. I have since spent a year with the Acoustic Research Laboratory at NUS and subsequently made the transition to industry, working with dynamic modeling, control and programming-language design in a robotics context. I am now working with Julia Computing on software tools for acausal modeling, simulation, optimization and control in the Julia programming language."
 },
 {
  "avatar": "https://pretalx.com/media/avatars/bk_new_side_med_L7bQy9W.png",
  "name": "Bogumił Kamiński",
  "submissions": [
   "83E8CW"
  ],
  "code": "DHRPEA",
  "biography": "I am a researcher in the fields of operations research and computational social science.\r\n\r\nFor development I mostly use Julia language.\r\n\r\nI am one of the maintainers of DataFrames.jl."
 },
 {
  "avatar": null,
  "name": "Jacob Quinn",
  "submissions": [
   "PWSDHS"
  ],
  "code": "DJTFHE",
  "biography": null
 },
 {
  "avatar": "https://pretalx.com/media/avatars/wi2yu01a_pGq0YQC.jpeg",
  "name": "Mathieu Besançon",
  "submissions": [
   "JLYCL8",
   "S8D3NM"
  ],
  "code": "DK9KDB",
  "biography": "Mathieu Besançon is a researcher at the Zuse Institute Berlin, in the AI in Society, Science, and Technology department, associated with the MODAL-SynLab project and a member of the MATH+ Berlin Mathematics Research Center.\r\n\r\nHis research interests span solution methods and software in MI(N)LP and convex optimization and in particular the SCIP framework and Frank-Wolfe related approaches."
 },
 {
  "avatar": null,
  "name": "Jan Siml",
  "submissions": [
   "QTN3ZY"
  ],
  "code": "DLUFRL",
  "biography": "I'm Head of Data and Product Insight at LexisNexis."
 },
 {
  "avatar": "https://pretalx.com/media/avatars/head_shot_32Fccg6.png",
  "name": "Carleton Coffrin",
  "submissions": [
   "XQMLCH"
  ],
  "code": "DNAPAH",
  "biography": "Carleton Coffrin is a staff scientist in Los Alamos National Laboratory’s Advanced Network Science Initiative. His research interests focus on how optimization methods can be used to solve applications in infrastructure networks. His background spans many forms of optimization including mathematical programing, constraint programming, and local search. Recently Carleton has been exploring the potential of novel computing architectures such as, quantum computers, neuromorphic processors and memristors to solve optimization applications."
 },
 {
  "avatar": "https://pretalx.com/media/avatars/IMG_20161126_1428484_ipQpq38.jpg",
  "name": "Chris Elrod",
  "submissions": [
   "9RFTHY",
   "TRFSJY"
  ],
  "code": "DNZRRM",
  "biography": "Chris Elrod is a frequent commenter on the Julia Discourse, Slack, and Zulip, as well as a contributor to the ecosystem, known in particular for LoopVectorization.jl and JuliaSIMD."
 },
 {
  "avatar": null,
  "name": "Michel Schanen",
  "submissions": [
   "8QUDVW"
  ],
  "code": "DUUAYM",
  "biography": null
 },
 {
  "avatar": "https://pretalx.com/media/avatars/headshot_-_Cropped_bmH40Nn.png",
  "name": "Charlie Kawczynski",
  "submissions": [
   "NN88VC",
   "PTFQER"
  ],
  "code": "E77THB",
  "biography": "Charlie earned his Ph.D. in mechanical engineering at UCLA, where he studied and developed software to simulate computational liquid metal magnetohydrodynamic flows for magnetic confined fusion energy reactors. Since then, he's been developing a climate model, in Julia, from the ground up at Caltech in the CliMA project. For more details, see https://clima.caltech.edu/."
 },
 {
  "avatar": null,
  "name": "Simon Alberti",
  "submissions": [
   "8M3NQ7"
  ],
  "code": "EAY7CX",
  "biography": null
 },
 {
  "avatar": "https://www.gravatar.com/avatar/f0aa406188ec55a18281bdb7457212ec",
  "name": "Fons van der Plas",
  "submissions": [
   "FLB8G9",
   "USY3RX"
  ],
  "code": "ECC83Q",
  "biography": "Excited about making scientific computing more accessible and fun! Looking forward to meet you!"
 },
 {
  "avatar": null,
  "name": "Tomas Chor",
  "submissions": [
   "VAHYFE"
  ],
  "code": "ECGMQA",
  "biography": "I'm a postdoctoral research at the University of Maryland, Dept of Atmospheric and Oceanic Science"
 },
 {
  "avatar": null,
  "name": "Frames Catherine White",
  "submissions": [
   "DZNPL9"
  ],
  "code": "ECUZBT",
  "biography": "Frames White is the lead of the research software engineering group at Invenia.\r\nShe is also the lead of the ChainRules project, and a major developer of many other Julia projects."
 },
 {
  "avatar": "https://pretalx.com/media/avatars/241014408_10225180381766053_2156773031120508848_n_k6o9vbP.jpg",
  "name": "Alejandro R. Urzúa",
  "submissions": [
   "YXQHKX"
  ],
  "code": "EEVZ3F",
  "biography": "Postdoctoral Fellow on Theoretical Physic at Physical Sciences Institute, UNAM MX.\r\n\r\nI've been using Julia consistently since 2018, in 2020 I wrote in the language all my numerical codes for my Ph.D. dissertation, Now I'm an advocate of the powerfulness, elegance, and simplicity of Julia."
 },
 {
  "avatar": null,
  "name": "Tangi Migot",
  "submissions": [
   "UDKTPD"
  ],
  "code": "EUXGZU",
  "biography": "Postdoctoral student at Polytechnique Montréal"
 },
 {
  "avatar": "https://pretalx.com/media/avatars/photo1634303652_6LTPI0n.jpeg",
  "name": "Moein Khalighi",
  "submissions": [
   "SV9TS9"
  ],
  "code": "EY3SKS",
  "biography": "PhD candidate in Turku Data Science Group, Department of Computing, at University of Turku, Finland.\r\nWorking on Identification and characterization of memory effects in experimental time-series data.\r\nORCID: 0000-0001-8176-0367\r\nInterested in: Ecological Memory, Fractional Calculus, Differential Equations, Dynamic Modelling, Data Analysis."
 },
 {
  "avatar": "https://pretalx.com/media/avatars/bvdmitri_mjUF7Hu.jpeg",
  "name": "Dmitry Bagaev",
  "submissions": [
   "MVRVTP"
  ],
  "code": "F87RD7",
  "biography": "My research interests lie in the fields of computers science, machine learning and probabilistic programming. Currently I am a PhD candidate in the SPS group of Electrical Engineering department in Eindhoven University of Technology. I’m working on a high-performant implementation of message passing-based Bayesian inference package in the Julia programming language. My research project focuses on Signal Processing and Active inference applications, but is also aimed to expand the scope of possible applications for message passing in general."
 },
 {
  "avatar": null,
  "name": "Giacomo Torlai",
  "submissions": [
   "CSARPH"
  ],
  "code": "FACVUA",
  "biography": "I am a research scientists at the Amazon Web Services Center for Quantum Computing, Pasadena (California). Previously I was a research fellow at the Center for Computational Quantum Physics of the Flatiron Institute (New York), and earned a PhD in physics at the University of Waterloo and the Perimeter Institute for Theoretical Physics, Waterloo (Canada). I am the lead developer of PastaQ.jl. \r\nhttps://twitter.com/giactorlai"
 },
 {
  "avatar": "https://www.gravatar.com/avatar/a52d3af3aeb0bc53290d7da25da03ed2",
  "name": "Chris Foster",
  "submissions": [
   "RKLTEP"
  ],
  "code": "FAS33Q",
  "biography": "I'm a long time enthusiastic user of Julia and enjoy contributing to various packages across the open source ecosystem, Julia standard libraries and compiler. I love hearing about people's fascinating technical computing adventures of all types! Find me at https://github.com/c42f or as Chris Foster/c42f on the julialang Zulip, slack or discourse."
 },
 {
  "avatar": "https://pretalx.com/media/avatars/wmoses_1_VVEugnL.jpg",
  "name": "William Moses",
  "submissions": [
   "X3UUFD"
  ],
  "code": "FEJFGM",
  "biography": "William S. Moses is a Ph.D. Candidate at MIT, where he also received his M.Eng in electrical engineering and computer science (EECS) and B.S. in EECS and physics. William’s research involves creating compilers and program representations that enable performance and use-case portability, thus enabling non-experts to leverage the latest in high-performance computing and ML. He is known as the lead developer of Enzyme (NeurIPS ’20, SC ’21), an automatic differentiation tool for LLVM capable of differentiating code in a variety of languages, after optimization, and for a variety of architectures and the lead developer of Polygeist (PACT ’21), a polyhedral compiler and C++ frontend for MLIR. He has also worked on the Tensor Comprehensions framework for synthesizing high-performance GPU kernels of ML code, the Tapir compiler for parallel programs (best paper at PPoPP ’17), and compilers that use machine learning to better optimize. He is a recipient of the U.S. Department of Energy Computational Science Graduate Fellowship and the Karl Taylor Compton Prize, MIT’s highest student award."
 },
 {
  "avatar": null,
  "name": "Albert de Montserrat",
  "submissions": [
   "7FVVF3"
  ],
  "code": "FQ7PY3",
  "biography": null
 },
 {
  "avatar": null,
  "name": "Sarah Williamson",
  "submissions": [
   "UNVUDM"
  ],
  "code": "FSAGLX",
  "biography": null
 },
 {
  "avatar": "https://www.gravatar.com/avatar/7de414ca6a7eb07360b871f97665642f",
  "name": "Pedro Xavier",
  "submissions": [
   "LJC7R8"
  ],
  "code": "FSFWDY",
  "biography": "My name is Pedro and I'm from Brasil. I'm a Computer and Information Engineering student at the Federal University of Rio de Janeiro (UFRJ) where I also pursue a Pure Mathematics degree as double major.\r\nI'm intersted in many research topics concerning Maths and it's applications, even those which apply to purely theoretical fields. I've been spending most of my time in the University studying Logic, Compilers, Optimization, Computer Graphics, Quantum Computing and Artificial Intelligence.\r\nApart from that, I've been into other adventures such as Public Healthcare management systems at FIOCRUZ (Viva o SUS!) and Generative Design in architecture at FAU-UFRJ.\r\nI'm currently building amazing stuff at PSR."
 },
 {
  "avatar": "https://pretalx.com/media/avatars/me_9Fk2vty.jpeg",
  "name": "Yijun Xie",
  "submissions": [
   "YMFXKE"
  ],
  "code": "FXRKZS",
  "biography": "Yijun is currently a Senior Data Scientist at Shopify. Prior to joining Shopify, Yijun also worked as a Data Scientist at the Royal Bank of Canada. Yijun obtained his Ph.D. in Statistics from the University of Waterloo, and his research focuses on functional data analysis and dimension reduction."
 },
 {
  "avatar": null,
  "name": "Johnny Chen",
  "submissions": [
   "ZFUAHG"
  ],
  "code": "G3HPCS",
  "biography": "I'm a Ph.D. student in East China Normal University, I also maintain the JuliaImages ecosystem and the JuliaCN community. More details on GitHub @johnnychen94."
 },
 {
  "avatar": null,
  "name": "António Almeida",
  "submissions": [
   "G8HLTE"
  ],
  "code": "GCZLBX",
  "biography": "Fascinated by the intersection of Science and programming. Developer Evangelist at UP42 by day,"
 },
 {
  "avatar": "https://pretalx.com/media/avatars/tue-canvas_HedGsYS.jpg",
  "name": "Martin Roa Villescas",
  "submissions": [
   "AGW8BR"
  ],
  "code": "GFMR8R",
  "biography": "Martin Roa-Villescas received his B.Sc. degree in Electronic Engineering from the National University of Colombia, Manizales, Colombia in 2010, and his M.Sc. degree in Embedded Systems from the Eindhoven University of Technology (TU/e), Eindhoven, The Netherlands, in 2013. He is currently pursuing a Ph.D. degree in Bayesian Machine Learning with a special track in education at TU/e. From 2013 to 2018, he worked as an embedded software designer in Philips Research, Eindhoven, The Netherlands. His research interests include probabilistic graphical models, probabilistic programming, and embedded systems."
 },
 {
  "avatar": "https://www.gravatar.com/avatar/8af4d5971a2308b86a94f58fb98129c5",
  "name": "Jameson Nash",
  "submissions": [
   "RQZBFB"
  ],
  "code": "GKZDHU",
  "biography": "I work for Julia Computing on Julia compiler technology."
 },
 {
  "avatar": "https://pretalx.com/media/avatars/20191202_095616_2_IoRQj4Q.jpg",
  "name": "Felipe Coelho Argolo",
  "submissions": [
   "EMCDNC"
  ],
  "code": "GLXP7Q",
  "biography": "M.D.: Awarded Alfredo Brito award for scientific production.\r\nPh.D.:Psychiatry and Medical Psychology.\r\nPost-doc Researcher: NLP in Psychosis.\r\nAmateur martial artist, musician and surfer."
 },
 {
  "avatar": "https://pretalx.com/media/avatars/profile_7u2jDF2.jpg",
  "name": "Kiran Shila",
  "submissions": [
   "ML8N7S"
  ],
  "code": "GQNRFP",
  "biography": "Kiran received the B.S. and M.S degrees in electrical engineering from the University of South Florida, Tampa, FL in 2018 and 2020, respectively. He is currently a Ph.D. student in the electrical engineering department at the California Institute of Technology (Caltech) in Pasadena with a research appointment in the department of astronomy. His current research interests include radio astronomy instrumentation, room-temperature and cryogenic low noise amplifiers, and radio astronomy software. In his free time, he plays the jazz vibraphone, bikes around LA, and contributes to open source software."
 },
 {
  "avatar": null,
  "name": "Suyash Bire",
  "submissions": [
   "VAHYFE"
  ],
  "code": "GRBYGP",
  "biography": null
 },
 {
  "avatar": "https://pretalx.com/media/avatars/avatar_rp1dkRf.png",
  "name": "Julian P Samaroo",
  "submissions": [
   "8A83SB"
  ],
  "code": "GRFD9D",
  "biography": "Research Software Engineer at MIT's JuliaLab.\r\n\r\nI'm the maintainer of Dagger.jl, AMDGPU.jl, and BPFnative.jl, and am dedicated to making Julia's heterogeneous computing support powerful and productive."
 },
 {
  "avatar": null,
  "name": "Alexis Montoison",
  "submissions": [
   "U3M9XK"
  ],
  "code": "GWJSF8",
  "biography": "Alexis Montoison\r\n\r\nPhD student, GERAD and Polytechnique Montréal\r\n\r\nMontréal, Canada\r\n\r\nalexis.montoison@polymtl.ca"
 },
 {
  "avatar": "https://www.gravatar.com/avatar/7e76579d61a3dabf3576b93f7f078806",
  "name": "Bart Janssens",
  "submissions": [
   "FPZVML"
  ],
  "code": "H3TNC7",
  "biography": "Bart Janssens is a military associate professor at the mechanics department of the [Royal Military Academy](https://www.rma.ac.be), with a passion for computer graphics, high performance computing and fluid mechanics. For performance reasons, he used C++ until being introduced to Julia. His current work focuses on stabilized finite element methods, and he recently started a new study on the topic where for the first time the main focus will be on using Julia and Gridap rather than the legacy C++ code."
 },
 {
  "avatar": "https://pretalx.com/media/avatars/1628698205247_ZndnX8c.jpeg",
  "name": "Takuya Kitazawa",
  "submissions": [
   "VWVY9S"
  ],
  "code": "H7JDBW",
  "biography": "**[Takuya Kitazawa](https://takuti.me/)** is a product developer and data ethicist, working at the intersection of technological and societal aspects of data-driven applications. He professionally serves as a full-stack software & machine learning engineer, data scientist, and product manager, while advocating [ethical product development](https://takuti.me/note/ethical-product-developer/) as an OSS developer and technical evangelist."
 },
 {
  "avatar": "https://pretalx.com/media/avatars/headshot_2021_4AhGpUF.JPG",
  "name": "Theo Diamandis",
  "submissions": [
   "EBBQDB"
  ],
  "code": "H8VVYE",
  "biography": "Optimization PhD student at MIT"
 },
 {
  "avatar": null,
  "name": "Kyla McConnell",
  "submissions": [
   "B9DJ9G"
  ],
  "code": "HF37BY",
  "biography": "Kyla McConnell and Julia Müller are Ph.D. students at the University of Freiburg, where \r\nthey conduct quantitative psycholinguistic research and teach graduate-level statistics \r\nand data skills. They co-organize two groups for gender inclusivity in programming: Julia\r\nGender Inclusive (@juliainclusive) and R-Ladies Freiburg (@RLadiesFreiburg). \r\nThrough these groups, they have fostered a passion for data science and statistical \r\neducation, particularly for underrepresented genders. You can find their many \r\nworkshops for beginners and more experienced programmers alike on the Julia \r\nProgramming Language and R-Ladies Global Youtube channels, and by following us on \r\nTwitter (@McConnellKyla & @JuliaMuellerFr)."
 },
 {
  "avatar": "https://pretalx.com/media/avatars/przemyslaw_szufel_kadrowane600x750_zE0iQfb.jpg",
  "name": "Przemysław Szufel",
  "submissions": [
   "DBS3SS"
  ],
  "code": "HNA89P",
  "biography": "Przemysław Szufel is an Assistant Professor at SGH Warsaw School of Economics, Adjunct Professor at Ryerson University, Toronto, co-owner at  StatXplorer.com - company offering custom made optimization and machine learning models and Founding Partner of Nunatak Capital - a VC fund that specializes in investing in startups that build their value on data analytics. His main research focus is applying advanced analytics methods, and in particular, machine learning, simulation and optimization in modelling in bringing new value to business processes. He is a co-author of several tools and algorithms for optimal and cost efficient collection and analysis of large data sets in the cloud. He is a co-author of over 40 publications, including handbooks and journal papers, in the area of applying advanced analytics, machine learning and simulation methods to making optimal business decisions. He is an active member of the Julia language community - maintains 3 official Julia packages and has 3rd place in the world answering Julia-related questions on StackOverflow. He is a co-author of book “Julia 1.0 Programming Cookbook: Over 100 numerical and distributed computing recipes for your daily data science workflow”. Przemyław is also co-managing SilverDecisions.pl project (that aims for representing and supporting business decisions), which has been elected by the European Commission to the Innovation Radar programe, grouping the best innovations financed by the EU funds. Przemyslaw has been awarded by the Polish Ministry of Science and Higher Education for implementing data science innovations to business environment. Recently, in a survey by SGH Student Council he has been selected the best teaching professor at SGH Warsaw School of Economics scoring the highest number of student votes among the entire faculty."
 },
 {
  "avatar": null,
  "name": "Kristopher Brown",
  "submissions": [
   "SHU83W"
  ],
  "code": "HRUXFN",
  "biography": "Postdoctoral researcher at UF working with James Fairbanks."
 },
 {
  "avatar": null,
  "name": "Krystian Guliński",
  "submissions": [
   "ZA9RYG"
  ],
  "code": "HRXMAH",
  "biography": "https://github.com/krynju"
 },
 {
  "avatar": "https://pretalx.com/media/avatars/PamelaBustamante_01FkdBT.png",
  "name": "Pamela Alejandra Bustamante Faúndez",
  "submissions": [
   "7M3BKA"
  ],
  "code": "HSUYYR",
  "biography": "Pamela Bustamante Faúndez is a PhD candidate from Pontificia Universidad Católica de Chile (Chile). She holds a Master in Industrial Engineering and a BSc degree with Distinction in Industrial Engineering from the Universidad del Bío-Bío. \r\nShe has been using Julia since her undergraduate days at Universidad del Bío-Bío, Chile. Co-author of IntroAJulia.jl"
 },
 {
  "avatar": "https://pretalx.com/media/avatars/45061462_10161134630105235_4942115779702161408_n_0x8Bnb2.jpg",
  "name": "Alexandre A. Renchon",
  "submissions": [
   "9J3PGX"
  ],
  "code": "HSXEX3",
  "biography": "Alexandre A. Renchon, currently postdoctoral appointee at Argonne National Laboratory, has a PhD in Terrestrial Ecology (2019, Western Syndey University), and Master degree in Bioengineering, Environmental Sciences and Technology (2013, Liege University). Alexandre is a multidisciplinary scientists with experience as an empiricist, modeler, and programmer. His interests are to understand how climate change will impact terrestrial ecosystems."
 },
 {
  "avatar": "https://pretalx.com/media/avatars/photo_pjg_tg7FXf1.jpg",
  "name": "Paul Goulart",
  "submissions": [
   "UNRVRP"
  ],
  "code": "HYYXU7",
  "biography": "Paul Goulart joined the University of Oxford in 2014 as an Associate Professor in Engineering Science and a Tutorial Fellow in Engineering Science. He received his SB and MSc degrees in Aeronautics and Astronautics from the Massachusetts Institute of Technology (MIT). Following his undergraduate studies he was a software developer in the flight operations centre for the Chandra X-Ray Observatory at the Harvard-Smithsonian Centre for Astrophysics, and later an engineer in the Autonomous Systems research group at the Charles Stark Draper Laboratory.\r\n\r\nIn 2003 he was selected as a Gates Scholar at the University of Cambridge, where he received a PhD in Control Engineering in 2007. From 2007 to 2011 he was a Lecturer in control systems in the Department of Aeronautics at Imperial College London, and from 2011 to 2014 a Senior Researcher in the Automatic Control Laboratory at ETH Zurich. He is currently a member of the Control Group in the department of Engineering Science.\r\n\r\nHis research interests are in high speed optimisation and control for embedded systems, data-driven and robust optimisation, and machine learning."
 },
 {
  "avatar": null,
  "name": "Hector D. Perez",
  "submissions": [
   "L9SQZ9"
  ],
  "code": "J7KDFG",
  "biography": null
 },
 {
  "avatar": null,
  "name": "Bernardo Freitas Paulo da Costa",
  "submissions": [
   "NPHSNW"
  ],
  "code": "J8F3ML",
  "biography": "Professor of Mathematics at UFRJ, Brazil"
 },
 {
  "avatar": "https://www.gravatar.com/avatar/2989a078f4caff6fb86fa30e59bd9aa9",
  "name": "Tim Holy & Valentin Churavy",
  "submissions": [
   "DUQQLN"
  ],
  "code": "J9BSUH",
  "biography": "Tim Holy is the Alan A. and Edith L. Wolff Professor of Neuroscience at Washington University in St. Louis. Valentin Churavy is a Ph.D. student in MIT's Computer Science & Artificial Intelligence Laboratory. Both are long-time contributors to Julia and its package ecosystem."
 },
 {
  "avatar": "https://www.gravatar.com/avatar/2f059a4bcbd77a1de2e69eec5c67e5bf",
  "name": "Kevin Bonham",
  "submissions": [
   "PXRENJ"
  ],
  "code": "JAMMRT",
  "biography": "Senior research scientist at Wellesley College, studying the human microbiome and its effects on cognitive development."
 },
 {
  "avatar": "https://pretalx.com/media/avatars/Dispatch_UEha6uw.png",
  "name": "Miguel Raz Guzmán Macedo",
  "submissions": [
   "7M3BKA",
   "PFUHDL",
   "9LJV7K",
   "C3ZNN3"
  ],
  "code": "JE89PF",
  "biography": "Miguel Raz es un estudiante de física de la UNAM."
 },
 {
  "avatar": "https://pretalx.com/media/avatars/CARION_CIV_TAQnLBu.jpg",
  "name": "Tristan Carion",
  "submissions": [
   "KSPLRK"
  ],
  "code": "JFWGMZ",
  "biography": "Tristan Carion is a mechanical engineer from UCL (Université Catholique de Louvain-la-Neuve) in Belgium. After spending a few years working for the industry and traveling the world, he returned to the academic world in 2020 where he joined the Royal Military Academy of Belgium (RMA) to start a PhD. He is working for a joint project of RMA, ECMWF and RMI (Royal Meteorological Institute of Belgium), which involves implementing atmospheric dispersion models and response models on the ECMWF Weather Cloud and using the ensemble forecasts from ECMWF to produce ensemble dispersion modeling."
 },
 {
  "avatar": "https://pretalx.com/media/avatars/106985157_282311202859595_1951602273255141840_n_2_JOqZnRx.jpg",
  "name": "Martin Smit",
  "submissions": [
   "JXBTJF",
   "PTFQER"
  ],
  "code": "JFZQZ7",
  "biography": "Hello, my name is Jacobus Smit, but you can call me Martin (derived from my second name). My pronouns are he/him. I just finished the Oxford Master's in Mathematical Sciences (OMMS) at St Cross college and will be starting my PhD in the Socially Intelligent Artificial Systems group at the University of Amsterdam.\r\n\r\nI love computational mathematics and statistics, especially their applications to social sciences such as economics and sociology. I author and maintain the TernaryPlots.jl."
 },
 {
  "avatar": "https://pretalx.com/media/avatars/self-crop_V7BfpDH.jpg",
  "name": "Rik Huijzer",
  "submissions": [
   "LJHYAQ"
  ],
  "code": "JHBKNM",
  "biography": "I'm a PhD student at the University of Groningen and co-author of the Julia Data Science book. I think that Julia solves a lot of problems that other languages have, so that's why I like contributing to the language ecosystem. To this end, I have created the Books.jl, PowerAnalyses.jl, Skans.jl and PlutoStaticHTML.jl packages and I contributed to Turing, MLJ, Pluto, julia-actions and more."
 },
 {
  "avatar": "https://www.gravatar.com/avatar/a88e24b35ad3dfa8448596ce6f4dbe53",
  "name": "Ashwani Rathee",
  "submissions": [
   "HFNKTC"
  ],
  "code": "JL7ETD",
  "biography": "Julian"
 },
 {
  "avatar": "https://pretalx.com/media/avatars/portrait_latest_gCshG7F.jpg",
  "name": "Patrick Fournier",
  "submissions": [
   "U7WAAD"
  ],
  "code": "JLHZAA",
  "biography": "PhD candidate in mathematics @ STATQAM (Université du Québec à Montréal)."
 },
 {
  "avatar": null,
  "name": "Nathan Daly",
  "submissions": [
   "YHYSEM"
  ],
  "code": "JP9VJF",
  "biography": "Software Engineer at RelationalAI"
 },
 {
  "avatar": "https://www.gravatar.com/avatar/832d10ca3b2825c42d2280cbeca6fef6",
  "name": "Simon Danisch",
  "submissions": [
   "FX788D",
   "FBLWD3"
  ],
  "code": "JSJDXE",
  "biography": "Simon is a freelance software engineer who has been part of the Julia community for more than 9 years and is the author of many Julia packages:\r\n* Makie\r\n* GeometryBasics\r\n* GPUArrays\r\n* PackageCompiler\r\n* JSServe\r\n* FileIO"
 },
 {
  "avatar": null,
  "name": "Anika Luo",
  "submissions": [
   "PXRENJ"
  ],
  "code": "JURY3H",
  "biography": "Undergraduate Researcher at Wellesley College"
 },
 {
  "avatar": "https://pretalx.com/media/avatars/clima-crop_5o14OCY.png",
  "name": "Gregory Wagner",
  "submissions": [
   "VAHYFE"
  ],
  "code": "JVB98C",
  "biography": "Physical oceanographer working on approximate models for ocean turbulence"
 },
 {
  "avatar": "https://pretalx.com/media/avatars/profile_picture_jvnHESk.png",
  "name": "Johannes Blaschke",
  "submissions": [
   "LUWYRJ",
   "QVESXM"
  ],
  "code": "K9PVSE",
  "biography": null
 },
 {
  "avatar": "https://www.gravatar.com/avatar/6f75257683625cb2a5398f3d610c5355",
  "name": "Helge Eichhorn",
  "submissions": [
   "AG7CGF"
  ],
  "code": "KDTCJJ",
  "biography": "I am working on reimagining space exploration with Open Source at [JuliaAstro](https://github.com/JuliaAstro), [JuliaSpace](https://github.com/JuliaSpace), and [OpenAstrodynamics](https://github.com/openastrodynamics).\r\n\r\nCurrently serving as Head of Product Innovation at [Telespazio Germany](https://www.telespazio.de/)."
 },
 {
  "avatar": "https://pretalx.com/media/avatars/_MG_4356_ovFVMSr.jpg",
  "name": "Valeria Perez",
  "submissions": [
   "LSRMCT",
   "PTFQER"
  ],
  "code": "KE7RJF",
  "biography": "Valeria Pérez is a 24 year-old mexican programmer living in Monterrey, México. She studied Applied Mathematics at the Tecnológico Autónomo de México (ITAM). She graduated in 2020 and worked at the Instituto Mexicano del Seguro Social (IMSS) the largest health provider in México as a junior developer helping with models regarding the COVID-19 pandemic. Currently, she is working in her bachelor thesis and looking to work developing software for techonology companies. \r\nValeria knows how to program in R, Python and Julia. She is a fluent speaker and writer in English and Spanish. Her passions include gender equality, dance, running and reading."
 },
 {
  "avatar": "https://pretalx.com/media/avatars/102412076_RrXY5qe.jpg",
  "name": "Víctor Álvarez Aparicio",
  "submissions": [
   "ZSARJD"
  ],
  "code": "KF3NEC",
  "biography": "Hi! I'm Víctor Álvarez Aparicio, math and scientific programming enthusiast. I'm currently working as a research fellow in University of La Rioja (Spain), studying applications of Topology in the field of Iteration of Rational Maps and Complex Dynamics. My colleagues and I mainly develop our algorithms in Julia Language.\r\n\r\nMy interests are Algebraic Topology, Differential Topology, Complex Dynamics and Ergodic Theory, Iterative Proccesses, Scientific Programming, Julia Language, TDA (Topological Data Analysis), among others. I'm really glad and excited to join this community and to share our contributions with everyone interested!"
 },
 {
  "avatar": null,
  "name": "Jose Storopoli",
  "submissions": [
   "WLNWBV"
  ],
  "code": "KFWW8C",
  "biography": null
 },
 {
  "avatar": null,
  "name": "Rafael Diaz",
  "submissions": [
   "HCEGRV"
  ],
  "code": "KJ9YRY",
  "biography": "I am a post-doc at \"La Sapienza\" University of Rome, working in the group of Giorgio Parisi. I mostly study disordered systems like amorphous solids, but I am interested in several topics related to statistical physics. I am Mexican and obtained my BSc and MSc degrees in the National University of Mexico, and then moved to Rome for my PhD."
 },
 {
  "avatar": null,
  "name": "Patrick Heimbach",
  "submissions": [
   "UNVUDM"
  ],
  "code": "KKHQBQ",
  "biography": "I am a computational oceanographer, professor in the Jackson School of Geosciences, and W. A. “Tex” Moncrief, Jr., chair III in Simulation-Based Engineering and Sciences in the Oden Institute at the University of Texas at Austin. At UT, I direct the CRIOS-UT.github.io group.\r\n\r\nMy research focuses on ocean and ice dynamics and their role in the global climate system. A computational focus is the use of inverse methods and automatic differentiation applied to ocean and sea ice model parameter and state estimation, uncertainty quantification and observing system design. I earned my Ph.D. from the Max-Planck-Institute for Meteorology and the University of Hamburg, Germany. Prior to joining UT, I spent 16 years at MIT. I am the lead-PI of an NSF CSSI project DJ4Earth.github.io (since 08/2021)."
 },
 {
  "avatar": "https://pretalx.com/media/avatars/foto_square_T9CvHfD.png",
  "name": "Gustavo A. Ballen",
  "submissions": [
   "VVDVAS"
  ],
  "code": "KLCZT3",
  "biography": "I’m an evolutionary biologist interested in the development and implementation of quantitative methods for studying the interrelationships among living organisms. I use integrative methods in the intersection among neontology, palaeontolgy, statistical inference, phylogenetics, and bioinformatics.\r\n\r\nI’m currently a postdoctoral research assistant in the dos Reis research group, School of Biological and Behavioural Sciences, Queen Mary University of London"
 },
 {
  "avatar": "https://pretalx.com/media/avatars/245015835_283422126962316_132167486804690739_n_1_SkeizBI.jpg",
  "name": "Paul Tiede",
  "submissions": [
   "3LHDTD"
  ],
  "code": "KWBFEW",
  "biography": "Paul Tiede obtained his Ph.D. degree at the University of Waterloo and Perimeter Institute in 2021. Afterward, he joined the Harvard & Smithsonian | Center for Astrophysics and the Black Hole Initiative. He is interested in the intersection of accretion modeling and statistical modeling. As a member of the Event Horizon Telescope, he has developed modeling and simulation techniques for analyzing time-variable emission or \"flares\" that could enable high-precision measurements of gravity. Additionally, he is a core developer of numerous software packages for the EHT written in Julia, C++, and Python."
 },
 {
  "avatar": "https://pretalx.com/media/avatars/lolo_OTtCY8b.png",
  "name": "Nicolau Leal Werneck",
  "submissions": [
   "WKNY78"
  ],
  "code": "KXTSV7",
  "biography": "Electrical Engineering PhD from Brazil specializing in computer vision and pattern recognition. Julia programmer since v1.0 and scruffy functional programmer."
 },
 {
  "avatar": null,
  "name": "Samuel Isaacson",
  "submissions": [
   "98UQX3"
  ],
  "code": "L3ZKDL",
  "biography": null
 },
 {
  "avatar": "https://pretalx.com/media/avatars/Andrew-Ross-Winters-andwi94_TuhbHBp.jpg",
  "name": "Andrew Winters",
  "submissions": [
   "YSLKZJ"
  ],
  "code": "LBHDJ9",
  "biography": "I am an Assistant Professor in the Department of Mathematics, Division of Applied Mathematics at Linköping University in Linköping, Sweden."
 },
 {
  "avatar": null,
  "name": "Garrek Stemo",
  "submissions": [
   "MFYKTY",
   "PTFQER"
  ],
  "code": "LCUASZ",
  "biography": "PhD candidate in physical chemistry and molecular science at the Nara Institute of Science and Technology."
 },
 {
  "avatar": "https://www.gravatar.com/avatar/b0cf54b8431443687735cb486599ea9c",
  "name": "Miles Lubin",
  "submissions": [
   "KCL3JM"
  ],
  "code": "LHAQVA",
  "biography": "Miles Lubin is the benevolent dictator for life (BDFL) of JuMP."
 },
 {
  "avatar": "https://www.gravatar.com/avatar/e8b4c754f59079ee0f56ba77d7f2066f",
  "name": "Daniel Molina",
  "submissions": [
   "KGLNUH"
  ],
  "code": "LM37DY",
  "biography": "I am tenure in Computer Science at the University of Granada, Spain. I strongly support free software in my life and use it daily in my teaching. I learned Julia more than a year ago, mainly for research, in Machine Learning and Optimization, but also for teaching."
 },
 {
  "avatar": null,
  "name": "Jean-Michel Campin",
  "submissions": [
   "VAHYFE"
  ],
  "code": "LN8KHT",
  "biography": "Working with Oceananigans.jl"
 },
 {
  "avatar": null,
  "name": "Giovanni P",
  "submissions": [
   "RQP9TG"
  ],
  "code": "LNRHHF",
  "biography": "PhD Student in Mathematics (Logic & Computer Science)\r\nUniversity of Parma & University of Ferrara"
 },
 {
  "avatar": "https://pretalx.com/media/avatars/me_2_jjzhWud.jpg",
  "name": "Will Tebbutt",
  "submissions": [
   "N7DSLT"
  ],
  "code": "LQKANJ",
  "biography": "I'm a PhD student in the Machine Learning Group at Cambridge, supervised by Richard E. Turner. I'm generally interested in probabilistic modelling and (approximate) inference, how Gaussian processes should feature in probabilistic programming, and how to scale GPs for large time series and spatio-temporal problems."
 },
 {
  "avatar": "https://pretalx.com/media/avatars/IMG_20210421_134835_cz8RCW2.jpg",
  "name": "Jakub Mitura",
  "submissions": [
   "9PKGGH"
  ],
  "code": "LQTEAK",
  "biography": "I am a student in my last year of MSc in Computer Science - Big Data Specialization  (graduation June 2022 r.) also a physician in the last year of nuclear medicine residency working with various modalities of medical imaging. Additionally for the last 4 years I have been a lecturer  in international programmes teaching subjects like Anatomy and Radiology in English . Simultaneously I am a junior research assistant in Medical University of Lublin and  in the final steps of acquiring a PhD in Nuclear Medicine. I already passed all examinations, and have preliminary positive reviews, formally I will acquire PhD probably on 14.04.2022"
 },
 {
  "avatar": null,
  "name": "Joaquim Dias Garcia",
  "submissions": [
   "CUJU8K"
  ],
  "code": "LRPWKX",
  "biography": "Researcher and developer at PSR. Based in Brasil. Working with Power Systems, Stochastic Optimization, Bilevel Optimization, Reinforcement Learning. JuMP developer."
 },
 {
  "avatar": "https://www.gravatar.com/avatar/74957770231c3ecb84a731e021fc3835",
  "name": "David Gleich",
  "submissions": [
   "7H77WX"
  ],
  "code": "LTHEEK",
  "biography": "David Gleich is an associate professor of computer science at Purdue University."
 },
 {
  "avatar": "https://pretalx.com/media/avatars/avi_hstxXRX.JPG",
  "name": "Rafael Schouten",
  "submissions": [
   "WCKJQB"
  ],
  "code": "LVYSRF",
  "biography": null
 },
 {
  "avatar": null,
  "name": "Chelsea Sidrane",
  "submissions": [
   "TSN8ZR"
  ],
  "code": "M9YY8S",
  "biography": null
 },
 {
  "avatar": null,
  "name": "Joseba Makazaga",
  "submissions": [
   "VAZYBR"
  ],
  "code": "MBVBUB",
  "biography": null
 },
 {
  "avatar": "https://pretalx.com/media/avatars/Saranjeet-Kaur-Bhogal_zon7FNE.jpg",
  "name": "Saranjeet Kaur Bhogal",
  "submissions": [
   "NPRVMS",
   "PTFQER"
  ],
  "code": "MCGB3X",
  "biography": "Saranjeet is a Statistician based in India. She has written the first draft of the R Development Guide under the mentorship of Heather Turner and Micheal Lawrence, funded by the R Foundation. Furthermore, she is supporting Heather Turner in the work on the outreach of the R Development Guide at the Digital Infrastructure Incubator at Code for Science & Society. Saranjeet has also worked with the Julia Language organization for Google Summer of Code 2020. She is eager to learn about open source and open science practices. Saranjeet co-founded the Research Software Engineering (RSE) Asia Association during her participation in the Cohort 4 of the Open Life Science program, to promote the RSE community and profession in the Asia region. She is being mentored by Michelle Barker to build the RSE Asia community. Recently she has been selected in the founding committee of NumFOCUS Project Incubator. This Incubator is designed to support the growth of open source scientific projects and communities.\r\nPersonal website: https://saranjeetkaur.github.io/About-Me/"
 },
 {
  "avatar": null,
  "name": "Aidan Gleich",
  "submissions": [
   "Z98GWK"
  ],
  "code": "MECLU7",
  "biography": "Sr. Research Analyst at NYFRB"
 },
 {
  "avatar": "https://pretalx.com/media/avatars/Annelle_sNeCOb8.png",
  "name": "Annelle Kayisire Abatoni",
  "submissions": [
   "PXRENJ"
  ],
  "code": "MHQTLH",
  "biography": "I am a Biology and Media Arts and Sciences double major, and I am particularly interested in the intersection of computational design and biological concepts. I am currently working on finding out and creatively exhibiting the microbial composition of Wellesley’s greenhouse, the Global Flora and exploring their different functions. In the past, I’ve worked on developing a software package that manipulates and analyzes microbial community data. After college, I hope to keep working with computational modeling tools to better understand biological systems. Outside of lab and school, I enjoy playing tennis and spending time with my friends."
 },
 {
  "avatar": "https://pretalx.com/media/avatars/cropped_1800x1800_300dpi_XOb5zbZ.png",
  "name": "Jonathan Doucette",
  "submissions": [
   "CB3PEY"
  ],
  "code": "MJ9ECN",
  "biography": "PhD candidate studying MRI physics at the University of British Columbia."
 },
 {
  "avatar": "https://pretalx.com/media/avatars/DSCF7415-3-extra-small-square_CQ6AvPO.png",
  "name": "Stephan Sahm",
  "submissions": [
   "ME9GW8",
   "U9SMMK"
  ],
  "code": "MJPZGQ",
  "biography": "Stephan Sahm founded [Jolin.io](https://www.jolin.io), an IT consultancy for high-performant data/ml pipelines powered by Julia. He also organises the biggest Julia meetup in Germany, Julia-User-Group-Munich.\r\nWith 10 years experience in data science and 5 years in IT consultancy and data-startups, he strives to bring tomorrows best practice into todays business.\r\n\r\nJulia packages developed by Stephan Sahm: Continuables.jl, WhereTraits.jl, ExprParsers.jl, TypeClasses.jl, ExtensibleEffects.jl and more."
 },
 {
  "avatar": null,
  "name": "Pradyumna",
  "submissions": [
   "CY7YFB"
  ],
  "code": "MK7JUB",
  "biography": null
 },
 {
  "avatar": "https://pretalx.com/media/avatars/high_FBSlmQo.jpg",
  "name": "Benoît Legat",
  "submissions": [
   "TRFSJY",
   "LSUKYX"
  ],
  "code": "MLJG3F",
  "biography": "Benoît Legat is a postdoc at MIT with Prof. Pablo Parrilo in the Laboratory for Information and Decision Systems (LIDS)."
 },
 {
  "avatar": null,
  "name": "Dominique Orban",
  "submissions": [
   "YTTXMK"
  ],
  "code": "MN9YCG",
  "biography": "I am computational mathematician. My scientific interests span computational optimization, numerical analysis, numerical linear algebra, scientific computing, and modeling environments. I have a keen interest in the interplay between computational science and programming languages.\r\n\r\nMy research focuses on the design, convergence analysis, numerical properties, practical implementation, and testing of algorithms for continuous optimization and their linear algebra kernels. I am equally interested in applying algorithms that I design to problems that arise in engineering and science.\r\n\r\nMy research activities thus comprise tightly interconnected theoretical analyses of computational methods and high-quality implementations to aid in the modeling and solution of practical problems."
 },
 {
  "avatar": null,
  "name": "Matthijs Cox",
  "submissions": [
   "EKZHPS"
  ],
  "code": "MQ8FSP",
  "biography": "Born in The Netherlands. MSc. and PhD. at TU Eindhoven on Applied Physics.\r\n\r\nA physicist who loves to code. I taught myself data science and software development.\r\nCurrently I work at ASML on the R&D of sensor and algorithms software."
 },
 {
  "avatar": "https://www.gravatar.com/avatar/749aed7820b87920c03fab45475ce1af",
  "name": "Caleb Winston",
  "submissions": [
   "LKFWFU",
   "VC7JEJ",
   "QNAQV9",
   "HPAHBV",
   "ZMKHUZ"
  ],
  "code": "MQTPBB",
  "biography": "I'm Caleb. I'm currently studying Computer Science at the University of Washington and will be doing research at Stanford next year. My research interests are quite broad and I have published work in areas including both brain-computer interfaces and wet lab automation and I would be happy to chat about these things. I'm also currently working on https://BanyanComputing.com. Outside of CS, I love composing music and playing the alto sax in an ensemble group with my siblings."
 },
 {
  "avatar": null,
  "name": "Eirik Brandsaas",
  "submissions": [
   "FZ38VW"
  ],
  "code": "MTJCCL",
  "biography": "Economist at the Federal Reserve Board of Governors. Primary research area is computational macroeconomics, with a focus on household finance, housing, and family economics."
 },
 {
  "avatar": "https://pretalx.com/media/avatars/IMGP7132_1-1_ratio_JV7ACSb.jpg",
  "name": "George Gkountouras",
  "submissions": [
   "9EM3P7"
  ],
  "code": "N7LMCY",
  "biography": "George Gkountouras (MSc ECE) is the founder of Arthurian Audio, an AI startup operating in the audio  software industry. Additionally, he has invented and published a quantum sequencer for modular environments. During his academic career, George regularly taught DSP to undergraduate students. He's worked on compilers, circuit simulators and audio plug-ins. He is also interested in embedded systems."
 },
 {
  "avatar": null,
  "name": "Guillaume Baudart",
  "submissions": [
   "PFHGSD"
  ],
  "code": "N8GRVN",
  "biography": "Researcher at Inria Paris and École normale supérieure.\r\nPreviously research staff member at the IBM T.J. Watson research center."
 },
 {
  "avatar": "https://pretalx.com/media/avatars/LinkedInPhoto2_thl2yZj.png",
  "name": "David Gomez-Cabeza",
  "submissions": [
   "XRDKTW"
  ],
  "code": "NBMJG8",
  "biography": "I am a Bioengineering PhD student at the University of Edinburgh working on optimal experimental design for automated model calibration and selection, both computationally and experimentaly. Coming from a pure experimental background (Microbiology), I discovered how powerfull modeling can be in not just predicting, but designing new biological systems, hence my transition to a hybrid type of work. I discovered Julia a couple of years ago, looking for faster environments to do my computational research (mostly Bayesian based), and now I completely shifted all my work to it!"
 },
 {
  "avatar": "https://pretalx.com/media/avatars/Screenshot_2021-12-14_at_12.50.40_Lv2kUR1.png",
  "name": "Giulio Benedetti",
  "submissions": [
   "QG8VUX"
  ],
  "code": "NDHRNU",
  "biography": "Bioengineering student at Rhine-Waal University, Germany, and former research trainee at Turku University, Finland, where he contributed to FdeSolver.jl and MicrobiomeAnalysis.jl under the supervision of the Turku Data Science Group. Interested in bioinformatics and data science."
 },
 {
  "avatar": "https://pretalx.com/media/avatars/1644459184718_Q695Lrg.png",
  "name": "Fábio Rodrigues Sodré",
  "submissions": [
   "XTKVK3",
   "PTFQER"
  ],
  "code": "NFBXZN",
  "biography": "Analista programador web, gamer, apaixonado por leitura e futebol\r\nGestor da Unidade de Gestão da Informação | Secretaria Adjunta da Tecnologia da Informação do Maranhão - SEATI / MA - Brasil"
 },
 {
  "avatar": null,
  "name": "Boris Kaus",
  "submissions": [
   "7FVVF3",
   "UNVUDM"
  ],
  "code": "NHMXEV",
  "biography": "Computational geodynamicist at the University of Mainz, Germany"
 },
 {
  "avatar": "https://pretalx.com/media/avatars/JAR00701_small_Sn3Dzze.jpeg",
  "name": "Forrest Laine",
  "submissions": [
   "LKHHEX"
  ],
  "code": "NJWMSK",
  "biography": "Forrest Laine is an Assistant Professor of Computer Science at Vanderbilt University. He completed his PhD and B.S. from UC Berkeley in 2021 and 2015, respectively. His research includes game-theoretic methods for multi-agent decision making, and methods for solving various extended mathematical programming problems. He has worked at several autonomous vehicle companies, and continues to perform research on autonomous systems and robotics in general."
 },
 {
  "avatar": null,
  "name": "Niklas Hackelberg",
  "submissions": [
   "ZPVDSR"
  ],
  "code": "NXJKDH",
  "biography": "I'm a PHD student working on Magnetic Particle Imaging at the Institute for Biomedical Imaging at the University Medical Center Hamburg-Eppendorf and the Hamburg University of Technology in Germany."
 },
 {
  "avatar": null,
  "name": "Rasmus Kjær Høier",
  "submissions": [
   "7S9YZV"
  ],
  "code": "NXZATT",
  "biography": "I am a PhD student at Chalmers University of Technology.  My research interests are biologically motivated learning algorithms and energy based models."
 },
 {
  "avatar": "https://pretalx.com/media/avatars/nin-kanji-cropped_oi0GQdP.jpg",
  "name": "Jorge A. Pérez-Hernández",
  "submissions": [
   "AG7CGF"
  ],
  "code": "NYBGVS",
  "biography": "I'm a Software Engineer at Telespazio Germany GmbH. In 2021 I graduated from the Physics PhD from the National Autonomous University of Mexico, UNAM. I'm interested in astrodynamics, celestial mechanics, orbit determination, and Solar System dynamics."
 },
 {
  "avatar": "https://pretalx.com/media/avatars/photo_page_web_current_juLqW9t.jpg",
  "name": "Gaspard Kemlin",
  "submissions": [
   "LGWRV8"
  ],
  "code": "NZRHS3",
  "biography": "I am 3rd year PhD student at CERMICS, ENPC and Inria Paris, team MATHERIALS. I work on numerical analysis of PDEs for quantum chemistry, and in particular electronic structure calculations. Part of my work uses the Density Functional ToolKit (DFTK.jl), a Julia package developed by Michael F. Herbst and Antoine Levitt."
 },
 {
  "avatar": null,
  "name": "Guilherme Bodin",
  "submissions": [
   "L79WHV"
  ],
  "code": "PCLZTQ",
  "biography": "Guilherme is an engineer at PSR and an avid contributor to packages in the JuMP ecosystem since the beginning of his master's degree."
 },
 {
  "avatar": "https://pretalx.com/media/avatars/personal_photo_f7sorNx.jpg",
  "name": "Mohamed Tarek",
  "submissions": [
   "DTHTBC"
  ],
  "code": "PFTTSC",
  "biography": "Scientist at PumasAI Inc."
 },
 {
  "avatar": "https://pretalx.com/media/avatars/prof_pic_PeNvS8m.jpg",
  "name": "Guillaume Dalle",
  "submissions": [
   "DTHTBC",
   "P7XJCV"
  ],
  "code": "PJVBLC",
  "biography": "PhD student at École des Ponts (France), working on machine learning and operations research with applications to railway planning."
 },
 {
  "avatar": "https://www.gravatar.com/avatar/5ac7b1da0f2e9107b5020f88023a15e5",
  "name": "Simon Byrne",
  "submissions": [
   "NZGX7D"
  ],
  "code": "PKSECG",
  "biography": "Dr Simon Byrne is the lead software engineer on the CliMA project, and has been using and contributing to Julia since 2012."
 },
 {
  "avatar": "https://pretalx.com/media/avatars/TobiasKnopp_L0XxMX2.jpg",
  "name": "Tobias Knopp",
  "submissions": [
   "BASTLY"
  ],
  "code": "PM3B8U",
  "biography": "Tobias Knopp received his Diplom degree in computer science in 2007 and his PhD in 2010, both from the University of Lübeck with highest distinction. For his PhD on the tomographic imaging method Magnetic Particle Imaging (MPI) he was awarded with the Klee award from the DGBMT (VDE) in 2011. From 2010 until 2011 he led the MAPIT project at the University of Lübeck and published the first scientific book on MPI. In 2011 he joined Bruker Biospin to work on the first commercially available MPI system. From 2012 until 2014 he worked at Thorlabs in the field of Optical Coherence Tomography (OCT) as a software developer. Since 2014, Tobias Knopp is a professor for Biomedical Imaging at the University Medical Center Hamburg-Eppendorf and the Hamburg University of Technology in Hamburg, Germany. Beside his work as a researcher in the field of tomographic imaging method Tobias Knopp is an open-source developer and part of the Julia community since 2012."
 },
 {
  "avatar": null,
  "name": "Nora Loose",
  "submissions": [
   "UNVUDM"
  ],
  "code": "PMC8EJ",
  "biography": null
 },
 {
  "avatar": "https://pretalx.com/media/avatars/photo_2021-03-30_16-40-27_1RCfOfV.jpg",
  "name": "Marco Bonici",
  "submissions": [
   "VWGBAL"
  ],
  "code": "PPMTQ9",
  "biography": "I am a PostDoctoral Researcher at INAF-IASF in Milano. My research interest lies in the field of Cosmology and, specifically, I am involved in Euclid, a mission of the European Space Agency. I am involved in several scientific working group within Euclid, with a particular focus on the analysis of the final data of the mission."
 },
 {
  "avatar": "https://pretalx.com/media/avatars/lucalle2_hkb2HBy.jpg",
  "name": "Luca Ferranti",
  "submissions": [
   "DFYH73",
   "33DXRM"
  ],
  "code": "PTCVCM",
  "biography": "I am a phd student in computer science. I am enthusiastic about maths, computation, Julia and computational maths in Julia. More details on my [github page](https://github.com/lucaferranti), if you share some of interests and want to collaborate or chat, do not hesitate to contact me, I hang out fairly often on the Julia slack and zulip channels."
 },
 {
  "avatar": "https://pretalx.com/media/avatars/chiel_KzFovWI.jpg",
  "name": "Chiel van Heerwaarden",
  "submissions": [
   "X37FHS"
  ],
  "code": "PTRG8U",
  "biography": "I am an atmospheric scientist trying to understand the interactions between turbulence, clouds, radiation and the land surface with 3D simulation and field observations (see chiel.ghost.io). The main tool of our research lab is MicroHH, our in-house C++/CUDA 3D simulation code. Recently, I have ported the dynamical core of MicroHH to Julia to make the code more accessible to students, as C++ is often too complex to learn for a short project, and have a tool for future SciML projects."
 },
 {
  "avatar": "https://pretalx.com/media/avatars/me20-crop_GfRsA77.jpg",
  "name": "Maarten Pronk",
  "submissions": [
   "WCKJQB"
  ],
  "code": "Q33DZA",
  "biography": "GeoData Scientist working on elevation modelling @Deltares. External PhD candidate at @tudelft3d"
 },
 {
  "avatar": null,
  "name": "Julia Müller",
  "submissions": [
   "B9DJ9G"
  ],
  "code": "Q7GFPE",
  "biography": "Kyla McConnell and Julia Müller are Ph.D. students at the University of Freiburg, where \r\nthey conduct quantitative psycholinguistic research and teach graduate-level statistics \r\nand data skills. They co-organize two groups for gender inclusivity in programming: Julia\r\nGender Inclusive (@juliainclusive) and R-Ladies Freiburg (@RLadiesFreiburg). \r\nThrough these groups, they have fostered a passion for data science and statistical \r\neducation, particularly for underrepresented genders. You can find their many \r\nworkshops for beginners and more experienced programmers alike on the Julia \r\nProgramming Language and R-Ladies Global Youtube channels, and by following us on \r\nTwitter (@McConnellKyla & @JuliaMuellerFr)."
 },
 {
  "avatar": null,
  "name": "Eirik Brandsaas & Kyra Sadovi",
  "submissions": [
   "FZ38VW"
  ],
  "code": "QADPRP",
  "biography": "Eirik Brandsaas is an economist at the Board of Governors of the Federal Reserve System. Kyra Sadovi is a research assistant at the Board of Governors."
 },
 {
  "avatar": null,
  "name": "Markus Towara",
  "submissions": [
   "LGWRV8"
  ],
  "code": "QHAXTM",
  "biography": "https://github.com/JuliaMolSim/DFTK.jl"
 },
 {
  "avatar": "https://www.gravatar.com/avatar/488d7f981ef4bd9cb54bd0aeff098bcd",
  "name": "Jesús-Adolfo Mejía-de-Dios",
  "submissions": [
   "8LRJVY"
  ],
  "code": "QHWSLS",
  "biography": "Jesús Mejía is a Ph.D. student from the Artificial Intelligence Research Institute at the University of Veracruz (IIIA-UV). He received a BSc degree in mathematics from the University of Veracruz and obtained a master’s degree with an honorific mention in Artificial Intelligence from CIIA-UV. His research interests include Numerical Analysis, Bilevel Optimization, and Intelligent Computing."
 },
 {
  "avatar": null,
  "name": "Rodrigo Duran",
  "submissions": [
   "VAHYFE"
  ],
  "code": "QN3AMH",
  "biography": "www.oceanresearch.xyz"
 },
 {
  "avatar": null,
  "name": "Sri Hari Krishna Narayanan",
  "submissions": [
   "UNVUDM"
  ],
  "code": "QNPKMA",
  "biography": "Sri Hari Krishna is a Computer Scientist at Argonne National Laboratory. He conducts research in automatic differentiation, develops AD tools, and applies them to different scientific domains."
 },
 {
  "avatar": null,
  "name": "Simone Silvestri",
  "submissions": [
   "VAHYFE"
  ],
  "code": "QPR3V3",
  "biography": null
 },
 {
  "avatar": "https://pretalx.com/media/avatars/WF_Godoy_WCq2o8K.jpg",
  "name": "William F Godoy",
  "submissions": [
   "CJZ3MV"
  ],
  "code": "QQZ83B",
  "biography": "Senior Computer Scientist in the Computational Science and Mathematics Division at Oak Ridge National Laboratory. Interests in High-Performance Computing (HPC) infrastructure, computational physics and large scale simulations. Julia aficionado."
 },
 {
  "avatar": "https://pretalx.com/media/avatars/8177701_jKilj4H.jpg",
  "name": "Oscar Dowson",
  "submissions": [
   "XBX9BH"
  ],
  "code": "QREN8R",
  "biography": "Oscar Dowson is a core contributor to JuMP."
 },
 {
  "avatar": "https://pretalx.com/media/avatars/csm_OMLIN_samuel_3a2df39fc2_IJUK2tt.jpg",
  "name": "Samuel Omlin",
  "submissions": [
   "H3N8UN",
   "AKVUKM",
   "RJYBLA",
   "YPGNCS",
   "7FVVF3"
  ],
  "code": "QTKXPY",
  "biography": "Computational Scientist and responsible for Julia computing at the Swiss National Supercomputing Centre (CSCS), ETH Zurich"
 },
 {
  "avatar": null,
  "name": "Valeri Vasquez",
  "submissions": [
   "878K9K"
  ],
  "code": "QTQ3YB",
  "biography": "PhD candidate, University of California Berkeley \r\nMS, Electrical Engineering and Computer Sciences\r\nMS, Energy and Resources"
 },
 {
  "avatar": null,
  "name": "Oscar Smith",
  "submissions": [
   "S8KUPP"
  ],
  "code": "QZAY7Y",
  "biography": "I graduated from Carleton College and studied math and computer science, and now work for JuliaComputing on analog circuit simulation. I also make math go vroom."
 },
 {
  "avatar": "https://pretalx.com/media/avatars/stanford2_moreblurred_cut_github_E1Kahzs.jpg",
  "name": "Carsten Bauer",
  "submissions": [
   "LUWYRJ",
   "DAASVV",
   "S8D3NM"
  ],
  "code": "R3SWQF",
  "biography": "Theoretical Physicist - Scientific HPC Advisor - National High Performance Computing (NHR) - Paderborn Center for Parallel Computing (PC²)"
 },
 {
  "avatar": "https://pretalx.com/media/avatars/55e0337a-7d9d-4412-a58c-83919a107bcb_ugejzQo.jpg",
  "name": "Julia Frank",
  "submissions": [
   "ZMQBSR",
   "PTFQER"
  ],
  "code": "R7DNJC",
  "biography": "Undergraduate physics student (starting an MSc Physics degree in May 2022) from Canada. \r\nBlogging about Julia Language and physics."
 },
 {
  "avatar": "https://pretalx.com/media/avatars/amit_h5fC2yc.png",
  "name": "Amit Shukla",
  "submissions": [
   "YRY8M3"
  ],
  "code": "R9ZVLC",
  "biography": "Hands-on Executive Consultant, ERP Implementation, AI Data Science, Machine Learning, Deep Learning, Business Intelligence, Flutter DART Angular Mobile apps."
 },
 {
  "avatar": "https://pretalx.com/media/avatars/pietro_vertechi_oUTFv5C.jpg",
  "name": "Pietro Vertechi",
  "submissions": [
   "V3NPES"
  ],
  "code": "RB8YD8",
  "biography": "I completed my PhD in neuroscience at Champalimaud Research. There, my research work revolved around the inference of hidden states in tasks performed by both biological and artificial agents. Currently, I am working on novel methods for intelligible artificial intelligence.\r\n\r\nAn overview of my open source work can be found on my [GitHub page](https://github.com/piever)."
 },
 {
  "avatar": null,
  "name": "Sebastian Pfitzner",
  "submissions": [
   "JPYJS8"
  ],
  "code": "RCTGVS",
  "biography": null
 },
 {
  "avatar": null,
  "name": "Oriol Colomes",
  "submissions": [
   "JBVLSK"
  ],
  "code": "RHYTX3",
  "biography": "Oriol Colomes is Assistant Progessor at TU Delft, in the Offshore Engineering section at the Civil Engineering and Geosciences faculty."
 },
 {
  "avatar": null,
  "name": "Geoffroy Leconte",
  "submissions": [
   "VGSB89"
  ],
  "code": "RT9N7T",
  "biography": "Phd student at Polytechnique Montréal supervised by Dominique Orban. I am developing RipQP.jl, a package for solving convex quadratic problems and I also contribute to the organization JuliaSmoothOptimizers."
 },
 {
  "avatar": "https://pretalx.com/media/avatars/phd_defense_cropped_TTbyqhK.jpeg",
  "name": "Luis Eduardo de Souza Amorim",
  "submissions": [
   "3XBUWE"
  ],
  "code": "RUVAU8",
  "biography": "With a broad interest in programming language design and implementation, I'm currently a PostDoc at the Australian National University working on memory management and virtual machines. My previous work from my PhD at Delft University of Technology focused on syntax definition formalisms and parsing."
 },
 {
  "avatar": "https://www.gravatar.com/avatar/07d05678901b9225b8644fc455d27b16",
  "name": "Weishi Wang",
  "submissions": [
   "SZSESM"
  ],
  "code": "SACWSR",
  "biography": "Weishi Wang is a Ph.D. student studying quantum chemistry and quantum physics at the department of physics and astronomy at Dartmouth College. His current research interests are classical and quantum computing applications for electronic structure problems."
 },
 {
  "avatar": null,
  "name": "Samuel",
  "submissions": [
   "Q7WJ9F"
  ],
  "code": "SFJ7MN",
  "biography": null
 },
 {
  "avatar": "https://pretalx.com/media/avatars/HallProfessional-2020crop_CvJ22C2.jpg",
  "name": "Julian Hall",
  "submissions": [
   "ZPUZPU"
  ],
  "code": "SFV3PJ",
  "biography": "I have been developing software for linear optimization since my time as a PhD student with Roger Fletcher in the late 1980's. A lecturer at the University of Edinburgh since 1990, my research has focused on serial and parallel computing techniques for implementing the simplex algorithm for linear programming. This has resulted in the development of HiGHS, the world's best open-source software for linear optimization."
 },
 {
  "avatar": null,
  "name": "Jan Verschelde",
  "submissions": [
   "UL3T8K"
  ],
  "code": "SGLNCU",
  "biography": "Jan Verschelde obtained his PhD in Computer Science in 1996 at the Katholieke Universiteit Leuven.  After postdoctoral studies at Michigan State University and the Mathematical Sciences Research Institute in Berkeley, he joined the Department of Mathematics, Statistics and Computer Science at the University of Illinois at Chicago, where he teaches courses in symbolic computing, numerical analysis, computational geometry, industrial math & computation, scientific software, and supercomputing.  He is the main developer of PHCpack, a software package to solve polynomial systems by homotopy continuation."
 },
 {
  "avatar": "https://pretalx.com/media/avatars/yadongli_ecTissd.jpg",
  "name": "Yadong Li",
  "submissions": [
   "WL9FZZ"
  ],
  "code": "SHXTDN",
  "biography": "Yadong Li is the CTO and co-founder of Julius Technologies Inc. He has over 17 years of experience in quantitative finance, and has held a number of senior leadership roles at Lehman Brothers and Barclays. Yadong has published multiple papers on derivative pricing/risk, capital allocation and optimization etc. He also taught at the Courant Math Finance Master program at NYU. Yadong also has a Ph.D. in Physics, and Master degrees in Computer Science and Financial Engineering. \r\n\r\nYadong is a pioneer in the graph computing space. He created Julius' low-code, auto-scaling and visual graph computing platform that delivers the power of graph computing to every developer!"
 },
 {
  "avatar": null,
  "name": "Peter Cheng",
  "submissions": [
   "KX9NAV"
  ],
  "code": "SJNHPW",
  "biography": "A graduate student working on deep learning and natural language processing."
 },
 {
  "avatar": null,
  "name": "Jose Storopoli",
  "submissions": [
   "8JWMG8"
  ],
  "code": "SKB7VR",
  "biography": "Associate Professor and Researcher of the [Department of Computer Science](https://uninove.br/ppgi) at [Universidade Nove de Julho - UNINOVE](https://uninove.br) located in São Paulo - Brazil.\r\nLead on Education and Training at [Pumas-AI](https://pumas.ai).\r\n\r\nTeaches undergraduate and graduate courses in Data Science, Statistics, Bayesian Statistics, Machine Learning and Deep Learning using `Julia`, `R`, `Python`, and `Stan`. Contributor to `Julia`, `R` and `Stan` ecosystems. Proficient in `C`/`C++` and `Rust`.\r\nHas published `Julia`, `Rust`, `R`, and `Python` packages in official repositories/registries.\r\n\r\nResearches, publishes and advises PhD candidates on topics about Bayesian Statistical Modeling and Machine Learning applied to Decision Making.\r\nPrincipal Investigator of [LabCidades - Smart City Research Lab at UNINOVE](https://github.com/LabCidades).\r\n\r\nCoauthor of [Julia Data Science book](https://juliadatascience.io/).\r\nLeads the development of education and training materials for Pumas users in Julia.\r\nMember of the [`Stan` Governing Body - SGB](https://mc-stan.org/about/).\r\nMember of the [`Turing.jl` Developer Team](https://turing.ml/dev/team/).\r\nCertified [RStudio Tidyverse Instructor](https://education.rstudio.com/trainers/people/storopoli+jose/)."
 },
 {
  "avatar": "https://pretalx.com/media/avatars/ajayshah_photograph_obc4S7K.jpg",
  "name": "Ajay Shah",
  "submissions": [
   "7JNQCM"
  ],
  "code": "SKRLCP",
  "biography": "Ajay Shah studied at IIT, Bombay and USC, Los Angeles. He has held positions at Centre for Monitoring Indian Economy (CMIE), Indira Gandhi Institute for Development Research (IGIDR), Department of Economic Affairs at the Ministry of Finance and National Institute for Public Finance and Policy (NIPFP). He is now part of xKDR Forum and Jindal Global University. His  research is at the intersection of economics, law and public administration. His second book, co-authored with Vijay Kelkar, \"In service of the republic: The art and science of economic policy\", featured in Bloomberg's global \"2020 Best Books on Business and Leadership\". His work can be accessed on his home page (http://www.mayin.org/ajayshah)."
 },
 {
  "avatar": null,
  "name": "Lars Loetgering",
  "submissions": [
   "YUYXMM"
  ],
  "code": "SKXKYP",
  "biography": null
 },
 {
  "avatar": null,
  "name": "Dave Kleinschmidt",
  "submissions": [
   "HFG3AW"
  ],
  "code": "SLNRF8",
  "biography": "Research scientist at Beacon Biosignals, recovering academic."
 },
 {
  "avatar": "https://pretalx.com/media/avatars/mikael-botan_JWR3mLC.jpg",
  "name": "Mikael Fremling",
  "submissions": [
   "KPXD3Y"
  ],
  "code": "SLYRRC",
  "biography": "My name is Mikael Fremling, and I am working as a postdoc in physics at Utrecht University, The Netherlands.\r\nI study the fascinating properties that develop when a material is prevented from exploring the whole three-dimensional world around us.\r\n\r\nIn my research, I routinely perform various types of numerical simulations. For a few years, the Julia language has been my go-to choice for numerics."
 },
 {
  "avatar": "https://pretalx.com/media/avatars/jjallaire_77dkvW9.jpeg",
  "name": "J.J. Allaire",
  "submissions": [
   "KKBXAZ"
  ],
  "code": "SRH9KJ",
  "biography": "J.J. Allaire is the founder of RStudio and the creator of the RStudio IDE. J.J. is an author of several packages in the R Markdown publishing ecosystem including rmarkdown, flexdashboard, learnr, and distill. J.J. is now the technical lead of the Quarto project, which aims to apply the lessons learned from 10 years of R Markdown to create a new system that is fundamentally multi-language and multi-engine."
 },
 {
  "avatar": null,
  "name": "Marina Cagliari",
  "submissions": [
   "879SWS",
   "PTFQER"
  ],
  "code": "SXHELN",
  "biography": "I am a PhD student who works in cosmology and the analysis of cosmological surveys."
 },
 {
  "avatar": null,
  "name": "Vikram Narayan",
  "submissions": [
   "BUFSJY"
  ],
  "code": "SXXNRP",
  "biography": null
 },
 {
  "avatar": null,
  "name": "Siddharth Bhatia",
  "submissions": [
   "GXTYSA"
  ],
  "code": "SYTUPE",
  "biography": "-"
 },
 {
  "avatar": "https://pretalx.com/media/avatars/e9c228b5-711a-4886-a471-299169b33498_Y1unR5A.JPG",
  "name": "Francesc Verdugo",
  "submissions": [
   "ZZ3HGF"
  ],
  "code": "TJKSVY",
  "biography": "Assistant Professor at the Computer Science Department at VU Amsterdam."
 },
 {
  "avatar": "https://pretalx.com/media/avatars/portrait_gTjUlyr.PNG",
  "name": "Kento Kawasaki",
  "submissions": [
   "VGEWU7"
  ],
  "code": "TX88YQ",
  "biography": "Researcher in natural language processing"
 },
 {
  "avatar": null,
  "name": "Owen Lynch",
  "submissions": [
   "DSB7E3"
  ],
  "code": "TY8PJL",
  "biography": "I'm a master's student at Utrecht University, studying probability and thermodynamics, and I also have been contributing to AlgebraicJulia for the last two years."
 },
 {
  "avatar": "https://pretalx.com/media/avatars/WhatsApp_Image_2022-01-31_at_10.04.41_HlDmmpo.jpeg",
  "name": "Letícia Madureira",
  "submissions": [
   "CJ3XLV"
  ],
  "code": "U3WPAA",
  "biography": "I'm Letícia Maria (she/her/hers), a final year Chemistry student in Brazil (@geem-lab). Currently, I work with projects involving the development of graphical interfaces, linear and polynomial algebra tools for quantum calculations of molecular electronic structure. I also implement tools for kinetic analysis of chemical reactions (@JuliaChemicalReactions). My main programming language is Julia, but I also program in Python, Rust and JavaScript (depends on the occasion and the project). I advocate free, open and clean code.\r\n\r\nIncoming PhD student at CMU in Fall 2022 (@gomesgroup)"
 },
 {
  "avatar": "https://pretalx.com/media/avatars/felix_wechsler_2020_fxlb1HS.JPG",
  "name": "Felix Wechsler",
  "submissions": [
   "YUYXMM",
   "X89FYS"
  ],
  "code": "U3YH9P",
  "biography": "[Felix Wechsler](https://felixwechsler.science/) is a PhD student at the Leibniz Institute of Photonic Technology and the Friedrich Schiller University of Jena. Before that, Felix obtained Bachelor degrees in physics and informatics where he worked on Light Field Microscopy and Schlieren Imaging.\r\nIn his master thesis, he developed a novel kaleidoscopic microscope, the Kaleidomicroscope.\r\nHis recent work is implemented in Julia Lang and he is maintainer of several microscopy related packages written in Julia Lang."
 },
 {
  "avatar": "https://pretalx.com/media/avatars/timotheepoisot_SaBMPrI.jpg",
  "name": "Timothée Poisot",
  "submissions": [
   "WWZCU3"
  ],
  "code": "U9NV8B",
  "biography": "Timothée Poisot is associate professor of quantitative & computational ecology at the department of biological sciences, Université de Montréal, and a researcher with the Québec Centre for Biodiversity Science and the Viral Emergence Research Initiative; his research focuses on the search for general laws in ecological systems, and on the development of novel quantitative methods for the analysis of complex adaptive ecological systems."
 },
 {
  "avatar": "https://pretalx.com/media/avatars/20998300_V5Lu2rn.jpeg",
  "name": "Carl Julius Martensen",
  "submissions": [
   "F3J8QM"
  ],
  "code": "UJ8U9C",
  "biography": "Julius is currently a PhD candidate at the Otto-von-Guericke University in Magdeburg and an Intern at Pumas-AI. His research evolves around data-driven system identification using scientific machine learning."
 },
 {
  "avatar": null,
  "name": "Jeffrey Sarnoff",
  "submissions": [
   "Y8G9VJ"
  ],
  "code": "UN78GE",
  "biography": "Julia Innovator, author of DoubleFloats.jl, NamedTupleTools.jl, SaferIntegers.jl, RollingFunctions.jl, and others."
 },
 {
  "avatar": "https://pretalx.com/media/avatars/P1030725_crop_lu9bK3e.JPG",
  "name": "Jeffrey Sun",
  "submissions": [
   "J7RCP7"
  ],
  "code": "UNFA9C",
  "biography": "I am a graduate student in economics at Princeton University. I am interested in dynamic heterogeneous-agent spatial models and reinforcement learning techniques to solve them."
 },
 {
  "avatar": "https://pretalx.com/media/avatars/New_Headshot_500x500_hAFxGkT.jpg",
  "name": "Logan Kilpatrick",
  "submissions": [
   "LZELWV",
   "TSQ8XC",
   "RJTJTX"
  ],
  "code": "UNR7XZ",
  "biography": "Logan is the developer community advocate for the Julia programming language and was formerly the community manager. He is also on the Board of Directors at NumFOCUS and DEFNA. Outside of the Julia community, Logan is a senior technology advocate at PathAI leading ML and OSS advocacy."
 },
 {
  "avatar": "https://pretalx.com/media/avatars/MAO_f2GqE8Y.JPG",
  "name": "Mikel",
  "submissions": [
   "VAZYBR"
  ],
  "code": "UNYAWF",
  "biography": "Bachelor of Computer Science (1992) and Doctorate (2017) at the UPV / EHU.  2011-2012, professor  in the Department of Computer Science and Artificial Intelligence.  Since 2017, professor of the School of Engineering of Gipuzkoa in the Department of Applied Mathematics.\r\nWithin the field of Computer Science, he has developed the following lines of research:  efficient implementation of numerical integration methods applied to the simulation of the solar system."
 },
 {
  "avatar": "https://pretalx.com/media/avatars/20180813_141024_cropped_2BWNFJe.jpg",
  "name": "Mark Kittisopikul, Ph.D.",
  "submissions": [
   "SE8MEL",
   "ZX9J89"
  ],
  "code": "USMVVE",
  "biography": "I am a Software Engineer II in Scientific Computing at the Janelia Research Campus of the Howard Hughes Medical Institute. My stated opinions are my own and not of my employer.\r\n\r\nI earned my PhD at UT Southwestern Medical Center studying Molecular Biophysics. I have done postdoctoral work in Cellular Biology.\r\n\r\nI enjoy cycling and being a parent."
 },
 {
  "avatar": "https://www.gravatar.com/avatar/4e319e702aeea7185ec608f0541053a5",
  "name": "Pete Vilter",
  "submissions": [
   "YHYSEM"
  ],
  "code": "UVGKBU",
  "biography": "Works at RelationalAI."
 },
 {
  "avatar": "https://www.gravatar.com/avatar/de0fed2df3cf9e9775df65c0f81b0342",
  "name": "ALBERTO FRANCISCO MARTIN HUERTAS",
  "submissions": [
   "ZZ3HGF"
  ],
  "code": "UX89E7",
  "biography": "https://research.monash.edu/en/persons/alberto-f-martin"
 },
 {
  "avatar": "https://pretalx.com/media/avatars/circle_ndxEx8H.jpg",
  "name": "Lilith Hafner",
  "submissions": [
   "VC9YHN"
  ],
  "code": "UYMQJS",
  "biography": "I live in Grinnell Iowa :)"
 },
 {
  "avatar": null,
  "name": "Guilherme Gomes Haetinger",
  "submissions": [
   "SQJTRS"
  ],
  "code": "V8B8TS",
  "biography": "I am a Computer Science MSc. student at the *Universidade Federal do Rio Grande do Sul*. My interests hop around the fields of Operating Systems, Algorithm Design, Computer Graphics and Image Processing. Currently, I am working as a Back End Development intern at DeepX , using Elixir and Rust. I've been using Julia for a couple of years in order to get fast image processing results with easy-on-the-eyes code. I'm currently working at Julia Computing developing visualizations to help ML workflows."
 },
 {
  "avatar": null,
  "name": "Jarrett Revels",
  "submissions": [
   "PWSDHS"
  ],
  "code": "VAVNMG",
  "biography": null
 },
 {
  "avatar": "https://pretalx.com/media/avatars/me_plane_tCR0a32.jpg",
  "name": "Albert R. Gnadt",
  "submissions": [
   "8GLBMW"
  ],
  "code": "VAWVFX",
  "biography": "Albert recently received his PhD from MIT AeroAstro and is now a postdoc in the Julia Lab within MIT CSAIL. His research is focused on improving airborne magnetic anomaly navigation using machine learning-based aeromagnetic compensation approaches (and the Julia programming language). Albert received his B.S. degree in mechanical engineering from UW–Madison in 2015 and S.M. degree in aeronautics and astronautics from MIT in 2018. Albert previously worked on electric aircraft design as an NSF graduate research fellow, and he earned his private pilot license in 2020."
 },
 {
  "avatar": null,
  "name": "Kylash Viswanathan",
  "submissions": [
   "UL3T8K"
  ],
  "code": "VEZ8Q3",
  "biography": "PhD Candidate UIC (Department of Mathematics, Statistics and Computer Science)"
 },
 {
  "avatar": "https://pretalx.com/media/avatars/EricFordPortrait_2_Z5AeJPs.jpg",
  "name": "Eric B. Ford",
  "submissions": [
   "DFA3RD",
   "BLBKZM"
  ],
  "code": "VFFPB7",
  "biography": "<a href=\"https://personal.psu.edu/~ebf11\">Eric Ford</a> is a Professor of <a href=\"http://astro.psu.edu/\">Astronomy & Astrophysics</a> at the Pennsylvania State University, where he is active in its <a href=\"https://www.icds.psu.edu/\">Institute for Computational & Data Sciences</a>, <a href=\"https://astrostatistics.psu.edu/\">Center for Astrostatistics</a>, and <a href=\"https://exoplanets.psu.edu/\">Center for Exoplanets & Habitable Worlds</a>.  Ford’s research focuses on detecting and characterizing planetary systems around other stars.  This often involves using Julia to apply modern Bayesian methods to improve the interpretation of exoplanet observations.  Ford has taught a graduate-level class on <a href=\"https://psuastro528.github.io/\">High-Performance Computing for Astrophysics</a> using Julia since 2014."
 },
 {
  "avatar": null,
  "name": "Srinivas Kowta",
  "submissions": [
   "PJNABU"
  ],
  "code": "VH9WW7",
  "biography": "A data and analytics professional with 20+ years experience in marketing research & analytics, public opinion research, healthcare & pharmaceuticals, epidemiology and bioinformatics. Began my career where SAS, SPSS, and STATA were the primary tools of use and now it is R, Python, and Julia in an applied setting."
 },
 {
  "avatar": null,
  "name": "Dilum Aluthge",
  "submissions": [
   "YED3MP"
  ],
  "code": "VMSPPS",
  "biography": null
 },
 {
  "avatar": null,
  "name": "Francis Smart",
  "submissions": [
   "AEXDKT"
  ],
  "code": "VPQZRP",
  "biography": "Data Scientist at Censeo Consulting currently supporting GSA."
 },
 {
  "avatar": null,
  "name": "Roger Luo",
  "submissions": [
   "VME3D8"
  ],
  "code": "VRCN8Y",
  "biography": "https://rogerluo.dev"
 },
 {
  "avatar": null,
  "name": "Christian Kames",
  "submissions": [
   "PP7RDH"
  ],
  "code": "VTBDXE",
  "biography": "PhD student in Physics at the University of British Columbia working on quantitative magnetic resonance imaging."
 },
 {
  "avatar": "https://pretalx.com/media/avatars/Chris-Hill_aVVbozz.jpg",
  "name": "Chris Hill",
  "submissions": [
   "VAHYFE",
   "UNVUDM"
  ],
  "code": "W7TEDS",
  "biography": "Chris Hill is a computational scientist at MIT who has developed ocean and planetary models and modeling tools that are used by thousands of researchers yearly. He has been working with members of the Julia community from its earliest days."
 },
 {
  "avatar": null,
  "name": "François Pacaud",
  "submissions": [
   "8QUDVW"
  ],
  "code": "WC3WU3",
  "biography": "Postdoc at Argonne National Labt"
 },
 {
  "avatar": "https://pretalx.com/media/avatars/prof_pic_OJq7aI1.jpg",
  "name": "Ifihanagbara Olusheye",
  "submissions": [
   "8SWDQG"
  ],
  "code": "WCU3QG",
  "biography": "Ifihan is a Python/Julia developer and Technical Writer. She has a passion for communities and new technologies."
 },
 {
  "avatar": null,
  "name": "Jeremy Howard",
  "submissions": [
   "78XMRJ"
  ],
  "code": "WDGYZC",
  "biography": null
 },
 {
  "avatar": "https://pretalx.com/media/avatars/me_Rj9VSui.jpg",
  "name": "Andre Macleod",
  "submissions": [
   "BEY33E"
  ],
  "code": "WEFNJW",
  "biography": "My name is Andre Macleod, 25, born in Sweden, raised in Italy, moved to New Zealand as I am half-kiwi. Passionate in mathematics, I recently completed a Masters degree in Applied Data Science, and have been working on various data science projects, including some in Julia, which I would be excited to share at JuliaCon if given the chance."
 },
 {
  "avatar": null,
  "name": "Helmut Hänsel",
  "submissions": [
   "BH8WSR"
  ],
  "code": "WHHKUJ",
  "biography": null
 },
 {
  "avatar": "https://pretalx.com/media/avatars/5A9602A8-CC9A-4406-B16E-18B7C2D4BAA2_1_102_o_8FWBW7y.jpeg",
  "name": "Alexander Jaffray",
  "submissions": [
   "DHKACY"
  ],
  "code": "WMXJTT",
  "biography": "I'm a PhD student in Physics at the University of British Columbia, and my work focuses on the development and application of novel image reconstruction techniques in the context of quantitative MRI. \r\n\r\nQuantitative imaging makes me happy, quantifiable recon makes me happier."
 },
 {
  "avatar": "https://pretalx.com/media/avatars/150x_profile_9kszQze.png",
  "name": "Jacob Zelko",
  "submissions": [
   "CPS73H"
  ],
  "code": "WNALCB",
  "biography": "I am a graduate of Georgia Institute of Technology with a BS in biomedical engineering. I currently work at Georgia Tech Research Institute in the Health Emerging and Advanced Technologies division (HEAT-D) as a Health Data Analytics and Informatics Researcher as well as being a Contractor for the Centers for Disease Control."
 },
 {
  "avatar": "https://www.gravatar.com/avatar/aea039a9639833a76a24f7bfde0e1250",
  "name": "Philip Fackler",
  "submissions": [
   "CJZ3MV"
  ],
  "code": "WQAWRU",
  "biography": "Research Software Engineer at Oak Ridge National Laboratory"
 },
 {
  "avatar": "https://pretalx.com/media/avatars/ChristopherRackauckas101_Rl0yCrY.jpg",
  "name": "Chris Rackauckas",
  "submissions": [
   "VVTKRB",
   "RUQAHC"
  ],
  "code": "WUWQQ3",
  "biography": "Research Affiliate and Co-PI of the Julia Lab at the Massachusetts Institute of Technology\r\nDirector of Modeling and Simulation at Julia Computing and Creator / Lead Developer of JuliaSim\r\nDirector of Scientific Research at Pumas-AI and Creator / Lead Developer of Pumas\r\nLead Developer of the SciML Open Source Software Organization\r\n\r\nChris Rackauckas\r\n\r\nChris' research and software is focused on Scientific Machine Learning (SciML): the integration of domain models with artificial intelligence techniques like machine learning. By utilizing the structured scientific (differential equation) models together with the unstructured data-driven models of machine learning, our simulators can be accelerated, our science can better approximate the true systems, all while enjoying the robustness and explainability of mechanistic dynamical models.\r\n\r\nChris's recent work is focused on bringing personalized medicine to standard medical practice through the proliferation of software for scientific AI. Chris is at the cutting edge of mathematical methods for scientific simulation. He is the lead developer of the DifferentialEquations.jl solver suite along with over a hundred other Julia packages, earning him the inaugural Julia Community Prize, an outstanding paper award at the IEEE-HPEC conference on computational derivation for the efficient stochastic differential equation solvers, and front page features on many tech community sites. Chris' work on high performance differential equation solving is the engine accelerating many applications from the MIT-CalTech CLiMA climate modeling initiative to the SIAM Dynamical Systems award winning DynamicalSystems.jl toolbox (of which DifferentialEquations.jl was the runner-up). His work is credited for the 15,000x acceleration of NASA Launch Services simulations and recently demonstrated a 60x-570x acceleration over Modelica tools. For these achievements Chris received the United States Department of the Air Force Artificial Intelligence Accelerator Scientific Excellence Award.\r\n\r\nChris brought these enhanced numerical approaches to the domain of pharmaceutical modeling and simulation as the creator and lead developer of Pumas. Pumas is scientific AI in clinical practice. Pumas makes it possible to predict the optimal medication dosage for individuals, reducing the costs and potential complications associated with treatments. Pumas is being used by many major pharmasceuticals to predict personalized safe dosage regimens by incorporating realistic biological models (quantitative systems pharmacology) and deep learning into the traditional nonlinear mixed effects (NLME) modeling framework. These efforts on Pumas led to the International Society of Pharmacology's (ISoP) Mathematical and Computational Special Interest Group Award at the American Conference of Pharmacology (ACoP) 2019 for his work on improved clinical dosing via Koopman Expectations, along with the ACoP 2020 Quality Award for his work with Pfizer on GPU-accelerated quantitative systems pharmacology to accelerate preclinical analysis by 175x. Notably, Moderna adopted Pumas in 2020 to accelerate crucial clinical trials, noting \"Pumas has emerged as our 'go-to' tool for most of our analyses in recent months\". For these achievements, Chris received the Emerging Scientist award from ISoP, the highest early career award in pharmacometrics.\r\n\r\nChris started this work while completing his Masters and Ph.D. at the University of California, Irvine where he was awarded the Mathematical and Computational Biology institutional fellowship, the Graduate Dean's Fellowship, the National Science Foundation's Graduate Research Fellowship, the Ford Predoctural Fellowship, the NIH T32 Predoctural Training Grant, the Center for Complex Biological Systesms Opportunity Award, and the Data Science Initiative Summer Fellowship. His research with his advisor, Dr. Qing Nie, focused on the methods for simulating stochastic biological models and detailing how the randomness inherent in biological organisms can be controlled using stochastic analysis. Chris bridged the gap between theory and practice by having a \"wet lab bench\" in Dr. Thomas Schilling's lab, where these methodologies were tested on zebrafish. Fluorescence Light Microscopy (FLIM) measurements of retinoic acid in the zebrafish hindbrain showed that the predicted control proteins could attenuate inherent biological randomness. The result was a verified mathematical theory for controlling the randomness in biological signaling. Chris received the Kovalevsky Outstanding Ph.D. Thesis Award from the Department of Mathematics upon graduation and was showcased in an interview \"Interdisciplinary Case Study: How Mathematicians and Biologists Found Order in Cellular Noise\" in Cell Press's iScience.\r\n\r\nAs an undergraduate at Oberlin College, Chris was awarded the NSF S-STEM scholarship and the Margaret C. Etter Student Lecturer Award by the American Crystallographic Association, an award usually given for PhD dissertations, for his work on 3+1 dimensional incommensurate crystal structure identification of H-acid. This award was given for Service Crystallography for its potential impact on industrial dye manufacturing."
 },
 {
  "avatar": "https://pretalx.com/media/avatars/ranocha_2019_10b__520_quadratic_s4EhQU2.jpg",
  "name": "Hendrik Ranocha",
  "submissions": [
   "LUWYRJ"
  ],
  "code": "WYXDAB",
  "biography": "I am interested in numerical analysis and scientific computing with applications in science and engineering. In particular, I like to analyze and develop numerical methods for differential equations, focusing on stability, mimetic properties, structure preservation, and efficiency. I started with the common mix of C, C++, Fortran, Python, Matlab, Mathematica etc. Nowadays, I am using Julia nearly exclusively for my work. Currently, I am an Assistant Professor in Applied Mathematics at the University of Hamburg. If you want to know more about me, please visit [my website](https://ranocha.de/)."
 },
 {
  "avatar": "https://pretalx.com/media/avatars/Crop2AV_yup8Y1H.JPG",
  "name": "Bishmer Sekaran",
  "submissions": [
   "TUG9FF"
  ],
  "code": "X3PWGN",
  "biography": "Bishmer Sekaran is a Machine Learning Engineer based in Singapore. \r\n\r\nFor Juliacon 2021, he presented the Experience \"Awesome Computer Vision Done Quick\""
 },
 {
  "avatar": null,
  "name": "Joshua Forrest",
  "submissions": [
   "MMKEQP"
  ],
  "code": "XDTBBN",
  "biography": "I am a PhD student in mathematical biology at the University of Melbourne. My research is in energy-based models of bacteria for the purposes of whole-cell modelling.\r\n\r\nI have previously worked as a data analyst and software engineer at an engineering consultancy firm. I work primarily in mathematical modelling and dynamical systems, but I am also interested in graph theory, optimization, data science, machine learning, statistics, and computation."
 },
 {
  "avatar": "https://pretalx.com/media/avatars/profile.jpg_ZEYa5Tf.jpg",
  "name": "Alessio Quaresima",
  "submissions": [
   "V7CCYF"
  ],
  "code": "XHDSBZ",
  "biography": "Ph.D. in Cognitive Computational Neuroscience at the Max Planck Institute for Psycholinguistics.\r\n\r\nInterested in dendrites, spikes, and sequences."
 },
 {
  "avatar": null,
  "name": "Christopher Kim",
  "submissions": [
   "UTTHUM"
  ],
  "code": "XKYPBW",
  "biography": null
 },
 {
  "avatar": "https://pretalx.com/media/avatars/postdoc_LG5snTG.jpg",
  "name": "Kyungdahm Yun",
  "submissions": [
   "ET78DS"
  ],
  "code": "XNUQVQ",
  "biography": "Postdoctoral scholar at the University of Washington in Seattle."
 },
 {
  "avatar": null,
  "name": "Argel Ramírez Reyes",
  "submissions": [
   "7M3BKA"
  ],
  "code": "XPJBKD",
  "biography": null
 },
 {
  "avatar": null,
  "name": "Simeon",
  "submissions": [
   "WTPZLZ",
   "KMHPFT"
  ],
  "code": "XRD9WL",
  "biography": "I am currently a master's student in Computational Science and Engineering at the MIT Julia Lab. I have been a Julia user since 2018 and am one of the maintainers of the Julia language. Among other parts of the language, I work on Julia's front end and contribute to packages such as Cthulhu.jl, JuliaInterpreter.jl, and ArtifactUtils.jl."
 },
 {
  "avatar": "https://pretalx.com/media/avatars/biopic_YfsagVN.jpg",
  "name": "Bradley Carman",
  "submissions": [
   "DRLYT8"
  ],
  "code": "XYB7RA",
  "biography": "Brad Carman is a Mechanical Engineer at Instron specializing in System Modeling and Thermal Fluids with focus on model and software development for the Crash Simulation and Structural Durability products."
 },
 {
  "avatar": null,
  "name": "Graham Stark",
  "submissions": [
   "KPRZAM"
  ],
  "code": "Y3TKNE",
  "biography": "Graham teaches economics at the Open University, UK and runs Virtual Worlds Research (http://virtual-worlds.scot) where he builds microsimulation economic models. Previously he worked for 20 years at the Institute for Fiscal Studies (www.ifs.org.uk). He lives in Glasgow, Scotland."
 },
 {
  "avatar": "https://pretalx.com/media/avatars/26233299_1989868764374810_9003691900656884808_o_1_Jhptxwf.jpg",
  "name": "José Pereira",
  "submissions": [
   "XRQRK3"
  ],
  "code": "YK78JV",
  "biography": "José M. S. Pereira is a Biochemistry PhD student at CICECO-University of Aveiro Institute of Materials since 2018. He finished his Master’s on Biotechnology in the University of Aveiro, where the focus of his thesis was on the subject of bioremediation of waste water sources by filtration with activated bio-carbons. As a product of his Master’s thesis, José Pereira developed http://carbgen.web.ua.pt/, a peer-reviewed online tool for the design of atomic carbon models. Starting his PhD, José Pereira shifted his focus for the computational design of peptides, while continuing to pursue scientific software development. He participated in the Board of European Students of Technology 2017 Winter Course, in Paris, France, was awarded a Fulbright scholarship for a 4-month student exchange at Rutgers University, New Jersey, USA, and won the TOP3 award at European Innovation Academy 2021 for his work on ProtoSyn (https://github.com/sergio-santos-group/ProtoSyn.jl), the developed software on the scope of his PhD thesis. He authored 2 peer-reviewed papers and participated in over 20 conferences."
 },
 {
  "avatar": "https://www.gravatar.com/avatar/1311bb150d2c7a24d22ded286b2e7d51",
  "name": "Gillot",
  "submissions": [
   "F9XUTK"
  ],
  "code": "YMLF99",
  "biography": "Frédéric Gillot is Assistant Professor at École Centrale de Lyon within the Department of Solid Mechanics, Mechanical Engineering and Civil Engineering. He carries out his research at the Tribology and System Dynamics Laboratory (LTDS), a French CNRS joint research unit (no. 5513). He graduated in Engineering from École nationale supérieure des arts et métiers (ENSAM) and the University of Wien, Austria. An alumnus of École normale supérieure, he holds an agrégation in Mechanical Engineering, a research master and a PhD from École Centrale de Nantes and the University of Nantes. He pursued post-doctoral research for two years at the University of Tokyo (Todai) with funding from the Japan Society for the Promotion of Science. His current research interests address parametric shape optimisation, multi-objective optimisation and robust optimisation."
 },
 {
  "avatar": "https://pretalx.com/media/avatars/avatar_XFyu5UR.jpg",
  "name": "Jayesh K. Gupta",
  "submissions": [
   "HBERVN"
  ],
  "code": "YMPKPW",
  "biography": "I am a Researcher at Microsoft Autonomous Systems where I work on improving simulations with data-driven methods."
 },
 {
  "avatar": "https://pretalx.com/media/avatars/profile_TKEFS6B.jpg",
  "name": "Joshua Pulsipher",
  "submissions": [
   "LEG8TJ"
  ],
  "code": "YNHAFQ",
  "biography": "I am postdoc at Carnegie Mellon University specializing in infinite-dimensional optimization techniques."
 },
 {
  "avatar": null,
  "name": "Gianluca Ascolani",
  "submissions": [
   "W7QJJF"
  ],
  "code": "YRUBPT",
  "biography": "Research Associate at the Department of Informatics, Systems and Communications, University of Milano-Bicocca, Italy"
 },
 {
  "avatar": "https://pretalx.com/media/avatars/Kishore_nawYBla.jpeg",
  "name": "Kishore Hari",
  "submissions": [
   "CY7YFB"
  ],
  "code": "YTRPT3",
  "biography": "I am a grad student at the Indian Institute of Science, Bangalore. I work with Prof. Mohit Kumar Jolly, toward unraveling design principles in network topologies underlying cell-fate decision networks, especially in the context of cancer metastasis."
 },
 {
  "avatar": null,
  "name": "Agustín Covarrubias",
  "submissions": [
   "7M3BKA"
  ],
  "code": "YUDY7W",
  "biography": null
 },
 {
  "avatar": "https://pretalx.com/media/avatars/progile_6T2U3bg.jpeg",
  "name": "Frederic Wantiez",
  "submissions": [
   "3CSEAN"
  ],
  "code": "YYLHDR",
  "biography": "Hi ! I'm a financial engineer based in London. I've been working on Turing.ml and AdvancedPS.jl to improve some of the simulation based sampling algorithms"
 },
 {
  "avatar": "https://pretalx.com/media/avatars/9IJfQV41SZK-etvkFNEPpQ_1_Ou0YjXT.jpeg",
  "name": "Harsha Nagarajan",
  "submissions": [
   "KJTGC3"
  ],
  "code": "YZAWN9",
  "biography": "Harsha Nagarajan is currently a staff scientist in the “Applied Mathematics and Plasma Physics” group at Los Alamos National Laboratory (LANL). His research interests include development of efficient formulations and algorithms for modeling, design and control of complex physical systems."
 },
 {
  "avatar": "https://www.gravatar.com/avatar/58aff0915b3c382c16324fd8ba7d4b65",
  "name": "Ryan",
  "submissions": [
   "E99KP7"
  ],
  "code": "Z7EL3T",
  "biography": "Ph.D. student in Materials Science at Columbia University in the City of New York"
 },
 {
  "avatar": "https://pretalx.com/media/avatars/boyd_clean_g6lRSkq.jpg",
  "name": "Sorratat Sirirattanajakarin",
  "submissions": [
   "PACVJK"
  ],
  "code": "Z7MLWB",
  "biography": "Data Scientist who love in learning and sharing knowledge"
 },
 {
  "avatar": "https://pretalx.com/media/avatars/avatar_QXMWszG.png",
  "name": "Michael Schlottke-Lakemper",
  "submissions": [
   "LUWYRJ",
   "QVESXM"
  ],
  "code": "ZBB3MC",
  "biography": "Michael is a group leader and research software engineer at the High-Performance Computing Center Stuttgart of the University of Stuttgart, Germany. His research focus is on numerical methods for adaptive multi-physics simulations, high-performance computing with Julia, and scientific machine learning."
 },
 {
  "avatar": "https://pretalx.com/media/avatars/IMG_20190704_2245043_Tya5pY8.jpg",
  "name": "Chris Coey",
  "submissions": [
   "Y8BCSL"
  ],
  "code": "ZBXW73",
  "biography": "MIT PhD student graduating May 2022, starting postdoc at MIT Sloan."
 },
 {
  "avatar": "https://pretalx.com/media/avatars/Screenshot_from_2022-04-11_19-17-55_IEK4kUM.png",
  "name": "Luca Reale",
  "submissions": [
   "AYAUPK"
  ],
  "code": "ZEM3A7",
  "biography": "Currently a student in mathematics at the University of Canterbury in Christchurch New Zealand"
 },
 {
  "avatar": null,
  "name": "Qi Huangfu",
  "submissions": [
   "XRDNVT"
  ],
  "code": "ZF7V93",
  "biography": "Qi Huangfu is the developer of COPT and has worked on many different optimization solvers, including HiGHS and FICO-Xpress."
 },
 {
  "avatar": "https://pretalx.com/media/avatars/1646820114032_LXFWTCq.jpeg",
  "name": "Matteo Manzi",
  "submissions": [
   "7Q8WXA"
  ],
  "code": "ZG9LNM",
  "biography": "Matteo is an aerospace engineer with a strong interest in dynamical systems theory and complex systems theory. After conducting research in the Horizon2020 network Stardust Reloaded, working on the use of Artificial Intelligence for Uncertainty Quantification in Orbital Mechanics, and working as a Flight Dynamics Software Engineer for the Space Debris Office of the European Space Agency, he is currently the CEO of MOD SRLS, a company focused on quantitative DeFi, stochastic modelling and uncertainty quantification in space engineering, but also on the interplay between Artificial Intelligence and Blockchain technology for the development of research protocols promoting transparency and reproducibility of software and methodologies, including academic publishing, in the context of DeSci."
 },
 {
  "avatar": null,
  "name": "Max Kapur",
  "submissions": [
   "GAGZYJ"
  ],
  "code": "ZJHGRZ",
  "biography": "I am a master's student in the department of Industrial Engineering at Seoul National University."
 },
 {
  "avatar": null,
  "name": "Max Hawkins",
  "submissions": [
   "AAJJGP"
  ],
  "code": "ZK9JBM",
  "biography": "Max is an undergraduate Computer Engineering student at the University of Alabama interested in helping scientists easily and effectively utilize their computing hardware."
 },
 {
  "avatar": null,
  "name": "Léo Baty",
  "submissions": [
   "P7XJCV"
  ],
  "code": "ZME37L",
  "biography": null
 },
 {
  "avatar": null,
  "name": "Truls Flatberg",
  "submissions": [
   "RDLDYD"
  ],
  "code": "ZSV3QP",
  "biography": "Truls Flatberg is a researcher at the research institute SINTEF. With a background from applied mathematics and informatics, he develops decision support tools for industrial problems based on optimization models."
 },
 {
  "avatar": null,
  "name": "Ludovic Räss",
  "submissions": [
   "YPGNCS",
   "7FVVF3",
   "AKVUKM",
   "RJYBLA"
  ],
  "code": "ZTATFJ",
  "biography": "Geoscientist with strong interests in Julia, HPC, GPUs, and supercomputing. Applications to resolve multi-physics processes in ice dynamics and geodynamics across scales."
 },
 {
  "avatar": "https://pretalx.com/media/avatars/selfie_8dJ7WYq.jpeg",
  "name": "Tom Kwong",
  "submissions": [
   "RTBE9E"
  ],
  "code": "ZVXXQA",
  "biography": "Tom Kwong currently works at Meta. He is an experienced software engineer with almost 30 years of industry programming experience. In 2017, he discovered the Julia language and started working on several open-source projects such as SASLib.jl, BinaryTraits.jl and ContextTracking.jl. He has an MS Computer Science degree from University of California, Santa Barbara."
 },
 {
  "avatar": null,
  "name": "Niklas Schmitz",
  "submissions": [
   "LGWRV8"
  ],
  "code": "ZZGUKJ",
  "biography": "Computer science student in the ML group at TU Berlin. Interested in physics, differentiable programming,  abstractions and programming languages."
 }
]
