[
 {
  "avatar": "https://pretalx.com/media/avatars/Screenshot_2022-11-16_at_2.29.54_PM_MUpBvrA.png",
  "name": "Ahmed Elmokadem",
  "submissions": [
   "YD7DUP",
   "PHRQZ9"
  ],
  "code": "37GNZY",
  "biography": "Ahmed earned his PhD in Biomedical Sciences from the University of Connecticut developing Bayesian statistical algorithms to solve issues with super-resolution imaging. He joined the Translational and Systems Pharmacology group at Metrum Research Group in 2017 and has been conducting a variety of modeling and simulation analyses including quantitative systems pharmacology (QSP), Physiologically Based Pharmacokinetic (PBPK), population pharmacokinetic/pharmacodynamic (PKPD) modeling, and Bayesian PKPD modeling."
 },
 {
  "avatar": "",
  "name": "Joseph Tindall",
  "submissions": [
   "AXHNYJ"
  ],
  "code": "37SZKY",
  "biography": null
 },
 {
  "avatar": "",
  "name": "Flemming Holtorf",
  "submissions": [
   "MX7J3F",
   "HZV83P"
  ],
  "code": "39MLZ3",
  "biography": "I am a PhD student working with the JuliaLab at MIT. I am interested in anything related to decision-making under uncertainty where I work primarily on methods and software for uncertainty quantification and optimization and control of uncertain systems."
 },
 {
  "avatar": "",
  "name": "Valentin Churavy",
  "submissions": [
   "NKVYHZ",
   "RTCDVR"
  ],
  "code": "3C7UBC",
  "biography": "PhD student at the MIT JuliaLab"
 },
 {
  "avatar": "https://pretalx.com/media/avatars/1574f8d9fd9ac9c89c23dd6b4817a045_ZekRKje.jpg",
  "name": "Phillip Alday",
  "submissions": [
   "UKSPXU"
  ],
  "code": "3EFERC",
  "biography": "Phillip is a neuroscientist and contributor to the MixedModels.jl ecosystem."
 },
 {
  "avatar": "https://pretalx.com/media/avatars/ppp_gzilMNs.jpeg",
  "name": "Paulito Palmes",
  "submissions": [
   "UXE8SJ"
  ],
  "code": "3EKCYY",
  "biography": "I am a research scientist at the IBM Research Europe (Dublin Research Lab) working in the areas of analytics, datamining, machine learning, reinforcement learning, automated decisions, and AI.\r\n\r\nI created and maintain the following Julia packages:\r\n- AutoMLPipeline (Automated Machine Learning Pipeline): https://github.com/IBM/AutoMLPipeline.jl\r\n- TSML (Time Series Machine Learning): https://github.com/IBM/TSML.jl\r\n- Julia wrapper for Lale in Python: https://github.com/IBM/Lale.jl\r\n- Github repos: https://github.com/ppalmes"
 },
 {
  "avatar": "",
  "name": "Nina Schmid",
  "submissions": [
   "9GLADM"
  ],
  "code": "3KEKGA",
  "biography": "PhD student in applied mathematics and computational biology @ University of Bonn, Germany. Nina's main research interest lies in scientific machine learning to describe dynamical processes in systems biology."
 },
 {
  "avatar": "https://pretalx.com/media/avatars/IMG_3204_square_2ZRf7Vt.jpg",
  "name": "Adrian Salceanu",
  "submissions": [
   "JJ3ZBP",
   "E98J3J"
  ],
  "code": "3MGMJN",
  "biography": "Adrian Salceanu is the creator and lead maintainer of Genie Framework. An enthusiastic Julia open source contributor and public speaker, Adrian is the author of \"Julia Programming Projects\" (Packt, 2018) and \"Web Development with Julia and Genie\" (Packt, 2022). \r\n\r\nAdrian has over two decades of professional work experience as a web developer and software architect, leading agile teams in developing, scaling, and maintaining business critical, data-intensive web applications. He has Masters degrees in Advanced Computer Science and Computing."
 },
 {
  "avatar": "https://pretalx.com/media/avatars/2019-9_LinkedIn_PIc_-_Copy_n42qeIV.jpg",
  "name": "David Cole",
  "submissions": [
   "JQWEQE"
  ],
  "code": "3TAQSM",
  "biography": "I am a 3rd year PhD candidate at the Unviersity of Wisconsin-Madison in chemical and biological engineering working under Professor Victor Zavala. My research interests include graph-based representations and optimization, energy systems, and process systems engineering."
 },
 {
  "avatar": "",
  "name": "Ashley Milsted",
  "submissions": [
   "UZE9HU"
  ],
  "code": "3YJFUN",
  "biography": null
 },
 {
  "avatar": "https://pretalx.com/media/avatars/DSC_1283_Kun_TaaOszD.jpg",
  "name": "Kun Chen",
  "submissions": [
   "YQVCML"
  ],
  "code": "77SAJ8",
  "biography": "Kun Chen is a research fellow at the Center for Computational Quantum Physics (CCQ) at the Flatiron Institute. He leads a team that develops Julia packages under the Numerical Effective Field Theory (NEFT) framework (https://github.com/numericalEFT) for modeling real-world quantum materials using modern quantum field theory. These efforts have resulted in powerful tools such as MCIntegration.jl for high-dimensional Monte Carlo integration, Lehmann.jl for low-rank approximation of Green's function, and GreenFunc.jl for studying quantum many-body physics. With a PhD in 2018 from the University of Massachusetts Amherst, Kun is a Simons Postdoctoral Fellow at Rutgers University and later a research fellow at Flatiron Institute. His work in this area will enable scientists and researchers to gain a deeper understanding of quantum materials and their properties."
 },
 {
  "avatar": "https://pretalx.com/media/avatars/7ba563ff380e74b83d3ef8d960529a94_Jf2bPPK.jpg",
  "name": "Miles Cranmer",
  "submissions": [
   "FGZBBB"
  ],
  "code": "788PDG",
  "biography": "Miles Cranmer is an Assistant Professor in Data Intensive Science at the University of Cambridge. He received his PhD in Astrophysics from Princeton University and his BSc in Physics from McGill University.\r\n\r\nMiles is interested in the automation of scientific research with machine learning. His current focus is the development of interpretable machine learning methods, especially symbolic regression, as well as applying them to multi-scale dynamical systems."
 },
 {
  "avatar": "https://pretalx.com/media/avatars/IMG_2404small_YTUhbIK.jpeg",
  "name": "Sam Miller",
  "submissions": [
   "NJCTVF"
  ],
  "code": "7GGQT7",
  "biography": "Computational Physicist at the Laboratory for Laser Energetics at the University of Rochester, NY"
 },
 {
  "avatar": "",
  "name": "Luis Eduardo Ramírez Montoya",
  "submissions": [
   "B8FHNU"
  ],
  "code": "7WPHRX",
  "biography": null
 },
 {
  "avatar": "https://pretalx.com/media/avatars/IMG_2500_-_quadrada_jZ2XRIY.jpg",
  "name": "Ronan Arraes Jardim Chagas",
  "submissions": [
   "AWQCSX"
  ],
  "code": "8AFQPZ",
  "biography": "Since 2013, Ronan Arraes Jardim Chagas has been with the Space Systems Division of the Instituto Nacional de Pesquisas Espaciais (INPE). As his most significant accomplishment, he was the Mission Architect and the responsible technician of the attitude and orbit control subsystem (AOCS) of the Brazilian Satellite Amazonia-1, successfully launched in February 2021.\r\n\r\nHe has been working with Control Systems and Signal Processing for 14 years. During this time, he was involved in many projects related to those areas. He successfully embedded Kalman filters (Extended and Unscented) in many autonomous systems and developed state-of-art signal processing algorithms to perform estimation in distributed sensor networks.\r\n\r\nHe conducts several research projects at INPE. Those projects include artificial intelligence and advanced control techniques applied to the AOCS, space mission design optimization, advanced signal processing, and orbit analysis.\r\n\r\nHe is also a Julia language enthusiast. He has used it daily since 2013 to perform many activities related to his work. As his most significant project with this language, he developed a complete AOCS simulator to test and verify this subsystem. The simulation achieved outstanding performance and accuracy, given the orbital data collected from the satellite Amazonia-1.\r\n\r\nHe is the creator and maintainer of some important packages of the Julia language ecosystem: ReferenceFrameRotations.jl, SatelliteToolbox.jl, PrettyTables.jl, and others."
 },
 {
  "avatar": "https://pretalx.com/media/avatars/IMG_2045_Large_2_GtQdYin.jpeg",
  "name": "Shuhei Kadowaki",
  "submissions": [
   "EM7FDX"
  ],
  "code": "8BZR7G",
  "biography": "A software engineer at JuliaHub. Working on Julia compiler and its development tools."
 },
 {
  "avatar": "https://pretalx.com/media/avatars/avatar_K2fis16.jpeg",
  "name": "Patrick Altmeyer",
  "submissions": [
   "JQWNNP"
  ],
  "code": "8DGYCX",
  "biography": "I’m a PhD Candidate in Trustworthy Artificial Intelligence at Delft University of Technology working on the intersection of Computer Science and Finance. My current research revolves around Counterfactual Explanations and Probabilistic Machine Learning. Previously, I worked as an Economist for the Bank of England.\r\n\r\nI started working with Julia at the beginning of PhD in late 2021 and have since developed and used various packages for my own research, some of which I presented at JuliaCon 2022. To organise these efforts, I have recently created [Taija](https://github.com/JuliaTrustworthyAI): a GitHub organisation that hosts software geared towards Trustworthy Artificial Intelligence in Julia. Go check it out and should you be interested in collaborating, feel free to reach out. Actually, feel free to do that in any case!"
 },
 {
  "avatar": "",
  "name": "Yue Sun",
  "submissions": [
   "DT3B7Z"
  ],
  "code": "8DJACU",
  "biography": "Staff Scientist at NCI. PhD of Physics at ANU."
 },
 {
  "avatar": "https://pretalx.com/media/avatars/3957c94a3ddbbc2cb7f21b34c2b21e7d_qznyaAE.jpg",
  "name": "Haina Wang",
  "submissions": [
   "ELHUTR"
  ],
  "code": "8DNHYV",
  "biography": "Haina Wang is a graduate student in chemistry at Princeton University. She had her bachelors in chemistry and math at National University of Singapore. Her research focuses on designing intermolecular forces to achieve desired structural and mechanical properties of soft-matter materials."
 },
 {
  "avatar": "https://pretalx.com/media/avatars/Screenshot_2023-07-05_at_3.05.04_PM_FPPOT0z.png",
  "name": "Elisabeth Roesch",
  "submissions": [
   "PRLSQN"
  ],
  "code": "8L8EM3",
  "biography": "At JuliaHub, Dr. Roesch shares her knowledge of the impact of Julia and JuliaHub products on Quantitative Systems Pharmacology. She earned her PhD in Theoretical Systems Biology from the University of Melbourne, Australia. She has researched and published about the use of the Julia programming language in Systems Biology."
 },
 {
  "avatar": "",
  "name": "Branwen Snelling",
  "submissions": [
   "UTJDAF"
  ],
  "code": "8PP87U",
  "biography": null
 },
 {
  "avatar": "https://pretalx.com/media/avatars/JP_gFeuQSi.jpg",
  "name": "Joao Pinelo",
  "submissions": [
   "WJHSMD"
  ],
  "code": "8PVKQX",
  "biography": "Joao Pinelo is the Head of Data Science, Cloud Infrastructure and Development at the Atlantic International Research Centre. He has been at the Earth Observation Lab (AIR Centre) - a laboratory of the European Space Agency (ESA) - since 2020, where he was the project manager for building and setting up a data centre. He defined and manages systems’ architectures for networking, storage and computation of the datacentre, which he set up as a hybrid cloud. He set up and is responsible for the ground segment of the Direct Receiving Station, which streams and processes Earth Observation satellite data in real-time. Joao develops systems and software, including data science pipelines,  databases and web applications. He managed several projects, and he is the chief architect of an alert system. He is also the chief architect of the IoT network of the Azores, and the chief architect of the Custodian system (real-time monitoring of small fishing vessels and gear). He is coordinating the set-up of the United Nations Environment Programme (UNEP) node GRID Azores. Between 2010-13, he was Chairman and Chief Product Officer of the startup Strategic Spatial Solutions Inc. which he co-founded in Berkeley, California, with the responsibilities of leading the board to deliver business strategies, while developing high governance standards. He also worked on the definition of user requirements and use cases, liaise with potential clients and final users, and software testing. He an alumnus of University College London, where he earned a PhD in architecture. He has have (co-)authored scientific papers, including in Nature Communications. He has over 18 years of experience in higher education in Europe, the UK, and the Middle East, where I was an Assistant Professor. He is happiest while leading teams, strategising, playing with new ideas and stress-test them, brainstorming, creating systems architectures, exploring a new dataset, and writing code."
 },
 {
  "avatar": "https://pretalx.com/media/avatars/Profile_picture_0fGGJLc.jpeg",
  "name": "Matthew Fishman",
  "submissions": [
   "TXKXKP"
  ],
  "code": "8Q8AYS",
  "biography": "Research Scientist and Software Engineer at the [Flatiron Institute](https://www.simonsfoundation.org/people/matthew-fishman)."
 },
 {
  "avatar": "",
  "name": "Zhaoxing Wu",
  "submissions": [
   "SDVJ9Y"
  ],
  "code": "8RQ9A7",
  "biography": "Zhaoxing Wu just completed her undergraduate studies at the University of Wisconsin-Madison, where she worked with Prof. Claudia Solis-Lemus and major in statistics and mathematics. Her research interest broadly lies in Phylogenetics and network analysis."
 },
 {
  "avatar": "https://pretalx.com/media/avatars/54855463_wOuJIdN.png",
  "name": "Ashwani Rathee",
  "submissions": [
   "TTAJXA"
  ],
  "code": "8YBCB8",
  "biography": "Software Engineer @FleetSafe India, Backend and Vision. GSOC'22,OSPP'21 with JuliaImages"
 },
 {
  "avatar": "",
  "name": "Eduardo M. G. Vila",
  "submissions": [
   "QZ3PSY",
   "A97CNW"
  ],
  "code": "9AMMJ7",
  "biography": "PhD Student at Imperial College London"
 },
 {
  "avatar": "https://pretalx.com/media/avatars/P1302412_DxO-240x300_0RvMdZl.jpg",
  "name": "Xiansheng Cai",
  "submissions": [
   "YQVCML",
   "EQ9BSG"
  ],
  "code": "9DRXTB",
  "biography": "Xiansheng Cai is a PH.D. student at the Physics department of University of Massachusetts Amherst. He is actively involved in the development of Julia packages under the Numerical Effective Field Theory (NEFT) framework(https://github.com/numericalEFT) for modeling real-world quantum materials using modern quantum field theory. As the leading designer, his efforts have resulted in the creation of powerful tools CompositeGrids.jl for 1D grid representation, BrillouinZoneMeshes.jl for multi-dimensional Brillouin zone meshgrid representation."
 },
 {
  "avatar": "https://pretalx.com/media/avatars/frank_Boston_XasFZAS.jpeg",
  "name": "Frank Schäfer",
  "submissions": [
   "YRTLEC",
   "MX7J3F",
   "RRBDAA"
  ],
  "code": "9EFPAA",
  "biography": "I am a postdoc in the Julia Lab at the Massachusetts Institute of Technology (MIT). \r\nPreviously: PhD in physics in the Bruder group within the “Quantum Computing and Quantum Technology” PhD school at the University of Basel.\r\n\r\nhttps://frankschae.github.io/"
 },
 {
  "avatar": "https://pretalx.com/media/avatars/arindam_basu_QnShGvd.jpg",
  "name": "Arindam Basu",
  "submissions": [
   "7SUERE"
  ],
  "code": "9J8SNS",
  "biography": "Professor Arindam Basu is a medical doctor Epidemiologist and teaches Epidemiology and Public Health at the University of Canterbury, Christchurch, in New Zealand."
 },
 {
  "avatar": "https://pretalx.com/media/avatars/photo_5UY72GF.jpg",
  "name": "Jonathan Taylor",
  "submissions": [
   "9AKT3R"
  ],
  "code": "9JHL3Y",
  "biography": "Jonathan Taylor is an Associate Staff at MIT Lincoln Laboratory working on the DAF-MIT AI Accelerator's Magnetic Navigation project. His research interests are primarily centered on Machine learning in novel sensor environments."
 },
 {
  "avatar": "https://pretalx.com/media/avatars/IMG_2441_RuhQI5X.JPG",
  "name": "Raphael Araujo Sampaio",
  "submissions": [
   "CDPRWB"
  ],
  "code": "9JJWTR",
  "biography": "Raphael Sampaio graduated in Computer Engineering at PUC-Rio in 2015. During his undergraduate studies, he took classes through the academic exchange program at the University of Illinois at Urbana-Champaign, USA. In 2018, he received an MSc degree in Informatics with an emphasis on Optimization and Machine Learning, also at PUC-Rio. He joined PSR in 2016 and currently works on the software development of optimization models for hydrothermal dispatch under uncertainty with transmission constraints (SDDP)."
 },
 {
  "avatar": "",
  "name": "Valentin Bogad",
  "submissions": [
   "K3DPHH"
  ],
  "code": "9LYSWV",
  "biography": "I'm a julia enthusiast with a passion for high performance, correctness and static compilation.\r\n\r\nI sometimes write about julia on my [blog](https://seelengrab.github.io/)."
 },
 {
  "avatar": "",
  "name": "Pierre Borie",
  "submissions": [
   "RHTLPD"
  ],
  "code": "9LYY99",
  "biography": "PhD student at the University of Montreal in computer Science, currently working on the modernization of an electricity demand forecast tool for Hydro-Québec, main electricity supplier for the province of Quebec in Canada."
 },
 {
  "avatar": "https://pretalx.com/media/avatars/DSCF65022_5SQ0oTx.jpg",
  "name": "Cédric Belmant",
  "submissions": [
   "CNBSS3",
   "KPXNR7",
   "3QFPST"
  ],
  "code": "9N8YYQ",
  "biography": "Cédric Belmant is an applied mathematician and programmer, with a strong interest in 3D graphics, geometry processing and application development. He believes the expressive power of the Julia programming language is key to building applications and tools with minimal complexity, and has been exploring ways to integrate computer graphics in the Julia ecosystem."
 },
 {
  "avatar": "https://pretalx.com/media/avatars/2BAB7B0C-A39B-4387-8B67-0BE87D7AC1E2_2_22U4GpS.jpg",
  "name": "Sergio Sánchez Ramírez",
  "submissions": [
   "TC7TVY"
  ],
  "code": "9QBUME",
  "biography": "Currently, a PhD student at Barcelona Supercomputing Center on large-scale quantum computing simulation using Tensor Networks."
 },
 {
  "avatar": "https://pretalx.com/media/avatars/91CA378E-FD6B-41F4-90F4-C538DDD0A80F_BHsZNGK.jpeg",
  "name": "Sharan Yalburgi",
  "submissions": [
   "NLJFAX"
  ],
  "code": "9RHPAU",
  "biography": "Sharan is a Research Engineer at JuliaHub working on JuliaSim - a modern SciML powered suite for modeling and simulation."
 },
 {
  "avatar": "https://pretalx.com/media/avatars/goerz_profile_GxqZFer.jpg",
  "name": "Michael Goerz",
  "submissions": [
   "EKWZ3D"
  ],
  "code": "9UH8DH",
  "biography": "I am a senior postdoctoral fellow at the U.S. Army Research Lab in Adelphi, MD.\r\n\r\nMy research broadly addresses the tools, methods, and applications of quantum technology from a theoretical and numerical perspective. Currently, I am working on applications of machine learning to quantum control, and on the design of robust quantum sensing devices."
 },
 {
  "avatar": "",
  "name": "Lander Burgelman",
  "submissions": [
   "H7GAYD"
  ],
  "code": "9VYQV7",
  "biography": "PhD student at [Ghent University](https://quantumghent.github.io/)."
 },
 {
  "avatar": "https://pretalx.com/media/avatars/headshot_BqMlNMb.jpeg",
  "name": "Mitchell Pound",
  "submissions": [
   "VYVNCU"
  ],
  "code": "9XCTMP",
  "biography": "I am a student at Utah State University studying Mathematics, Economics, and Finance and plan to pursue a PhD in computational economics. I am passionate about mathematics and how it intersects with the complex dynamic systems that emerge from financial markets."
 },
 {
  "avatar": "https://pretalx.com/media/avatars/labpict_X9Vin03.jpg",
  "name": "Aditya Bhardwaj",
  "submissions": [
   "9SPAPT"
  ],
  "code": "9YWACP",
  "biography": "Physics undergrad at UChicago"
 },
 {
  "avatar": "https://pretalx.com/media/avatars/pfp_5f8QeIt.png",
  "name": "Ahan Sengupta",
  "submissions": [
   "PYJVRU"
  ],
  "code": "A3J7CA",
  "biography": "I am a high school student interested in the intersection of programming and music."
 },
 {
  "avatar": "https://pretalx.com/media/avatars/XG2010_Z489qI5.jpg",
  "name": "Xavier Gandibleux",
  "submissions": [
   "WCJUUH"
  ],
  "code": "A3VNSX",
  "biography": null
 },
 {
  "avatar": "",
  "name": "Stefan Krastanov",
  "submissions": [
   "DQCQKF",
   "UANL79"
  ],
  "code": "A7GLES",
  "biography": "I am a researcher in Quantum Information Science. I obtained my PhD in quantum physics at the Yale Quantum Institute at 2019 and have worked as a postdoc and a research scientist at Harvard and MIT since then. Last year I started my own group as an assistant professor at UMass Amherst, in the College of Information & Computer Sciences.\r\n\r\nMy open source biography starts with my involvement in the SymPy project, developing its plotting module and differential geometry module in 2012. Since then I have counted myself as one of the scientific programming hackers in the python (and more recently julia) ecosystems, in particular with focus on quantum information science."
 },
 {
  "avatar": "https://pretalx.com/media/avatars/Caira_headshot_spring_2022_axjo7sB.jpg",
  "name": "Caira Anderson",
  "submissions": [
   "ADLCE8"
  ],
  "code": "A9RU3G",
  "biography": "I am an applied mathematics graduate student and GEM Fellow. I currently work as a research assistant at the Princeton Plasma Physics Laboratory (PPPL). I am interested in the areas of dynamical systems, numerical analysis, and scientific computing. I am particularly drawn to applications in the areas of environmental sustainability and medicine. In Summer 2021, I interned at PPPL and developed a code using the automatic differentiation packages in Julia to optimize the design of stellarator (a nuclear fusion device) coils. I recently completed the framework of a code in Julia to solve a linear eigenvalue problem for the evaluation of the global stability of a given 3D plasma equilibrium in stellarator geometry."
 },
 {
  "avatar": "https://pretalx.com/media/avatars/me2022_00DX989.jpg",
  "name": "Milan Klöwer",
  "submissions": [
   "TEW9BP"
  ],
  "code": "A9SQSW",
  "biography": "Climate scientist at MIT. PhD from Oxford, previously: GEOMAR Kiel, UNIS Svalbard, IUEM Brest, AWI Bremerhaven"
 },
 {
  "avatar": "https://pretalx.com/media/avatars/3f0fdbd36fe059c65028ecb0ba6253d5_xQDljdl.jpg",
  "name": "Edmund Miller",
  "submissions": [
   "CSG8NU",
   "AJJRS3"
  ],
  "code": "AA9NAK",
  "biography": "PhD Student at UT Dallas in the Functional Genomics Lab\r\nnf-core maintainer"
 },
 {
  "avatar": "",
  "name": "Harshita",
  "submissions": [
   "LBCZDX"
  ],
  "code": "ABZCUL",
  "biography": "Research based student studying in UNB conducting my research on qualitative aspects of parallel programming using Julia."
 },
 {
  "avatar": "https://pretalx.com/media/avatars/Image_9PWH6f1.png",
  "name": "Paa JAKE",
  "submissions": [
   "BX3MYR"
  ],
  "code": "AF8R99",
  "biography": "HI! \r\n\r\nI'm JAKE ...\r\n\r\nA Software Engineer with experience in Test Engineering and Web Development and an affinity for Data Science and Analytics."
 },
 {
  "avatar": "",
  "name": "Julian Straus",
  "submissions": [
   "TSJYFP"
  ],
  "code": "ALT38V",
  "biography": null
 },
 {
  "avatar": "",
  "name": "Hayk Saribekyan",
  "submissions": [
   "RQ7BJZ"
  ],
  "code": "AMAX8Q",
  "biography": "Hayk Saribekyan leads the engineering at Biosim Inc. Biosim’s mission is to reduce the timescale of drug discovery processes many-fold through its platform that combines cutting-edge ideas from scientific computing, AI and quantum chemistry. Biosim uses Julia across its technology stack to achieve state-of-the-art performance on its molecular dynamics and virtual screening tools, as well as to develop custom methods for its computational drug discovery pipeline.\r\n\r\nHayk has received a PhD in Computer Science from the University of Cambridge, where he was a Gates Scholar. Prior to that he received a BSc and MEng from MIT."
 },
 {
  "avatar": "https://pretalx.com/media/avatars/1282691-2_E1bOsaA.jpeg",
  "name": "Kristoffer Carlsson",
  "submissions": [
   "SSRBPL",
   "YQQ9ZV",
   "7TFQMP"
  ],
  "code": "AS3MKE",
  "biography": null
 },
 {
  "avatar": "",
  "name": "Lars Hellemo",
  "submissions": [
   "TSJYFP"
  ],
  "code": "ASSCEF",
  "biography": null
 },
 {
  "avatar": "",
  "name": "Paul Brehmer",
  "submissions": [
   "TFGFPB"
  ],
  "code": "ATEZQV",
  "biography": "Currently M. Sc. student at RWTH Aachen University, Germany doing theoretical condensed matter physics and soon-to-be PhD student at University of Vienna, Austria, continuing with quantum information approaches to many-body systems. Outside of physics, I like to spend my time doing music-related things."
 },
 {
  "avatar": "https://pretalx.com/media/avatars/foto_profilo_compressed_1641036515227_bcSesi5.jpg",
  "name": "Claudio Moroni",
  "submissions": [
   "MS7YWQ"
  ],
  "code": "ATLSYL",
  "biography": "M. Sc. student in Physics of Complex Systems at the University of Turin | Complex systems modeling \r\n [InPhyT](https://github.com/InPhyT) | Open source development [UniTo-SEPI](https://github.com/UniTo-SEPI), [JuliaEpi](https://github.com/JuliaEpi), [JuliaHealth](https://github.com/JuliaHealth), [JuliaGraphs](https://github.com/JuliaGraphs). \r\n\r\n- Soon working on my thesis at [CENTAI](https://centai.eu/home);\r\n- Working on NeuronalModelling.jl: a flexible and high-performance computational framework for the specification, calibration and simulation of quantitative single-neuron models.\r\n\r\nContacts:\r\n\r\n-  [GitHub](https://github.com/ClaudMor)\r\n- [Twitter](https://twitter.com/Claudio__Moroni)\r\n- [ LinkedIn ](https://www.linkedin.com/in/claudiomoroni/)"
 },
 {
  "avatar": "",
  "name": "Diogo Netto",
  "submissions": [
   "BMBEGY"
  ],
  "code": "AZ8F99",
  "biography": null
 },
 {
  "avatar": "",
  "name": "Julia Gender Inclusive",
  "submissions": [
   "MHCCJF"
  ],
  "code": "B38TN3",
  "biography": null
 },
 {
  "avatar": "",
  "name": "Joshua Steier",
  "submissions": [
   "B3LFUE"
  ],
  "code": "B7LBUW",
  "biography": "Joshua Steier is a technical analyst at the RAND Corporation, focused on machine learning and modeling and simulation. He recently won an innovation award for investigating distributional shifts. \r\nHe holds an M.S. degree in Applied Mathematics and Statistics from Stony Brook University."
 },
 {
  "avatar": "",
  "name": "Jason Jensen",
  "submissions": [
   "VN8YWA"
  ],
  "code": "BCWJGX",
  "biography": "Projection Analyst at the Bank of Canada."
 },
 {
  "avatar": "https://pretalx.com/media/avatars/image_1_W2b3URk.png",
  "name": "Rachel Kurchin",
  "submissions": [
   "KCWTWK"
  ],
  "code": "BKJLVX",
  "biography": "I'm an Assistant Research Professor in Materials Science and Engineering at Carnegie Mellon University. I lead a local Pittsburgh-area Julia meetup, and also lead development of the Chemellia ecosystem and collaborate on AtomsBase.jl. You can learn more and find ways to reach me at [my personal website](https://rkurchin.github.io)."
 },
 {
  "avatar": "https://pretalx.com/media/avatars/2018-09-14_10.36.43_1lFTwyD.jpg",
  "name": "Dean Markwick",
  "submissions": [
   "DBSAMT",
   "GDRTNK"
  ],
  "code": "BPSXJZ",
  "biography": "A finance quant by day that writes about Julia and other things at night. You can read my ramblings at https://dm13450.github.io/"
 },
 {
  "avatar": "https://pretalx.com/media/avatars/23134958_00whWVC.jpeg",
  "name": "Vaibhav Dixit",
  "submissions": [
   "MS7SVG"
  ],
  "code": "BWE3YN",
  "biography": "Vaibhav is a Software Engineer at JuliaHub where he works on the Pumas Engineering team. He is an active member of the SciML ecosystem with contributions across parameter estimation and global sensitivity."
 },
 {
  "avatar": "https://pretalx.com/media/avatars/2015_Foto_Paul_1_L7kwpUS.jpg",
  "name": "Paul Lang",
  "submissions": [
   "GQPUWV",
   "PRLSQN"
  ],
  "code": "BXYAMA",
  "biography": "Paul Lang works in developing comprehensive models of biochemical reaction systems and\r\nsupporting software tools. He obtained a BSc degree in Molecular Biology at the University of\r\nGraz (Austria) and an MSc degree in Molecular Health Sciences at ETH Zurich (Switzerland). He\r\nthen switched from experimental to computational research. During his PhD at the University of\r\nOxford (UK), Paul developed a rule-based cell cycle model that explains location and dynamics\r\nof 16 observables in RPE1 cells. As visiting scholar at the Icahn School of Medicine at Mount\r\nSinai in New York (USA), he co-developed BpForms, a toolkit for concretely describing non-\r\ncanonical polymers to enable the construction of whole-cell models. Paul also co-developed SBMLToolkit.jl, which imports SBML models into the SciML ecosystem. Currently, Paul works for JuliaHub on developing a parameter optimization tool for quantitative systems pharmacology. He also helps clients to translate their models to ModelingToolkit.jl ODESystems."
 },
 {
  "avatar": "",
  "name": "Andre Valente",
  "submissions": [
   "WJHSMD"
  ],
  "code": "CAVPGT",
  "biography": "André Valente works at the Earth Observation Lab of the AIR Centre. He holds a PhD in Environmental Sciences from the University of Azores (Portugal) and a Degree in Geophysical Sciences from the University of Lisbon (Portugal). He specializes in the integration of satellite, models and in-situ data for several applications such as the study of ocean climate variability, physical-biological processes and marine plastic pollution."
 },
 {
  "avatar": "https://pretalx.com/media/avatars/selfie_PwjBNET.jpg",
  "name": "Jieqiu Shao",
  "submissions": [
   "QUFUFV"
  ],
  "code": "CBCGK7",
  "biography": "Jieqiu Shao (Jay) is a pursuing a PhD in Electrical Engineering at the University of Colorado at Boulder under Dr. Marco Nicotra's supervision. Jay completed his MS in Mechanical Engineering at the University of Colorado at Boulder in 2020. He earned his Bachelor of Science in Mechanical Engineering from the University of Iowa in 2018.\r\n\r\nJay's MS thesis, which now continues as his PhD project, focuses on the Control of Optical Atomic Lattices for Quantum Inertial Sensing. Along the way, Jay was the primary catalyst for Q-PRONTO, which is an extremely successful byproduct of a class project he worked on with Prof. John Hauser and has, since then, flourished beyond expectations."
 },
 {
  "avatar": "",
  "name": "Connor Stirling Smith",
  "submissions": [
   "WGZK8E"
  ],
  "code": "CBTQXW",
  "biography": null
 },
 {
  "avatar": "https://pretalx.com/media/avatars/4b9e888299f2bbb84b996583df056a8c_lYqXOMG.jpg",
  "name": "Michael Tiller",
  "submissions": [
   "HUCMKV"
  ],
  "code": "CEQ7XY",
  "biography": "[Michael Tiller](https://www.linkedin.com/in/mtiller/) has a Ph.D. in Mechanical Engineering from the University of Illinois, Urbana-Champaign.  He is the Secretary of the [Modelica Association](https://modelica.org), President of the [North America Modelica Users' Group](https://namug.org), author of [two books on Modelica](https://mbe.modelica.university) and the CTO of Realis Simulation."
 },
 {
  "avatar": "https://pretalx.com/media/avatars/new_ink_square_0tZjHt8.jpg",
  "name": "Ashton Wiersdorf",
  "submissions": [
   "A3LVDS"
  ],
  "code": "CFWQV8",
  "biography": "PhD student at the University of Utah studying programming languages working with Ben Greenman and Ganesh Gopalakrishnan. More about me on my website: https://lambdaland.org"
 },
 {
  "avatar": "https://pretalx.com/media/avatars/nikola_surjanovic_bwBMomk.jpg",
  "name": "Nikola Surjanovic",
  "submissions": [
   "YGMJXD"
  ],
  "code": "CLEGPX",
  "biography": "Nikola Surjanovic is a Vanier Scholar pursuing a PhD in Statistics at the University of British Columbia under the supervision of Dr. Alexandre Bouchard-Côté and Dr. Trevor Campbell. His primary research interest is in scalable Bayesian inference algorithms with theoretical guarantees."
 },
 {
  "avatar": "https://pretalx.com/media/avatars/foto_ale_7eMVzDE.jpeg",
  "name": "Alexis Tcach",
  "submissions": [
   "TCFXVE"
  ],
  "code": "CM73GU",
  "biography": "Alexis Tcach is a full time professor at Universidad Nacional of General Sarmiento and head teaching assistant at DC - Universidad de Buenos Aires, Argentina.  He received his Major in Computer Science from Universidad de Buenos Aires in 2012. His research interests are in the areas of mobile ad hoc networks, computer networks and its integration with machine learning."
 },
 {
  "avatar": "https://pretalx.com/media/avatars/greco_m4kT9aY.jpg",
  "name": "Filippos Christou",
  "submissions": [
   "7UFCSM"
  ],
  "code": "CMZYBK",
  "biography": "I am a Ph.D. student at the University of Stuttgart at the Institute of Communication Networks and Computer Engineering (IKR). I am interested in intent-driven networking and how Bayesian statistics and Reinforcement Learning can be used in this field to tackle common challenges."
 },
 {
  "avatar": "https://pretalx.com/media/avatars/gcd_vHsVXyh.png",
  "name": "Gajendra Deshpande",
  "submissions": [
   "PBWWFV",
   "SFCJDX",
   "W9GE7P"
  ],
  "code": "CPJQQS",
  "biography": "I am Gajendra Deshpande and I am using Python since 2013 for academic research and development activities. I develop prototypes and applications in Natural Language Processing, Machine Learning, Cyber Security, and Web applications using Python and its ecosystem. I am working as a faculty of Computer Science and run a start-up in cyber security. I am an active member of the PyCon India community and served as program committee lead for PyCon India 2021. I have presented approximately 80 talks, 20 Workshops, and 15 posters across the globe at prestigious conferences like PyData Global, PyCon APAC, PyCon AU, EuroPython, DjangoCon US and Europe, SciPy India, SciPy USA, PyCon USA, JuliaCon, FOSDEM, and several other Python and FOSS conferences. I have helped Python and FOSS Conferences by reviewing the talk and tutorial proposals, mentoring first-time speakers, participating in the discussions, and organizing the events."
 },
 {
  "avatar": "https://pretalx.com/media/avatars/rosto_kHFFzFT.jpg",
  "name": "Emanuel Lima",
  "submissions": [
   "ERXTXE"
  ],
  "code": "CV3VMU",
  "biography": "Research software engineer at Block Science and lead maintainer of cadCAD."
 },
 {
  "avatar": "https://pretalx.com/media/avatars/Bowen_Chiu_Kk1o7sB.jpg",
  "name": "Bowen Chiu",
  "submissions": [
   "9ES8NF"
  ],
  "code": "CVMB9Z",
  "biography": "With 33 years of experience in software programming, Bowen is the founder of CAMEO Corporation. He specializes in artificial intelligence and distributed computing, with a\r\nparticular focus on the environmental sector, the educational sector, and start-ups.\r\n\r\ncbh@cameo.tw"
 },
 {
  "avatar": "https://pretalx.com/media/avatars/julian_arnold_JCQrvRd.jpg",
  "name": "Julian Arnold",
  "submissions": [
   "FJXRMJ",
   "9FD73V"
  ],
  "code": "CVSB3L",
  "biography": "I am PhD Student in the Quantum Theory Group of Prof. Christoph Bruder at the University of Basel (Switzerland) working at the interface between machine learning and quantum physics.\r\n\r\nhttps://arnoldjulian.github.io/"
 },
 {
  "avatar": "https://pretalx.com/media/avatars/about-photo_Zm5Nyds.png",
  "name": "Paulo Bruno Serafim",
  "submissions": [
   "8DLMGU"
  ],
  "code": "D7HFYD",
  "biography": "Paulo Bruno Serafim is a Ph.D. student in Computer Science at the Gran Sasso Science Institute. His research interests include scientific machine learning applied to Integrated Assessment Models and neural network optimization. Furthermore, he develops work in multi-agent cooperation and competition, emulation of human play styles in Non-Player Characters, and interpretability of autonomous agents using Deep Reinforcement Learning techniques. In the past, he worked as a Research Engineer at the COATI team at the Centre Inria d'Université Côte d'Azur, as well as a Lead Data Scientist, Computer Vision Engineer, and Computer Graphics Engineer at the Instituto Atlântico. He holds a Master's degree and a Magna Cum Laude Bachelor's degree in Computer Science from the Federal University of Ceara, where he is an external collaborator of the CRAb research group."
 },
 {
  "avatar": "",
  "name": "Antonis Skourtis",
  "submissions": [
   "8B3QWF"
  ],
  "code": "D9LDEL",
  "biography": null
 },
 {
  "avatar": "",
  "name": "J Bima",
  "submissions": [
   "DN387J"
  ],
  "code": "DDPVHA",
  "biography": "Research Scientist at Merck & Co."
 },
 {
  "avatar": "",
  "name": "Juan Menduiña",
  "submissions": [
   "TCFXVE"
  ],
  "code": "DEDBZJ",
  "biography": null
 },
 {
  "avatar": "",
  "name": "Ross Anderson",
  "submissions": [
   "VZDG9G"
  ],
  "code": "DFDSL3",
  "biography": null
 },
 {
  "avatar": "https://pretalx.com/media/avatars/bagge_VofCTbJ.jpg",
  "name": "Fredrik Bagge Carlson",
  "submissions": [
   "NN3URK",
   "V7SMGP"
  ],
  "code": "DGDNGV",
  "biography": "I received my MSc and PhD 2019 from the Dept. Automatic Control in Lund, Sweden, working within the fields of control, machine learning and robotics. I have since spent a year with the Acoustic Research Laboratory at NUS and subsequently made the transition to industry, working with dynamic modeling, control and programming-language design in a robotics context. I am now working with JuliaHub on software tools for acausal modeling, simulation, optimization and control in the Julia programming language."
 },
 {
  "avatar": "https://pretalx.com/media/avatars/bk_new_side_med_L7bQy9W.png",
  "name": "Bogumił Kamiński",
  "submissions": [
   "CMVSB9",
   "CXYFUL",
   "PHXZS8"
  ],
  "code": "DHRPEA",
  "biography": "I am a researcher in the fields of operations research and computational social science.\r\nFor development I mostly use the Julia language."
 },
 {
  "avatar": "https://pretalx.com/media/avatars/IMG_1115_qjVAZjv.jpeg",
  "name": "Jan Siml",
  "submissions": [
   "EGDAR7"
  ],
  "code": "DLUFRL",
  "biography": "A weighted mixture of management consulting/business strategy/change management/data science."
 },
 {
  "avatar": "https://pretalx.com/media/avatars/Me_z2hyAsv.jpg",
  "name": "Lars Mikelsons",
  "submissions": [
   "EWL3LC"
  ],
  "code": "DML9DB",
  "biography": "Professor at the chair for mechatronics at the University of Augsburg"
 },
 {
  "avatar": "",
  "name": "Utkarsh",
  "submissions": [
   "MS7SVG"
  ],
  "code": "DQEAVU",
  "biography": "Graduate student @ MIT"
 },
 {
  "avatar": "",
  "name": "piet.vanderpaelt@mil.be",
  "submissions": [
   "L88UBE"
  ],
  "code": "DRNYUN",
  "biography": null
 },
 {
  "avatar": "https://pretalx.com/media/avatars/91baf55727753211641974a7a6be5f48_6cMTcGb.jpg",
  "name": "Daniel Kool",
  "submissions": [
   "EYFPLZ"
  ],
  "code": "DRPANN",
  "biography": "I am a PhD student in bioinformatics at Iowa State University."
 },
 {
  "avatar": "",
  "name": "Michel Schanen",
  "submissions": [
   "A7YMT8"
  ],
  "code": "DUUAYM",
  "biography": null
 },
 {
  "avatar": "https://pretalx.com/media/avatars/mantas_photo_2AMAiUg.JPG",
  "name": "Mantas Naris",
  "submissions": [
   "QUFUFV"
  ],
  "code": "DXND7L",
  "biography": "Mantas is a PhD student at the University of Colorado, where he works in the Bio-inspired Perception and Robotics Lab. Mantas is interested in automated design, sensorimotor neurophysiology, and the hardware, dynamics, and controls of soft robots."
 },
 {
  "avatar": "",
  "name": "Michael F. Herbst",
  "submissions": [
   "TFGFPB"
  ],
  "code": "DZ7WHZ",
  "biography": null
 },
 {
  "avatar": "https://pretalx.com/media/avatars/1556391887501_Hpwu9rK.jpeg",
  "name": "Caleb Allen",
  "submissions": [
   "BFQVMX"
  ],
  "code": "DZAR37",
  "biography": "Caleb Allen is a software engineer and the author of VimBindings.jl, a package that brings the power and elegance of Vim to the Julia REPL. He has worked in various startups, developing applications and systems in languages such as Java, Kotlin, and Python, among others. He has a passion for building tools and infrastructure that make software development more enjoyable and productive. He also enjoys learning new programming languages as a hobby, and he discovered Julia in 2020 during the pandemic. Since then, he has been fascinated by Julia's features and performance, and has enjoyed learning and contributing to the Julia ecosystem. He is excited to share his experience and insights developing VimBindings.jl with the Julia community at JuliaCon."
 },
 {
  "avatar": "https://pretalx.com/media/avatars/avatar_2_73tDY5Z.png",
  "name": "Oskar Laverny",
  "submissions": [
   "YUNTJC",
   "AL7QJG"
  ],
  "code": "E9PVET",
  "biography": "I am currently a Post-Doctoral researcher at UCLouvain, in Belgium, under an FNRS grant. Actuary by formation, I focused during my PhD on high dimensional statistics and dependence structure estimations applied to internal modeling in a reinsurance context. I do have a taste for numerical code and open-source software, and most of my work is freely available on Github."
 },
 {
  "avatar": "",
  "name": "Li Sean",
  "submissions": [
   "ZCNXEB"
  ],
  "code": "EAC9WR",
  "biography": "Senior Research Scientist at Canadian Food Inspection Agency."
 },
 {
  "avatar": "",
  "name": "Olli Herrala",
  "submissions": [
   "VGMMMP"
  ],
  "code": "ECPHLK",
  "biography": null
 },
 {
  "avatar": "https://pretalx.com/media/avatars/72975308c5458a5e25cbedba12465294_hmwBxaw.jpg",
  "name": "Frames Catherine White",
  "submissions": [
   "H7GADX"
  ],
  "code": "ECUZBT",
  "biography": "Frames has been a log time contributor to Julia and its ecosystem, going back to the late days of Julia v0.3. She had done many things at many times, but has a long term interest in automatic differentiation."
 },
 {
  "avatar": "https://pretalx.com/media/avatars/headshot1a_VNDHXZc.jpeg",
  "name": "Thatcher Chamberlin",
  "submissions": [
   "9HVSQW"
  ],
  "code": "EFEYMV",
  "biography": "Thatcher is a Julia fan and a former physics student who has spent the last four years building and refining attitude determination and control systems as a Flight Dynamics Engineer at a satellite communications startup."
 },
 {
  "avatar": "",
  "name": "Demian Panigo",
  "submissions": [
   "TCFXVE"
  ],
  "code": "EGN7YL",
  "biography": "YPF (Yacimientos Petrolíferos Fiscales) Board Member and Researcher at the National Council of Scientific and Technological Research (LETIF-CONICET). I have a PhD in Economics (EHESS-Paris, France) and I'm teaching advanced macroeconomics and development economics at three different Universities (UNLP, UNDAV and UNQ). Working now on industrial economics and HPC in Econometrics."
 },
 {
  "avatar": "https://pretalx.com/media/avatars/me_7YzCwK6.jpg",
  "name": "Albert R. Gnadt",
  "submissions": [
   "9AKT3R"
  ],
  "code": "ELDRTD",
  "biography": "B.S. from UW-Madison MechE, M.S. and PhD from MIT AeroAstro. Interested in sustainability, transportation (especially aviation), and the Julia programming language. Former NSF GRFP fellow. Private pilot."
 },
 {
  "avatar": "https://pretalx.com/media/avatars/Screenshot_20190314-0203392.png",
  "name": "Adán Mauri Ungaro",
  "submissions": [
   "TCFXVE"
  ],
  "code": "EU8BNP",
  "biography": null
 },
 {
  "avatar": "",
  "name": "Tangi Migot",
  "submissions": [
   "HQSUYM"
  ],
  "code": "EUXGZU",
  "biography": "Postdoc at Polytechnique Montreal"
 },
 {
  "avatar": "https://pretalx.com/media/avatars/Screen_Shot_2022-12-15_at_8.27.09_PM_kBHytkl.png",
  "name": "Will Thompson and Alex Friedrichsen",
  "submissions": [
   "GP9DMT"
  ],
  "code": "EVUYHZ",
  "biography": "We are graduate students in complex systems science at the University of Vermont. Our interests include cool data science projects and having fun with epistemology."
 },
 {
  "avatar": "https://pretalx.com/media/avatars/2-4736-Edit_0HUwwxd.jpg",
  "name": "Helmut Strey",
  "submissions": [
   "L9S3HT"
  ],
  "code": "EVVJZ7",
  "biography": null
 },
 {
  "avatar": "https://pretalx.com/media/avatars/fuerst_dHw3VDE.png",
  "name": "Steffen Fürst",
  "submissions": [
   "B9DG8U"
  ],
  "code": "EVXMSK",
  "biography": "Steffen Fürst, having studied mathematics with a focus on economics and social science, has spent the past 15 years working on various agent-based models. In the most recent 5 years, his focus has been particularly on high-performance computing environments."
 },
 {
  "avatar": "https://pretalx.com/media/avatars/1689087757336_4ZyyNMU.jpeg",
  "name": "Anant Thazhemadam",
  "submissions": [
   "XJKBZY"
  ],
  "code": "EWCJB7",
  "biography": "I'm a Software Developer at JuliaHub, working on the JuliaSim suite of products. I'm also easily nerd-sniped."
 },
 {
  "avatar": "https://pretalx.com/media/avatars/5c7a669b4ed90e2895f01df730b6998c_koyR7XE.jpg",
  "name": "Théo Galy-Fajou",
  "submissions": [
   "CNBSS3"
  ],
  "code": "EWDVK7",
  "biography": "Bayesian researcher and Julia developer for quite some time now. I am part of the Julia Gaussian Process team and developed all kind of serious tools for statistical analysis and more stupid stuff like WatchJuliaBurn.jl or DeepFry.jl"
 },
 {
  "avatar": "https://pretalx.com/media/avatars/headshot_wYPbjEa.JPG",
  "name": "Joshua Villarreal",
  "submissions": [
   "ZJKYVS"
  ],
  "code": "EXUNAB",
  "biography": "Ph.D. student in physics at Massachusetts Institute of Technology."
 },
 {
  "avatar": "https://pretalx.com/media/avatars/bvdmitri_mjUF7Hu.jpeg",
  "name": "Dmitry Bagaev",
  "submissions": [
   "WQNE9L"
  ],
  "code": "F87RD7",
  "biography": "My research interests lie in the fields of computers science, machine learning and probabilistic programming. Currently I am a PhD candidate in the SPS group of Electrical Engineering department in Eindhoven University of Technology. I’m working on a high-performant implementation of message passing-based Bayesian inference package in the Julia programming language. My research project focuses on Signal Processing and Active inference applications, but is also aimed to expand the scope of possible applications for message passing in general."
 },
 {
  "avatar": "",
  "name": "James Hennessy",
  "submissions": [
   "NLB33K"
  ],
  "code": "F9UZSM",
  "biography": "I love Julia and I work in drug discovery machine learning/simulation"
 },
 {
  "avatar": "",
  "name": "Jiacheng Chuan",
  "submissions": [
   "ZCNXEB"
  ],
  "code": "FA8WAT",
  "biography": "PhD student in Bioinformatics and Microbiology.\r\nBioinformatician at Canadian Food Inspection Agency."
 },
 {
  "avatar": "https://pretalx.com/media/avatars/24105215-3CCB-427B-A267-9B7B653F6C63_fmgRO4x.jpeg",
  "name": "Min Khant Zaw",
  "submissions": [
   "WRB8D8"
  ],
  "code": "FDLPCU",
  "biography": "Min is a researcher and graduate student at Georgia Institute of Technology. Min have spoken at several conferences including SciPy, PyCon about programming languages and its functions. Currently interested in algorithms complexity, optimization and discovery of robust approaches to ML black box models."
 },
 {
  "avatar": "",
  "name": "Jose Daniel Lara",
  "submissions": [
   "Y9PV3X"
  ],
  "code": "FFQKPB",
  "biography": null
 },
 {
  "avatar": "",
  "name": "Nesrine Ouanes",
  "submissions": [
   "8JZPSG"
  ],
  "code": "FFQXRX",
  "biography": "Renewable energy engineer, PhD'ing in economics at Humboldt University of Berlin"
 },
 {
  "avatar": "https://pretalx.com/media/avatars/myphoto_gMnrWgH.jpg",
  "name": "Youngsung Kim",
  "submissions": [
   "YNGAV7"
  ],
  "code": "FH9J3E",
  "biography": "Youngsung Kim is a software performance engineer at Oak Ridge National Laboratory. \r\n\r\n* Julia Accelerator Interfaces(JAI): embrace conventional languages(Fortran, C, C++) as well as GPU programming(Cuda/Hip, OpenAcc, OpenMP) within Julia."
 },
 {
  "avatar": "",
  "name": "Edo Abraham",
  "submissions": [
   "KB8HS7"
  ],
  "code": "FNNU8L",
  "biography": null
 },
 {
  "avatar": "https://pretalx.com/media/avatars/fa500983b169c53548cdb52743800b2f_7GdLy6s.jpg",
  "name": "Ivan Utkin",
  "submissions": [
   "YKUD8Q",
   "GTKJZL",
   "BLCWQW"
  ],
  "code": "FRBW87",
  "biography": "Ivan Utkin's scientific record revolves around numerical modelling of natural processes in geosciences with a strong emphasis on resolving coupled multi-physics interactions. Specifically, the record includes studies of fluid flows in porous rocks, including compaction-driven flow focussing, ground displacement due to the elastic response of rocks to the fluid pressure, and the influence of chemical interactions between fluid and rocks on the flow dynamics and observed chemical composition in rocks. A particular focus of Utkin's research is the development of numerical techniques to resolve processes in high resolution using massively parallel computing architectures such as graphics processing units (GPUs)."
 },
 {
  "avatar": "https://pretalx.com/media/avatars/3235132_guYZRYE.png",
  "name": "Mishka (Michael Bukatin)",
  "submissions": [
   "F7WKU7"
  ],
  "code": "FT77LL",
  "biography": "### main theme\r\n\r\nMy main research focus has been to find, study, and develop a **high-level computer programming formalism\r\nallowing to deform programs in a continuous fashion** (just as one can deform recurrent neural networks in a continuous fashion).\r\n\r\nI was trying to approach this problem from various angles: doing research in the mathematics of continuous domains\r\nfor denotational semantics of programming languages, studying theoretical neuroscience, and so on.\r\n\r\nFinally, our research collaboration was starting to see the hints of the possible solution from approximately Fall of 2012,\r\nand the formalism for continuously deformable programs was developed by our research collaborations in 2015-2016. \r\n\r\nThese days I am continuing to focus on studying and experimenting with this formalism and I am hoping that it will\r\neventually stop being a purely research subject and will become a technology.\r\n\r\nI maintain a Web site for this formalism here: https://anhinga.github.io/\r\n\r\nI also maintain a list of open problems and promising research and technological directions and interdisciplinary\r\nconnections related to this formalism: https://www.cs.brandeis.edu/~bukatin/dmm-collaborative-research-agenda.pdf\r\n\r\n### brief timeline\r\n\r\nMy background in software, mathematics, and science goes back to Soviet Union, to machine code, Algol-60, Fortran-4,\r\nand to punched cards; to Pushchino, the Biological Center of the Soviet Academy of Sciences, and to\r\nthe Mathematical class of Moscow High School number 7.\r\n\r\nI started to focus on continuous models of computations in college, then emigrated to USA, worked as\r\na scientific programmer for Alex Rashin at Biosym Technologies doing computational geometry and computational chemistry\r\n(I was the second author on several papers in _The Journal of Physical Chemistry_ and _Biophysical Chemistry_\r\nfrom that period), then did a PhD in Computer Science at Brandeis University focusing of mathematics\r\nof continuous domains for denotational semantics (this is a copy of my 2002 PhD thesis: https://arxiv.org/abs/1512.03868).\r\n\r\nIn parallel, I worked in various places in the software industry. There I had a chance to first touch\r\ndataflow programming, Common Lisp, and actor model of programming. \r\n\r\nThis century I have been working at a geographic software company (ownership of it went through acquisitions, spin-offs,\r\nand such, so one very long employment looks like several shorter ones from a formal viewpoint), \r\nwhile doing research in parallel. My research focus was mostly on theoretical neuroscience for a while,\r\nthen a research collaboration on deep connections between _partial metrics_ and _fuzzy equalities_, \r\nand finally (from approximately Fall of 2012) a research collaboration\r\non deep connections between _partial contradictions_ and _vector semantics of programming languages_ \r\nand, from 2014-2015 on, a series of research collaborations on _neuromophic computations with linear streams_. \r\n\r\nStarting from about 2011 I was gradually moving from just being a lover of computer animation and electronic music to\r\nmy first attempts to make some visual, audio, and audio-visual art of my own, and I am continuing to make new computer art every few months or so.\r\nIt involved playing a bit with MilkDrop 2 for WinAmp, mixing music a bit with Serato DJ,\r\ndoing a lot of animations and a bit of sound work in Processing, doing a tiny bit of that in Clojure,\r\nand finally working a bit with shader-based GLSL animations.\r\n\r\n### 2015-2021\r\n\r\n_Linear streams_ are streams for which linear combinations of several streams are defined. If one makes sure that\r\nlinear computations and general (often non-linear) computations are interleaved, then one gets continuously deformable programs which\r\nwe call **Dataflow matrix machines (DMMs)**. Another way to obtain DMMs is to start with recurrent neural networks\r\nand replace streams of numbers with linear streams and allow complicated \"activation functions\"\r\n(that is, transformations of linear streams) with arbitrary arity.\r\n\r\nThis setup also allows these neural machines to have very natural and flexible self-modification facilities.\r\nThere are toy implementations in Processing with mutable matrices, and the reference implementation in Clojure with\r\nimmutable streams of tree-shaped \"flexible-rank tensors\". The reference paper on DMMs is https://arxiv.org/abs/1712.07447\r\n\r\nI hope to create the next application of this formalism in Julia \r\n(both **Julia Flux** and **JAX** are the machine learning frameworks which finally have sufficient flexibility\r\nwe need to take full advantage of the flexibility of DMMs). I started to switch to Julia in the early 2020.\r\nI recently sketched a three-page note outlining my hopes in this sense: https://www.cs.brandeis.edu/~bukatin/towards-practical-dmms.pdf\r\n\r\n### 2022-present\r\n\r\nIn June 2022 I was able to perform the first successful experiments in DMM training and in program synthesis/circuit synthesis/DMM synthesis\r\nvia neural architecture search using Zygote.jl. The synthesized DMMs had pretty\r\nimpressive generalization properties. In September 2022 I was able to open source those experiments:\r\n\r\nhttps://github.com/anhinga/DMM-synthesis-lab-journal/blob/main/history.md\r\n\r\nThose experiments are the subject of the proposed talk.\r\n\r\nI am looking for collaborators. Creating an issue at one of my GitHub repositories is the easiest way to contact me."
 },
 {
  "avatar": "",
  "name": "Greg Heileman",
  "submissions": [
   "QEBHYB"
  ],
  "code": "FTNJKA",
  "biography": null
 },
 {
  "avatar": "https://pretalx.com/media/avatars/linkedin-profile_EFokIe0.jpg",
  "name": "Steffen Ridderbusch",
  "submissions": [
   "3QFPST"
  ],
  "code": "FUSCQ7",
  "biography": "Steffen Ridderbusch is a PhD in information engineering at the University of Oxford and works for the startup Planting Space on Julia related tooling and infrastructure."
 },
 {
  "avatar": "",
  "name": "Nathan Kolbow",
  "submissions": [
   "ZVLMVZ"
  ],
  "code": "FYTZE7",
  "biography": null
 },
 {
  "avatar": "",
  "name": "Venkateshprasad Bhat",
  "submissions": [
   "V7SMGP",
   "S8DTUG"
  ],
  "code": "FZNX7W",
  "biography": null
 },
 {
  "avatar": "https://pretalx.com/media/avatars/me_LYJ45T1.jpg",
  "name": "Eric P. Hanson",
  "submissions": [
   "BTUFJX"
  ],
  "code": "GBSYWE",
  "biography": "I am a research scientist at Beacon Biosignals Inc, working on developing machine learning models for detecting various encephalopathies from EEG recordings. Previously, I completed my PhD  in quantum information theory, where I worked on repeated interaction systems and continuity bounds for entropies, among other things."
 },
 {
  "avatar": "https://pretalx.com/media/avatars/287D81E7-9D7E-4892-81F6-EE9D34E25737_aENTPkq.jpeg",
  "name": "Rajeev Voleti",
  "submissions": [
   "QXZFDL"
  ],
  "code": "GCQ8Q3",
  "biography": "Rajeev Shobhit Voleti received the bachelors degree (B.Tech) in aerospace engineering from the Indian Institute of Technology (IIT) Bombay, India in 2017. He is currently a Ph.D student at the University of Texas at Arlington, TX, USA. He has been an intern for JuliaHub working on JuliaSim Control. His research interests include cooperative control, nonlinear control, optimization, optimal control and estimation."
 },
 {
  "avatar": "https://pretalx.com/media/avatars/IMG_2838_tall_aGrq5Mi.jpg",
  "name": "J. Eduardo Vera-Valdés",
  "submissions": [
   "NF7PAX"
  ],
  "code": "GGJMJG",
  "biography": "I am an Associate Professor at the Department of Mathematical Sciences at Aalborg University. Furthermore, I am a member of the National System of Researchers (SNI) of the Mexican National Council of Science and Technology (CONACYT), and a Research Fellow at CREATES -Center for Research in Econometric Analysis of Time Series-, and the Danish Finance Institute.\r\n\r\nI obtained my PhD in Economics and Business Economics in 2016 at Aarhus University and CREATES. \r\nMy research interests are econometrics, time series, long memory, statistical learning, and climate econometrics. I have published in the Journal of Econometrics, and at Journal of Financial Econometrics, among others. Furthermore, I am a certified GitHub Campus Advisor.\r\n\r\nI have served as a referee for the International Journal of Forecasting, the Journal of Time Series Analysis, the Journal of Computational and Graphical Statistics, Economics Letters, and for Computational Statistics & Data Analysis, among others. Moreover, I am one of the organizers of the Long Memory Conference and the Data Science Computing Conference.\r\n\r\nPreviously, I studied Mathematics at the Center for Mathematical Research (CIMAT) in 2007 in Guanajuato, Mexico, and obtained a Master’s Degree in Economics from the Center for Research and Teaching in Economics (CIDE) 2010, also in Mexico. I worked at Mexicos Central Bank and as Assistant Professor at the University of Guanajuato."
 },
 {
  "avatar": "",
  "name": "Marco Cognetta",
  "submissions": [
   "J7VRPB"
  ],
  "code": "GK3ZSK",
  "biography": "I am a PhD student in NLP at the Tokyo Institute of Technology and a PhD Student Researcher at Google Tokyo. My research focuses on tokenization neural language modeling, in particular within CJK translation.\r\n\r\nI can be found at https://sigmoid.social/@mc and at https://theoreticallygoodwithcomputers.com."
 },
 {
  "avatar": "https://pretalx.com/media/avatars/jameson_zoom_jwmWBTr.jpg",
  "name": "Jameson Nash",
  "submissions": [
   "RTCDVR"
  ],
  "code": "GKZDHU",
  "biography": "I work for JuliaHub on julia compiler and language development"
 },
 {
  "avatar": "https://pretalx.com/media/avatars/20191202_095616_2_IoRQj4Q.jpg",
  "name": "Felipe Coelho Argolo",
  "submissions": [
   "LCVKZS"
  ],
  "code": "GLXP7Q",
  "biography": "I'm a scientist that studies human behavior, with a keen on mathematics and philosophy.\r\n\r\nM.D., Ph.D. (Psychiatry)\r\nDeveloper: https://github.com/fargolo\r\nResearch (https://scholar.google.com/citations?user=XR4ot-cAAAAJ), Book (https://leanpub.com/cienciadados) and Blog (https://medium.com/d-van)."
 },
 {
  "avatar": "https://pretalx.com/media/avatars/expanding_bastard_small_fKvuhKt.jpg",
  "name": "Expanding Man (Michael Savastio)",
  "submissions": [
   "QGVBDY",
   "RBKKSS"
  ],
  "code": "GMGA8V",
  "biography": "My educational background is in both experimental and theoretical high energy physics.  My initial programming experience mostly centered around scientific/numerical computing in C++ and fortran.  Since receiving my PhD I have been working as a data scientist, and have been using Julia primarily both in and outside my job for almost 7 years.  My recent programming experiences have involved both convex and non-convex optimization, including large-scale mixed integer conic programming, as well as machine learning and statistics.  My interest in Julia and other new languages such as `zig`, as well as my enthusiasm for the broader Linux ecosystem has also caused me to spend a lot of time with serialization, IPC and network protocols.  I also enjoy video games which has led me to watch projects around gaming on Linux, and as a guitar player I'm also interested in audio."
 },
 {
  "avatar": "",
  "name": "Nicholas Barbara",
  "submissions": [
   "QN3XGU"
  ],
  "code": "GQTK8K",
  "biography": "Nicholas Barbara is a PhD candidate at the Australian Centre for Robotics, within the University of Sydney. He is interested in robust machine learning, control theory, spacecraft GNC, and all things Julia."
 },
 {
  "avatar": "https://pretalx.com/media/avatars/20220421070818_IMG_1761_4KB0VCy.jpg",
  "name": "Carlo Brunelli",
  "submissions": [
   "N7UQRU",
   "9GR3PG"
  ],
  "code": "GWEBQN",
  "biography": "PhD student in computational fluid dynamics.\r\nAreas of interest:\r\n- Julia (of course)\r\n- Finite Element Method for fluid-dynamics\r\n- Variational Multiscale Method for incompressible fluids\r\n- HPC for solving large systems"
 },
 {
  "avatar": "https://pretalx.com/media/avatars/headshot_2021_4AhGpUF.JPG",
  "name": "Theo Diamandis",
  "submissions": [
   "UNDFLS"
  ],
  "code": "H8VVYE",
  "biography": null
 },
 {
  "avatar": "",
  "name": "Facundo Sapienza",
  "submissions": [
   "AZLD3E"
  ],
  "code": "H99MDX",
  "biography": "PhD Student at UC Berkeley interested in Machine Learning and Physics. Previously studied Physics and Mathematics at the University of Buenos Aires."
 },
 {
  "avatar": "https://pretalx.com/media/avatars/Iga_Szczesniak_image_xz7Z19z.png",
  "name": "Iga Szczesniak",
  "submissions": [
   "MMCQLP",
   "WJHSMD"
  ],
  "code": "HEQVKN",
  "biography": "Iga Szczesniak is a Project Developer at the Earth Observation Laboratory of the AIR Centre. She graduated with a degree in Geoinformatics and has since worked to support innovative applications of Earth Observation (EO) data using geospatial data and the Julia language. Prior to her current role, Iga conducted a socio-economic analysis of the EO market at the European Space Agency (ESA). In addition to her professional work, she serves on the organizing committee of JuliaEO 2023 - Global Workshop on Earth Observation with Julia. She loves talking about NewSpace, Synthetic Aperture Radar, and innovative applications of remote sensing data."
 },
 {
  "avatar": "https://pretalx.com/media/avatars/8CCC2BDB-C75F-40EF-962B-1D8B48A36A93_n2LvWfy.png",
  "name": "Jean-Baptiste Caillau",
  "submissions": [
   "HDC8F7"
  ],
  "code": "HEYELZ",
  "biography": "Professor of Applied mathematics<br>\r\nUniversité Côte d'Azur, CNRS, Inria, LJAD, France<br>\r\nScientific interests: optimisation and control (geometric and computational methods)<br>\r\n[Webpage](http://caillau.perso.math.cnrs.fr)"
 },
 {
  "avatar": "https://pretalx.com/media/avatars/przemyslaw_szufel_kadrowane600x750_zE0iQfb.jpg",
  "name": "Przemysław Szufel",
  "submissions": [
   "AGYFPY"
  ],
  "code": "HNA89P",
  "biography": "Przemysław Szufel is an Assistant Professor at SGH Warsaw School of Economics, Adjunct Professor at Toronto Metropolitan University. His main research focus is applying advanced analytics methods, and in particular, machine learning, simulation and optimization in modelling in bringing new value to business processes. He is a co-author of several tools and algorithms for optimal and cost efficient collection and analysis of large data sets in the cloud. He is a co-author of over 40 publications, including handbooks and journal papers, in the area of applying advanced analytics, machine learning and simulation methods to making optimal business decisions. He is an active member of the Julia language community - maintains 3 official Julia packages and has 2nd place answering Julia-related questions on StackOverflow. He is a co-author of book “Julia 1.0 Programming Cookbook: Over 100 numerical and distributed computing recipes for your daily data science workflow”. Przemysław is also co-managing SilverDecisions.pl project (that aims for representing and supporting business decisions), which has been elected by the European Commission to the Innovation Radar programe, grouping the best innovations financed by the EU funds."
 },
 {
  "avatar": "https://pretalx.com/media/avatars/WhatsApp_Image_2023-07-13_at_11.53.35_MR4SDAS.jpeg",
  "name": "Lukas Devos",
  "submissions": [
   "SRNPDJ"
  ],
  "code": "J3MD8U",
  "biography": "PhD student @ Ghent University studying tensor network methods and algorithms for classical and quantum physics simulations."
 },
 {
  "avatar": "https://pretalx.com/media/avatars/2989a078f4caff6fb86fa30e59bd9aa9_MJ1BZ3P.jpg",
  "name": "Tim Holy",
  "submissions": [
   "RTCDVR",
   "TTAJXA"
  ],
  "code": "J9BSUH",
  "biography": "I am the Alan A. and Edith L. Wolff Professor of Neuroscience at Washington University in St. Louis. In addition to my scientific research, I contribute to Julia, its tooling, and portions of the package ecosystem."
 },
 {
  "avatar": "https://pretalx.com/media/avatars/astro_db5YQV8.jpg",
  "name": "Miguel Raz Guzmán Macedo",
  "submissions": [
   "3PSF39",
   "AZWAFU",
   "X8QZZX"
  ],
  "code": "JE89PF",
  "biography": "I try to do physics, Julia, and Rust, both in english and in spanish.\r\n\r\nAsk me about the REPL, spanish intensive Julia courses or for corporate trainings on how to learn Rust."
 },
 {
  "avatar": "https://pretalx.com/media/avatars/elujan_1b2DMNL.jpg",
  "name": "Emmanuel Lujan",
  "submissions": [
   "GGEKXE"
  ],
  "code": "JERCK8",
  "biography": "Postdoctoral Associate at Julia Lab, MIT."
 },
 {
  "avatar": "",
  "name": "Avinash Subramanian",
  "submissions": [
   "ZVWPTP"
  ],
  "code": "JFTD7D",
  "biography": null
 },
 {
  "avatar": "https://pretalx.com/media/avatars/CARION_CIV_TAQnLBu.jpg",
  "name": "Tristan Carion",
  "submissions": [
   "MFGSMK"
  ],
  "code": "JFWGMZ",
  "biography": "Tristan Carion is a PhD student at the mechanical department of the Royal Military School in Belgium and Gent University. He's working on uncertainty quantification for atmospheric dispersion modelling using ensemble forecasts and sensitivity analysis. He's also using Julia and Typescript to develop a Web-based application running in the European Weather Cloud, that provides atmospheric dispersion modelling capabilities with fast access to ECMWF forecasts."
 },
 {
  "avatar": "https://pretalx.com/media/avatars/2ea774a2d172b0964147fecc6b53b7e9_OFWTjwn.jpg",
  "name": "Avik Sengupta",
  "submissions": [
   "PYJVRU"
  ],
  "code": "JR9GPS",
  "biography": "Avik Sengupta is the head of product development and software engineering at Julia Computing, contributor to open source Julia and maintainer of several Julia packages. Avik is the author of Julia High Performance, co-founder of two artificial intelligence start-ups in the financial services sector and creator of large complex trading systems for the world's leading investment banks."
 },
 {
  "avatar": "https://pretalx.com/media/avatars/mijn_foto_webpage_SVC51FJ.jpg",
  "name": "Domenico Lahaye",
  "submissions": [
   "WTSTWE"
  ],
  "code": "JWJX3S",
  "biography": "Professor at the Technical University of Delft."
 },
 {
  "avatar": "https://pretalx.com/media/avatars/avatar_aGIlCHg.png",
  "name": "Boyan Bejanov",
  "submissions": [
   "VN8YWA"
  ],
  "code": "JXPEBU",
  "biography": "Principal Data Scientist at [Bank of Canada](https://www.bankofcanada.ca) working in scientific computing for macroeconomics."
 },
 {
  "avatar": "https://pretalx.com/media/avatars/me_suGEmuI.jpg",
  "name": "Aurora Rossi",
  "submissions": [
   "AUBPU7"
  ],
  "code": "JYWQL7",
  "biography": "I'm a first-year PhD student at  Université Côte d’Azur in the COATI joint team between Inria centre at Université Côte d’Azur and the I3S Laboratory"
 },
 {
  "avatar": "https://pretalx.com/media/avatars/profile_picture_jvnHESk.png",
  "name": "Johannes Blaschke",
  "submissions": [
   "PC8PZ8"
  ],
  "code": "K9PVSE",
  "biography": "Johannes leads the Data area of NERSC's application readiness program (NESAP) for Perlmutter, and works with real-time and urgent computing users to improve the facility and system-level performance in of their workflows. He is acting as the liaison to several NESAP teams exploring new programing models and developing new functionality in the areas of performance portability, integrated research infrastructure, and the Superficility project."
 },
 {
  "avatar": "",
  "name": "Kai Partmann",
  "submissions": [
   "ZS8NCE"
  ],
  "code": "KDTKRE",
  "biography": "Ph.D. student @ Solid Mechanics Group, University of Siegen, Germany"
 },
 {
  "avatar": "https://pretalx.com/media/avatars/10700342_925096057504702_1832210206962588354_o_VKSYwSm.jpg",
  "name": "Marcell Havlik",
  "submissions": [
   "S8JVGK"
  ],
  "code": "KE83VA",
  "biography": "AI developer. \r\nI love programming since I was 10 years. Graduated in the best university in Hungary, got BSc. and MSc. Worked in more than 15 programming languages.  \r\nCo-Founder of DiabTrend startup. \r\nGot introduced to Julia through a friend and we rewrote some of our code in there to test it. It was really convincing, since then working in Julia. And with a strong technical background, I can say Julia is the best language of 2023."
 },
 {
  "avatar": "",
  "name": "Otto Ritter",
  "submissions": [
   "DN387J"
  ],
  "code": "KKJDWB",
  "biography": null
 },
 {
  "avatar": "https://pretalx.com/media/avatars/T2GMPBM40-U020QUXKQKD-448f188f75e8-512_WVBUPLe.jpg",
  "name": "Colin Swaney",
  "submissions": [
   "E8ESXU"
  ],
  "code": "KU8TMM",
  "biography": "Colin Swaney is a Senior Research Software Engineer at Princeton University's Data-Driven Social Science Initiative whose work focuses on developing tools to solve computational challenges associated with the analysis of large and complex social science data sets. Prior to joining Princeton, he spent several years working as a quantitative researcher and data scientist in the finance industry."
 },
 {
  "avatar": "https://pretalx.com/media/avatars/245015835_283422126962316_132167486804690739_n_1_SkeizBI.jpg",
  "name": "Paul Tiede",
  "submissions": [
   "PUY3SP"
  ],
  "code": "KWBFEW",
  "biography": null
 },
 {
  "avatar": "https://pretalx.com/media/avatars/IMG_0560_Flg6AE8.JPG",
  "name": "Spencer Clemens",
  "submissions": [
   "VYVNCU"
  ],
  "code": "KZ9QUT",
  "biography": "Graduated from USU with a bachelors in Computer Science in May of 2022."
 },
 {
  "avatar": "https://pretalx.com/media/avatars/Torsten-Schenkel_0Eas2qI.jpg",
  "name": "Torsten Schenkel",
  "submissions": [
   "AYQRRE",
   "GQPUWV"
  ],
  "code": "LBMXCW",
  "biography": "Torsten Schenkel is a theoretical engineer. He is Associate Professor for Continuum Mechanics at Sheffield Hallam University. \r\n\r\nWith a background in aerospace engineering, Torsten's research is focused on biomedical problems, mostly concerning numerical modelling of the cardio-vascular system. Models range from 3-dimensional heart models to time-resolved 3d-flows in atherosclerotic vessels to 0D-lumped models of the whole circulatory system. Having started scientific programming with Fortran77, he now feels like he has come home with Julia."
 },
 {
  "avatar": "https://pretalx.com/media/avatars/b0cf54b8431443687735cb486599ea9c_rsPMumK.jpg",
  "name": "Miles Lubin",
  "submissions": [
   "XZP9U8"
  ],
  "code": "LHAQVA",
  "biography": "Miles is the BDFL of JuMP"
 },
 {
  "avatar": "https://pretalx.com/media/avatars/portrait-2_z3Ii02x.jpg",
  "name": "Pierre martinon",
  "submissions": [
   "HDC8F7"
  ],
  "code": "LLMJSB",
  "biography": "Junior Researcher at Inria (sabbatical) \r\n\r\nScientific interests: optimisation and optimal control"
 },
 {
  "avatar": "https://pretalx.com/media/avatars/23FAA3CB-1EE2-4731-A34D-4F09E47FA316_hmTqUdM.JPG",
  "name": "Giovanni Pagliarini",
  "submissions": [
   "LYSQWS"
  ],
  "code": "LNRHHF",
  "biography": "PhD Student in Artificial Intelligence @ University of Ferrara, Italy\r\nStudying Symbolic Learning with Multimodal Logics."
 },
 {
  "avatar": "https://pretalx.com/media/avatars/mugshot_itT8qpM.png",
  "name": "Elliot Saba",
  "submissions": [
   "XJKBZY"
  ],
  "code": "LQRC77",
  "biography": "I am a senior research engineer at JuliaHub, where I design next-generation tools for the Julia programming language. I received my Ph.D. from the University of Washington in Electrical Engineering, specializing in Digital Signal Processing. I also have experience in a number of related fields including low-level microcontroller programming, electromagnetics and wireless communications, high performance computing, and machine learning."
 },
 {
  "avatar": "",
  "name": "Joaquim Dias Garcia",
  "submissions": [
   "QZPLLS"
  ],
  "code": "LRPWKX",
  "biography": null
 },
 {
  "avatar": "https://pretalx.com/media/avatars/me_VCAJnxO.jpg",
  "name": "Jun Tian",
  "submissions": [
   "JUSWPE"
  ],
  "code": "LRSECX",
  "biography": "[Jun Tian](https://juntian.me/)"
 },
 {
  "avatar": "https://pretalx.com/media/avatars/jf-work_7Ydxgmb.jpg",
  "name": "Jean-François BAFFIER (azzaare@github)",
  "submissions": [
   "87RGBV",
   "DCEGGJ"
  ],
  "code": "LZTBFS",
  "biography": "Researcher at *Internet Initiative Japan* (IIJ) research lab, specialized in Optimization, Networks, Data Structures, and Algorithms."
 },
 {
  "avatar": "https://pretalx.com/media/avatars/roundSmilingSuit_lgYhqEZ.png",
  "name": "Alex Friedrichsen",
  "submissions": [
   "GP9DMT"
  ],
  "code": "M8C8BA",
  "biography": "Alex Friedrichsen is a Master's student in the Complex Systems Center of the University of Vermont studying Data Science and Complex Systems. I graduated with my bachelor's degree in Data Science in the spring of 2022 through the Honors College at UVM while taking accelerated master's classes. I am currently doing research in multiple labs here at UVM including most recently the Social-Ecological Gaming and Simulation (SEGS) lab.\r\n\r\nSome of my interests include game theory, music, agent-based models, evolutionary computation, philosophy of mind and chaos theory! I enjoy both technical and holistic learning experiences. I am a huge proponent of habits and routine to promote daily flexiblity through self-automation. I love to read about self-improvement, behavioral economics, theory versus action, and fantasy! I try to optimize and strategize everything.\r\n\r\nCurrently open to work."
 },
 {
  "avatar": "https://pretalx.com/media/avatars/White_6VFtHQJ.png",
  "name": "Pietro Monticone",
  "submissions": [
   "MS7YWQ"
  ],
  "code": "M9K7SC",
  "biography": "### Main Activities\r\n- Physics at the [University of Turin (UniTO)](https://www.unito.it);\r\n- Mathematical, statistical and computational modelling of complex systems at the [Interdisciplinary Physics Team (InPhyT)](https://github.com/InPhyT);\r\n- Developing FOSS at [InPhyT](https://github.com/InPhyT), [UniTO-SEPI](https://github.com/UniTo-SEPI), [JuliaEpi](https://github.com/JuliaEpi), [JuliaHealth](https://github.com/JuliaHealth), [JuliaGraphs](https://github.com/JuliaGraphs);\r\n- Working on NeuronalModelling.jl: a flexible and high-performance computational framework for the specification, calibration and simulation of quantitative single-neuron models;\r\n- Learning about automated theorem provers and interactive proof assistants to formalise, digitise and verify mathematical assertions.\r\n\r\n### Main Contacts\r\n- [GitHub](https://github.com/pitmonticone)\r\n- [Twitter](https://twitter.com/PietroMonticone)\r\n- [YouTube](https://www.youtube.com/@PietroMonticone)\r\n- [Mastodon](https://bayes.club/@PietroMonticone)\r\n- [Julia Discourse](https://discourse.julialang.org/u/pietromonticone)\r\n- [Julia Forem](https://forem.julialang.org/pitmonticone)"
 },
 {
  "avatar": "",
  "name": "Sean L Wu",
  "submissions": [
   "DN387J"
  ],
  "code": "MEZQCK",
  "biography": "Mathematical epidemiologist, senior scientist at Merck."
 },
 {
  "avatar": "https://pretalx.com/media/avatars/cropped_1800x1800_300dpi_XOb5zbZ.png",
  "name": "Jonathan Doucette",
  "submissions": [
   "B3GMAE"
  ],
  "code": "MJ9ECN",
  "biography": "A PhD Candidate at the University of British Columbia, Jonathan Doucette studies MRI Physics and focuses on researching brain tissue microstructure through numerical simulation and Bayesian machine learning."
 },
 {
  "avatar": "https://pretalx.com/media/avatars/DSCF7415-3-extra-small-square_CQ6AvPO.png",
  "name": "Stephan Sahm",
  "submissions": [
   "WRHJPD",
   "HXFG7X",
   "QA9LQX"
  ],
  "code": "MJPZGQ",
  "biography": "Stephan Sahm is founder of the Julia consultancy Jolin.io, and organizer of the Julia User Group Munich Meetup. In his academic days, he certified as Master of Applied Stochastics, Master and Bachelor of Cognitive Science, and Bachelor of Mathematics/Informatics. Since more than 5 years Stephan Sahm works as senior consultant for Data Science and Engineering, now bringing Julia to industry. \r\n\r\nStephan Sahm's top interest are in green computing, functional programming, probabilistic programming, real time analysis, big data, applied machine learning and in general industry applications of Julia.\r\n\r\nAside Julia and sustainable computing, he likes chatting about Philosophy of Mind, Ethics, Consciousness, Artificial Intelligence and other Cognitive Science topics."
 },
 {
  "avatar": "https://pretalx.com/media/avatars/high_FBSlmQo.jpg",
  "name": "Benoît Legat",
  "submissions": [
   "JP3SPX",
   "XLT8H3"
  ],
  "code": "MLJG3F",
  "biography": "Benoît Legat is a postdoctoral researcher at KU Leuven working in the ERC \"Back To The Roots\""
 },
 {
  "avatar": "https://pretalx.com/media/avatars/MyLogo_HjWGEwN.png",
  "name": "Yuto Horikawa",
  "submissions": [
   "RBHAER"
  ],
  "code": "MPHFWH",
  "biography": "I like to create mathematical handicrafts.\r\n\r\nGitHub: https://github.com/hyrodium\r\nTwitter: https://twitter.com/hyrodium\r\nMastodon: https://julialang.social/@hyrodium"
 },
 {
  "avatar": "https://pretalx.com/media/avatars/d788bf7fd037ebef5798d8881c5faa2f_5lkHLYu.jpg",
  "name": "Jacob Quinn",
  "submissions": [
   "CMVSB9",
   "CXYFUL",
   "PHXZS8"
  ],
  "code": "MQ3SJP",
  "biography": null
 },
 {
  "avatar": "",
  "name": "Kyle Sherbert",
  "submissions": [
   "WUTK8E"
  ],
  "code": "MQP3N9",
  "biography": null
 },
 {
  "avatar": "",
  "name": "Etienne Tétreault-Pinard",
  "submissions": [
   "YGJ9SL"
  ],
  "code": "MRX3SE",
  "biography": "Etienne is currently working as a Data Science Developer at R2, engineering consultants in the chlor-alkali industry, juggling his time between writing data analysis application for electro-chemists and doing research on R2's next generation of models. Trained in climate science and having previously held the role of principal maintainer of plotly.js, the popular data-visualization library by Plotly, Etienne is a scientist turned open-source software enthusiast."
 },
 {
  "avatar": "",
  "name": "erussell@rff.org",
  "submissions": [
   "LUVDCY"
  ],
  "code": "MT3RHA",
  "biography": null
 },
 {
  "avatar": "",
  "name": "Luis Benet",
  "submissions": [
   "B8FHNU"
  ],
  "code": "N8X8NX",
  "biography": "I am Associate Professor at the [Instituto de Ciencias Físicas](https://www.fis.unam.mx) of the Universidad Nacional Autónoma de México (UNAM). I am interested in Random Matrix Theory, quantum chaos, interacting quantum many-body systems, ergodicity, hamiltonian dynamics, chaotic scattering, classical and quantum transport, disordered systems, billiards, structure and stability of narrow planetary rings, Solar System dynamics, dynamics of minor planetary objects (NEOs and NEAs), precise and mathematically rigorous numerical calculations. I've been using Julia as developer since 2013. More info: https://lbenet.github.io/"
 },
 {
  "avatar": "",
  "name": "Ruize Ren",
  "submissions": [
   "8DFWR3",
   "RRL3KQ"
  ],
  "code": "NBA3LP",
  "biography": null
 },
 {
  "avatar": "",
  "name": "Kristian Aalling Sørensen",
  "submissions": [
   "MMCQLP"
  ],
  "code": "NFCCXU",
  "biography": "Kristian Aalling Sørensen took a Master in Science and Engineering in Earth and Space Physics and Engineering with a specialisation in Earth Observation from the National Space Institute of Denmark. He has since 2020 worked with the Center for Security at DTU and is currently working towards a Ph.D. at DTU Space. In his work, he is working on increasing maritime domain awareness using satellite data and artificial intelligence. His research interests include satellite data fusion and aggregation for, in particular, ship detection and classification."
 },
 {
  "avatar": "",
  "name": "Alejo",
  "submissions": [
   "TCFXVE"
  ],
  "code": "NFKLWD",
  "biography": null
 },
 {
  "avatar": "",
  "name": "Torkel",
  "submissions": [
   "MS7SVG"
  ],
  "code": "NKSUPV",
  "biography": "Torkel is a postdoc at the JuliaLab at MIT. His research is on methods for modelling (bio)chemical reaction networks, focusing especially on noise. He is a developer of the Catalyst.jl package."
 },
 {
  "avatar": "",
  "name": "Fareeda Abdelazeez",
  "submissions": [
   "QLUH7A"
  ],
  "code": "NLGXM7",
  "biography": null
 },
 {
  "avatar": "",
  "name": "Andrew Claster",
  "submissions": [
   "W93AJB"
  ],
  "code": "NTZHUG",
  "biography": null
 },
 {
  "avatar": "",
  "name": "Bowen S. Zhu",
  "submissions": [
   "HZV83P"
  ],
  "code": "NZ3ACK",
  "biography": "Bowen is a graduate student in Computational Science and Engineering at Harvard University."
 },
 {
  "avatar": "https://pretalx.com/media/avatars/Foto_am_1-14-23_um_2.06_PM_HDCE7G9.jpeg",
  "name": "Kangbo Li",
  "submissions": [
   "LE8M9X"
  ],
  "code": "P3FFSG",
  "biography": "I'm a CS PhD student at Cornell.\r\n\r\nI work mostly on electronic structure theory and sometimes quantum computing.\r\n\r\nI like curry and tacos."
 },
 {
  "avatar": "https://pretalx.com/media/avatars/ef72759b96be2144199ccf265d77766d_IYjy89p.jpg",
  "name": "Guilherme Bodin",
  "submissions": [
   "N3E8BX",
   "A7EA9E"
  ],
  "code": "PCLZTQ",
  "biography": "Guilherme works with Julia in production since 2019."
 },
 {
  "avatar": "https://pretalx.com/media/avatars/gf_at_arboretum_gLXTNo1.JPG",
  "name": "Gael Forget",
  "submissions": [
   "WJHSMD",
   "N8ZX8W"
  ],
  "code": "PFYSJ9",
  "biography": "Currently works as a research scientist at the Massachusetts Institute of Technology (MIT) in the Department of Earth, Atmospheric and Planetary Sciences. Research interests and expertise include satellite observations, ocean robots, marine ecosystems, ocean physics, numerical modeling, and estimation in general (incl. AI, ML, DA, & AD). Created the JuliaOcean and JuliaClimate organizations. Lead developer of a series of Julia packages focused on ocean and climate science. These include MeshArrays.jl (JuliaCon18), ClimateModels.jl (JuliaCon21), and OceanRobots (JuliaCon21)."
 },
 {
  "avatar": "https://pretalx.com/media/avatars/foto_qDlUg2A.jpg",
  "name": "Pablo Gluzmann",
  "submissions": [
   "TCFXVE"
  ],
  "code": "PJQ3TC",
  "biography": "Pablo Gluzmann is a senior researcher at the Center for Distributive, Labor and Social Studies (CEDLAS) of Universidad Nacional de La Plata (UNLP). He received her B.A., M.A., and Ph.D. in Economics from UNLP, researcher at the National Scientific and Technical Research Council (CONICET) and associate professor at the UNLP. His research is focused on Inequality, Poverty, Labor Markets and Macroeconomics among others topics. Has been published on journals such as Journal of Development Economics, Economic Letters, World Development, The Stata Jounal, Centro Journal, Latin American Economic Review, Review of Development Economics, Journal of Income Distribution, Journal of International Financial Markets, Institutions and Money, Journal for Labour Market Research, Económica, El Trimestre Económico, Ensayos Económicos. He has also published several chapters of books and working papers at UNDP, WB, IADB, CAF, CEDLAS, IZA, etc."
 },
 {
  "avatar": "",
  "name": "Simon Byrne",
  "submissions": [
   "FS7HWF",
   "HQ7V3N",
   "WGQEUM"
  ],
  "code": "PKSECG",
  "biography": "Simon Byrne is the lead software engineer on the [CliMA project](https://clima.caltech.edu/), which aims to build a next-generation climate model in Julia."
 },
 {
  "avatar": "https://pretalx.com/media/avatars/56dd0464231b9e36ee010756eb0dcd25_DsWFRDo.jpg",
  "name": "Morten Piibeleht",
  "submissions": [
   "GPRCYA"
  ],
  "code": "PMKEJN",
  "biography": "Morten has been one of the maintainers Documenter.jl and the JuliaDocs package ecosystem. He works as a software engineer at JuliaHub.\r\n\r\nGitHub: [@mortenpi](https://github.com/mortenpi)"
 },
 {
  "avatar": "",
  "name": "Torkel",
  "submissions": [
   "MS7SVG"
  ],
  "code": "PNHNBU",
  "biography": "Torkel is a Postdoc at the Julia Lab at MIT. His research is on methods for modelling chemical reaction networks, specialising in how these are affected by noise."
 },
 {
  "avatar": "https://pretalx.com/media/avatars/lucalle2_hkb2HBy.jpg",
  "name": "Luca Ferranti",
  "submissions": [
   "HMVG8Q"
  ],
  "code": "PTCVCM",
  "biography": "Luca Ferranti is a PhD researcher and software developer. He has a huge interest for scientific computing and applied mathematics and is passionate about open source and open source communities."
 },
 {
  "avatar": "https://pretalx.com/media/avatars/tobi_web_450x300_ZNq3fIC.jpg",
  "name": "Tobias Thummerer",
  "submissions": [
   "EWL3LC"
  ],
  "code": "PWQVZG",
  "biography": "Research Scientist @ University of Augsburg"
 },
 {
  "avatar": "",
  "name": "Nicholas L. St-Pierre",
  "submissions": [
   "VN8YWA"
  ],
  "code": "PXJ9SN",
  "biography": "Nicholas Labelle St-Pierre is a Principal Economist in the Projection Division of the Canadian Economic Analysis Department at the Bank of Canada. His research interests include macroeconomics, monetary policy and numerical methods. Nicholas holds an MSc and a BSc in Economics from the University of Quebec in Montreal (UQAM) and has passed CFA Level III."
 },
 {
  "avatar": "https://pretalx.com/media/avatars/1b8cec28040ab5f90fc731de99c7e0e9_6D2XKhI.jpg",
  "name": "JinGuo Liu",
  "submissions": [
   "PX99DC"
  ],
  "code": "QBUZQE",
  "biography": null
 },
 {
  "avatar": "https://pretalx.com/media/avatars/headshot_JaYhEwm.jpg",
  "name": "Daniel Sharp",
  "submissions": [
   "XKGR3C"
  ],
  "code": "QLCNXZ",
  "biography": "Ph.D. student in Uncertainty Quantification at MIT. Currently works on function approximation methods for transport maps and scientific simulation tools."
 },
 {
  "avatar": "",
  "name": "Jeffrey Varner",
  "submissions": [
   "A7883T",
   "C7WNPJ"
  ],
  "code": "QLXKQ8",
  "biography": "Jeff Varner holds a Ph.D. in Engineering from Purdue University. He spent 18 years as a Professor at the Smith School of Chemical Engineering at Cornell University"
 },
 {
  "avatar": "https://pretalx.com/media/avatars/WF_Godoy_WCq2o8K.jpg",
  "name": "William F Godoy",
  "submissions": [
   "NKVYHZ",
   "AY8EUX"
  ],
  "code": "QQZ83B",
  "biography": "William F. Godoy is a Senior Computer Scientist in the Computer Science and Mathematics Division at Oak Ridge National Laboratory (ORNL). His interests are in the areas of high-performance computing (HPC) scientific software, programming models, data and parallel I/O. He has contributed to several scientific codes funded by the US Department of Energy Exascale Computing Project and the Neutron Science Facilities at ORNL, and at previous staff positions at Intel. William obtained his PhD in Mechanical Engineering from the State University of New York (SUNY) at Buffalo in 2009. He is a 2022 BSSw Fellowship honorable mention, US-RSE and ACM member and a IEEE senior member serving in several technical venues."
 },
 {
  "avatar": "https://pretalx.com/media/avatars/8177701_jKilj4H.jpg",
  "name": "Oscar Dowson",
  "submissions": [
   "UWKJU9"
  ],
  "code": "QREN8R",
  "biography": "Oscar Dowson is a core contributor to JuMP and a member of the JuMP steering committee."
 },
 {
  "avatar": "https://pretalx.com/media/avatars/pc_invCCM9.jpg",
  "name": "Pierluigi Crescenzi",
  "submissions": [
   "CMAMLV"
  ],
  "code": "QSVLRA",
  "biography": "Pierluigi Crescenzi is a professor at the Gran Sasso Science Institute. Before joining GSSI, he has been researcher at the University of L’Aquila, and professor at the University of Rome, Florence, and Paris. He has taught in basically every field of computer science. He is the author of more than 130 scientific publications in the field of algorithm theory and its applications. He is co-author of 5 university textbooks, including 2 in English, and a popular Italian book. He is member of the editorial board of JCSS. He is co-author of the NP optimisation compendium, which is still widely cited. He has been a member of the steering committee of the COST 295 DYNAMO action. His current research is mostly focus on the analysis of complex networks and, more specifically, of temporal networks. He has been the co-developer of several software projects, ranging from algorithm visualisation tools to IP address lookup algorithms, and from computer science education to computer science conference mining. His last software project is WorldDynamics.jl, an open-source framework written in Julia for world dynamics modelling and simulation."
 },
 {
  "avatar": "https://pretalx.com/media/avatars/propic_91xz2cD.JPG",
  "name": "Evan Gorstein",
  "submissions": [
   "THCJ7H"
  ],
  "code": "QTFLUJ",
  "biography": "Evan Gorstein is a 3rd year PhD student in the Department of Statistics at the University of Wisconsin-Madison."
 },
 {
  "avatar": "https://pretalx.com/media/avatars/csm_OMLIN_samuel_3a2df39fc2_IJUK2tt.jpg",
  "name": "Samuel Omlin",
  "submissions": [
   "BLCWQW",
   "HC8HLQ",
   "GTKJZL",
   "PC8PZ8",
   "YKUD8Q"
  ],
  "code": "QTKXPY",
  "biography": "Computational Scientist and Responsible for Julia computing at the Swiss National Supercomputing Centre, ETH Zurich"
 },
 {
  "avatar": "https://pretalx.com/media/avatars/stanford2_moreblurred_cut_github_E1Kahzs.jpg",
  "name": "Carsten Bauer",
  "submissions": [
   "MBS3YY",
   "NKVYHZ",
   "PC8PZ8"
  ],
  "code": "R3SWQF",
  "biography": "Carsten is a postdoctoral theoretical physicist from Cologne, Germany, and a senior HPC consultant within the German National High-Performance Computing Alliance (NHR) at the Paderborn Center for Parallel Computing (PC2)."
 },
 {
  "avatar": "https://pretalx.com/media/avatars/34600f9680ea73a9cf7c8cccdd874fc7_CCdfAYa.jpg",
  "name": "Jorge A. Pérez-Hernández",
  "submissions": [
   "B8FHNU"
  ],
  "code": "R9CEVF",
  "biography": "I currently work as a Flight Dynamics Engineer at the European Space Operations Center in Darmstadt, Germany. As part of my PhD research at Mexico National Autonomous University, I developed TaylorIntegration.jl, in collaboration with Dr. Luis Benet. I enjoy researching asteroid and comet dynamics, high-accuracy orbit determination, astrodynamics and Taylor-mode automatic differentiation."
 },
 {
  "avatar": "",
  "name": "Nathan Daly",
  "submissions": [
   "BMBEGY"
  ],
  "code": "R9ZNAD",
  "biography": null
 },
 {
  "avatar": "https://pretalx.com/media/avatars/6735977_SittUir.jpg",
  "name": "Sebastian Pfitzner",
  "submissions": [
   "PZASV7"
  ],
  "code": "RCTGVS",
  "biography": "Sebastian is a Software Engineer at JuliaHub focusing on tooling around Julia, including the JuliaHub platform and the Julia extension for VS Code, as well as various other contributions to the Julia ecosystem."
 },
 {
  "avatar": "",
  "name": "Timothy Chapman",
  "submissions": [
   "9BTTRL"
  ],
  "code": "RKPNQN",
  "biography": "."
 },
 {
  "avatar": "",
  "name": "John Lapeyre",
  "submissions": [
   "KRN7VM"
  ],
  "code": "S37CQN",
  "biography": null
 },
 {
  "avatar": "https://pretalx.com/media/avatars/foto_bnxs9ip.jpg",
  "name": "Rafał Pracht",
  "submissions": [
   "S339TU"
  ],
  "code": "S7FQAG",
  "biography": "Rafał Pracht is an experienced Software Architect in the financial industry. During his career, he participated in many projects in the finance area in Poland, the UK, France, Mideast, and eastern Europe. Since 2018 he is passionate about quantum computing, and he participated in courses at MIT, ETH Zurich, and the University of Toronto on that topic. He is one of the 360 Qiskit advocates (https://qiskit.org/advocates/), the group of the finest minds in quantum computing, worldwide. Currently, he is doing quantum research for the financial industry at BNP Paribas Bank Polska SA."
 },
 {
  "avatar": "https://pretalx.com/media/avatars/Avatar_CZ0wZF2.jpg",
  "name": "Alain Marcotte",
  "submissions": [
   "UVEDD3"
  ],
  "code": "SDYK9B",
  "biography": "More than forty years in scientific computing after a bachelor degree in mathematics.\r\nWorked on applications such as gas turbine simulation, autocad for the garment industry, flying personnel schedulers.\r\nAmongst the different computing languages I've used Scheme and now favor functional programming.\r\nCurrently in the demand forecast team of Hydro-Québec, the main public electric utility in the province of Quebec in Canada . This team is revamping their forecast models; my contribution includes converting some of their models from Fortran to Julia."
 },
 {
  "avatar": "https://pretalx.com/media/avatars/Head_shot_reduced_nvuJQx2.jpg",
  "name": "James D Foster",
  "submissions": [
   "SMUP8H"
  ],
  "code": "SHJAQB",
  "biography": "James Foster is an applied mathematician with a doctorate in mathematical optimization, specializing in the modeling and optimal planning of energy systems. He has worked across industry and government, and taught both pure and applied mathematics courses at the university level. He is an enthusiastic contributor to the open source community with particular involvement in the JuMP modeling language for doing optimization in Julia, and as a Carpentries instructor and lesson maintainer for teaching foundational computational skills to researchers."
 },
 {
  "avatar": "",
  "name": "Jose Storopoli",
  "submissions": [
   "TQE7GF"
  ],
  "code": "SKB7VR",
  "biography": "Associate Professor and Researcher of the Department of Computer Science at Universidade Nove de Julho - UNINOVE located in São Paulo - Brazil. Director of Education and Training at Pumas-AI.\r\n\r\nTeaches undergraduate and graduate courses in Data Science, Statistics, Bayesian Statistics, Machine Learning and Deep Learning using Julia, R, Python, and Stan. Contributor to Julia, R and Stan ecosystems.\r\n\r\nResearches, publishes and advises PhD candidates on topics about Bayesian Statistical Modeling and Machine Learning applied to Decision Making.\r\n\r\nCoauthor of Julia Data Science book. Directs the development of education and training materials for Pumas users in Julia. Member of the Stan Governing Body - SGB. Member of the Turing.jl Developer Team. Certified RStudio Tidyverse Instructor."
 },
 {
  "avatar": "https://pretalx.com/media/avatars/DisplayPictureCropped_1fantwR.jpeg",
  "name": "Ayush Patnaik",
  "submissions": [
   "8Z8S3R"
  ],
  "code": "SKRLCP",
  "biography": "xKDR Forum and the University of Sydney"
 },
 {
  "avatar": "https://pretalx.com/media/avatars/0387a6a7e4ce641c5447dda1c429d1d2_txPuKjy.jpg",
  "name": "Dave Kleinschmidt",
  "submissions": [
   "TWS3EJ"
  ],
  "code": "SLNRF8",
  "biography": "Research Scientist at Beacon Biosignals and recovering academic."
 },
 {
  "avatar": "https://pretalx.com/media/avatars/b1b9938790729d96af6f168d8ce0f917_1tjV3U5.jpg",
  "name": "Mosè Giordano",
  "submissions": [
   "BTUFJX",
   "7BCPNX"
  ],
  "code": "ST7KZT",
  "biography": "Research Software Developer at UCL during the day, binary builder during the night."
 },
 {
  "avatar": "https://pretalx.com/media/avatars/me_crop_eRmmC5s.jpg",
  "name": "Tamás Cserteg",
  "submissions": [
   "DQ9BDU"
  ],
  "code": "SXBVXD",
  "biography": "I am Tamás Cserteg mechatronical engineer and PhD student at SZTAKI (Institute for Computer Science and Control), Hungary. Most of my time is spent with developing robotic solutions for our industrial partners and research projects. I like to use Julia for every kind of stuff including my research and personal projects as well."
 },
 {
  "avatar": "https://pretalx.com/media/avatars/shuvo_ORC_final_-_Copy_7gpB8v3.png",
  "name": "Shuvomoy Das Gupta",
  "submissions": [
   "LFPAKE"
  ],
  "code": "T8F8UF",
  "biography": "Shuvomoy Das Gupta is a fourth-year Ph.D. student at the MIT Operations Research Center. His research focuses on developing efficient algorithms for large-scale optimization and machine learning."
 },
 {
  "avatar": "https://pretalx.com/media/avatars/headshotcic_hSDWHRY.jpeg",
  "name": "Saransh Chopra",
  "submissions": [
   "7AYUSN"
  ],
  "code": "T8FLGG",
  "biography": "Saransh is an engineering junior at the Cluster Innovation Center, University of Delhi, pursuing a major in Information Technology and Mathematics. In daylight, he works on his academic skills and professional commitments, and by night, he develops and maintains Open-Source Research Software, which he believes are the key to collaborative and reproducible research."
 },
 {
  "avatar": "https://pretalx.com/media/avatars/screen-recording-2023-01-04-at-101505-pm-sctfoqer-jfyrnowu_8ba2zyEE_XRbJIX3.gif",
  "name": "1m1",
  "submissions": [
   "LC9AZE"
  ],
  "code": "T8KWMT",
  "biography": "cyborg, technologist, mathematician, philosopher, artist\r\n\r\nlover of julia since v0.3\r\n\r\nbeen coding and doing math 30+ years\r\n\r\nmore at https://1m1.io"
 },
 {
  "avatar": "https://pretalx.com/media/avatars/Shivay_ATO_2022_QKYtPh3.jpeg",
  "name": "Shivay Lamba",
  "submissions": [
   "M8PLZV"
  ],
  "code": "T9TYF8",
  "biography": "Shivay Lamba is a software developer specializing in DevOps, Machine Learning and Full Stack Development. \r\n\r\nHe is an Open Source Enthusiast and has been part of various programs like Google Code In and Google Summer of Code as a Mentor. \r\n\r\n\r\nHe is actively involved in community work as well. He is a TensorflowJS SIG member, Mentor in OpenMined and CNCF Service Mesh Community and has given talks at various conferences like Github Satellite, Voice Global, Fossasia Tech Summit, TensorflowJS Show & Tell."
 },
 {
  "avatar": "",
  "name": "Alireza Shefaei",
  "submissions": [
   "KB8HS7"
  ],
  "code": "TYMAXM",
  "biography": "He received the B.Sc. degree in electrical engineering from Azarbaijan Shahid Madani University (ASMU), Tabriz, Iran, in 2014. He spent five semesters of his B.Sc. degree at University of Tabriz, Tabriz, Iran, where he received the M.Sc. degree in electrical engineering, in 2018. He is currently pursing his PhD degree in water management at Delft University of Technology, Delft, Netherlands. His main research interest includes application of optimization algorithms in networked infrastructures."
 },
 {
  "avatar": "https://pretalx.com/media/avatars/WhatsApp_Image_2022-01-31_at_10.04.41_HlDmmpo.jpeg",
  "name": "Letícia Madureira",
  "submissions": [
   "AZST33",
   "ELRURU"
  ],
  "code": "U3WPAA",
  "biography": "I am a first year PhD student at Carnegie Mellon University. I am a Computational Chemist working with Quantum Chemistry and Software Engineering. Some of my goals as a researcher are: exploring chemical space, developing new open source tools for scientists and make this world better and more inclusive for everyone!"
 },
 {
  "avatar": "",
  "name": "Nicolas Wink",
  "submissions": [
   "W78W98"
  ],
  "code": "UACWXG",
  "biography": null
 },
 {
  "avatar": "https://pretalx.com/media/avatars/tao_1gRlpgj.jpg",
  "name": "Tao Wang",
  "submissions": [
   "EQ9BSG"
  ],
  "code": "UATY8K",
  "biography": "PhD student at the University of Massachusetts Amherst\r\nCo-designer of NumericalEFT package"
 },
 {
  "avatar": "https://pretalx.com/media/avatars/FR1_7812_crp_1_AuNRf7S.jpg",
  "name": "Mustafa Mohamad",
  "submissions": [
   "WGQEUM"
  ],
  "code": "UFBJXQ",
  "biography": "Dr. Mustafa Mohamad is an Assistant Professor at the University of Calgary at the Schulich School of Engineering.  His main research expertise is in stochastic dynamical systems, uncertainty quantification, extreme event analysis, and data-driven methods in science and engineering."
 },
 {
  "avatar": "https://pretalx.com/media/avatars/001_zjOJ82X.jpg",
  "name": "Christoph Hotter",
  "submissions": [
   "NLYAH3"
  ],
  "code": "ULTFSR",
  "biography": "I am a postdoctoral researcher in the Cavity-QED group of Helmut Ritsch at the University of Innsbruck where I also obtained my PhD in 2023. \r\nMy main research is on simulating large open quantum systems and quantum-enhanced metrology, but I am also interested in quantum computing and simulation."
 },
 {
  "avatar": "https://pretalx.com/media/avatars/20180813_141024_cropped_2BWNFJe.jpg",
  "name": "Mark Kittisopikul, Ph.D.",
  "submissions": [
   "WGQEUM"
  ],
  "code": "USMVVE",
  "biography": "Mark Kittisopikul, Ph.D. is a Software Engineer II at the HHMI Janelia Research Campus in Ashburn, Virginia, USA. He currently focuses on computing applications surrounding light-sheet microscopy. Previously, Dr. Kittisopikul completed postdoctoral and doctoral work in Cell Biology, Biophysics, and Systems Biology at Northwestern University and the University of Texas Southwestern Medical Center. He previously studied Biological Chemistry and Mathematics at the University of Chicago.\r\n\r\nIn his free time, Mark enjoys cycling, puzzle games, and playing with his daughter."
 },
 {
  "avatar": "https://pretalx.com/media/avatars/%E8%AF%81%E4%BB%B6%E7%85%A7_XVxnUAG.jpg",
  "name": "Songchen Tan",
  "submissions": [
   "D8RHE7"
  ],
  "code": "UTR3JJ",
  "biography": "Songchen is currently a second-year master student at MIT Center for Computational Science and Engineering (CCSE), and working as a research assistant at the Julia lab within MIT Computer Science and Artificial Intelligence Laboratory (CSAIL). They use mathematical and computational theory to build machine learning and high-performance computing infrastructure, and collaborate in the ubiquitously interdisciplinary environment of CCSE."
 },
 {
  "avatar": "https://pretalx.com/media/avatars/2021CBE_Grad_Headshot_2ilx1Mp.JPG",
  "name": "Aaron Wheeler",
  "submissions": [
   "VJC39L"
  ],
  "code": "UWLBA8",
  "biography": "PhD student @ Cornell University."
 },
 {
  "avatar": "https://pretalx.com/media/avatars/circle_ndxEx8H.jpg",
  "name": "Lilith Hafner",
  "submissions": [
   "XYHJXA",
   "BXSCXM",
   "LZQA3Z"
  ],
  "code": "UYMQJS",
  "biography": "I'm Lilith, a person, an artist, and a scientist."
 },
 {
  "avatar": "https://pretalx.com/media/avatars/c0d60e9cebf22b77e94c2d2eb4386539_Daalsxb.jpg",
  "name": "Joris Kraak",
  "submissions": [
   "9AUDXW",
   "XPPB3S",
   "HDTGHB",
   "S8DTUG"
  ],
  "code": "VCBWCT",
  "biography": "Joris is driven by a need for automation and to make things easier for himself, typically while first making them harder. He has been creating CI processes for Julia (and other languages) for as long as he has been programming in Julia (which has been a while), primarily for GitLab, but also for other platforms such as GitHub and Buildkite. He has also been building web-based Julia applications for the same amount of time, trying to find more efficient ways of building those at every step.\r\n\r\nJoris is the technical team lead for the JuliaSim product and applications team."
 },
 {
  "avatar": "",
  "name": "Srinivas K Datta",
  "submissions": [
   "LN3C9W"
  ],
  "code": "VH9WW7",
  "biography": "A multi-disciplinary applied researcher with interest in data analysis tools and platforms such as Julia, Python, R, STATA, SAS, and SPSS. Interested in using GLMs, GLMMs, Bayesian methods, machine learning, and time series forecasting in bioinformatics, consumer goods, epidemiology, healthcare, marketing, and media mix optimization."
 },
 {
  "avatar": "https://pretalx.com/media/avatars/xconvert.com_XwNJlpu.jpg",
  "name": "Carlos Castillo Passi",
  "submissions": [
   "YEUNMW"
  ],
  "code": "VK8HJK",
  "biography": "Carlos Castillo-Passi received a M.Sc degree in Electrical Engineering in 2018 from Pontificia Universidad Catolica de Chile. He is currently studying for a Ph.D. in Biomedical Engineering and Imaging Science Research, as a part of a joint degree between King's College London and Pontificia Universidad Catolica de Chile. His research interests include inverse problems, image reconstruction and formation, and MRI hardware."
 },
 {
  "avatar": "",
  "name": "Chris Doran",
  "submissions": [
   "PK9C77"
  ],
  "code": "VLPY9X",
  "biography": "Chris Doran spent the early part of his career researching applications of geometric algebra in quantum theory and gravitation, before switching to graphics. In 2005 he founded Geomerics, which provided real-time global illumination technology to the games industry. Geomerics' Enlighten was used in 100s of games including Dragon Age, Overwatch and Final Fantasy. Chris spent 4 years as a Director of Research at Arm, and now focuses on helping start-ups and university spin-outs. He is currently a Director of Monumo, who are actively using Julia in their research pipeline."
 },
 {
  "avatar": "https://pretalx.com/media/avatars/GERGAUD_Joseph_mPQ5Prt.jpg",
  "name": "Gergaud",
  "submissions": [
   "HDC8F7"
  ],
  "code": "VLTHU9",
  "biography": "Joseph Gergaud\r\nProfessor of Applied mathematics\r\n\r\nUniversité de Toulouse, INP-ENSEEEIHT-IRIT- France\r\n\r\nScientific interests: optimisation and optimal control"
 },
 {
  "avatar": "https://pretalx.com/media/avatars/16aeca0a435d95b33fbca08d6cfc2787_xyX3H0Z.jpg",
  "name": "Dilum Aluthge",
  "submissions": [
   "SU9FGK"
  ],
  "code": "VMSPPS",
  "biography": "M.D./Ph.D. student in biomedical informatics and computational biology at Brown University. Clinical scientist at Pumas-AI, Inc."
 },
 {
  "avatar": "https://pretalx.com/media/avatars/1575333366809_K2g3vHK.jpeg",
  "name": "Pere Giménez",
  "submissions": [
   "JJ3ZBP"
  ],
  "code": "VMVBRR",
  "biography": "I'm an electrical engineer with a PhD from the Universitat Politècnica de Catalunya (Barcelona).\r\n\r\nI'm currently the developer advocate at Genie, engaging with the community and providing support and learning materials for building web applications with the Genie Framework."
 },
 {
  "avatar": "",
  "name": "Siddharth Vishwanath",
  "submissions": [
   "YFN8CY"
  ],
  "code": "VQPDJV",
  "biography": null
 },
 {
  "avatar": "",
  "name": "Xiu-zhe (Roger) Luo",
  "submissions": [
   "CQEE8M",
   "SDW7EX"
  ],
  "code": "VRCN8Y",
  "biography": "Graduate student at University of Waterloo and Perimeter Institute. I’m interested in exploring quantum many body physics with machine learning and modern methods of programming. I'm also the Wittek Quantum Prize Winner in 2020 .\r\n\r\nOne of the creators of QuantumBFS/Yao.jl and many other open source packages in JuliaLang. Contributor of various projects including FluxML/Zygote.jl, FluxML/Flux.jl, PyTorch.\r\n\r\nCore member of JuliaCN, the Julia language localization organization for Chinese."
 },
 {
  "avatar": "",
  "name": "Aditi Kowta",
  "submissions": [
   "YPSFNQ"
  ],
  "code": "VW7UHL",
  "biography": "High School student with an interest in Pediatric Neurology, Public Health, and Medicine, starting college in Fall of 2023"
 },
 {
  "avatar": "https://pretalx.com/media/avatars/Corbin_Klett_picture_jAHzz2E.JPG",
  "name": "Corbin Klett",
  "submissions": [
   "UK9DCU"
  ],
  "code": "VZSN9T",
  "biography": "Corbin Klett completed his PhD in Aerospace Engineering at the Georgia Institute of Technology with a focus on the design of provably-safe control laws for aerospace systems. Presently, he develops the autonomy stack for hypersonic aircraft at Hermeus Corporation."
 },
 {
  "avatar": "https://pretalx.com/media/avatars/profile_pic_aUYBmHB.png",
  "name": "Manuel Berkemeier",
  "submissions": [
   "8FAGEC"
  ],
  "code": "W7Q33Z",
  "biography": "M.Sc. in Applied Mathematics, 2019; \r\ncurrently PhD student in the Data Science and Engineering group at Paderborn University, Germany."
 },
 {
  "avatar": "https://pretalx.com/media/avatars/_D713334_-_Copy_yHXMeRU.jpg",
  "name": "Adriano Coutinho de Lima",
  "submissions": [
   "WJHSMD"
  ],
  "code": "W9RDHR",
  "biography": "Adriano Lima is Senior Project Officer and Scientific Programmer at the Air Centre. He holds a Ph.D. in Civil Engineering with emphasis on environmental hydraulics from Hokkaido University, Japan. He has experience working as assistant professor, principal researcher and team manager, with focus on computational fluid dynamics, data science, aquaculture and multiple sectors of the blue economy."
 },
 {
  "avatar": "",
  "name": "François Pacaud",
  "submissions": [
   "A7YMT8"
  ],
  "code": "WC3WU3",
  "biography": "Assistant professor at Mines Paris - PSL"
 },
 {
  "avatar": "https://pretalx.com/media/avatars/shu.pdf_I4Q20XK.jpg",
  "name": "Harry Saxton",
  "submissions": [
   "AYQRRE",
   "GQPUWV"
  ],
  "code": "WMTZVU",
  "biography": "Harry Saxton is a 2nd Year PhD student at Sheffield Hallam University. With a background in mathematics, Harry is interested in Lumped parameter modelling and inverse problems. Harry's main interests lie in the areas of Sensitivity, Identifiability and Bayesian analysis. However, any biological problem in which mathematics is applied is of interest. Harry has been a part of developing the Julia package CirculatorySystemModels.jl which is a package which allows simple, modular lumped parameter modelling. Harry has been using Julia a year and feels like it is the best programming community that is out there."
 },
 {
  "avatar": "https://pretalx.com/media/avatars/150x_profile_9kszQze.png",
  "name": "Jacob Zelko",
  "submissions": [
   "SU9FGK",
   "TC79NT",
   "F3P9FX"
  ],
  "code": "WNALCB",
  "biography": "My name is Jacob S. Zelko!\r\nI graduated [Georgia Institute of Technology](https://www.bme.gatech.edu/) with a BS in biomedical engineering.\r\nI work at [Georgia Tech Research Institute](https://gtri.gatech.edu/) in the HEAT Division as a researcher and am a Contractor for the [Centers for Disease Control](https://www.cdc.gov/).\r\n\r\nMy research career has focused on mental health -- in particular, examining bipolar disorder, depression, and suicidality.\r\nThis focus has led me to studying about the social determinants of health, neurocognitive disabilities, and health equity.\r\n\r\nAdditionally, I have vested interests in observational health research and am an [active member of OHDSI](https://www.ohdsi.org), open and reproducible science, knowledge management, science education, and as a practicing Christian, the intersection of faith communities and science.\r\n\r\nI am a member of the [AlgebraicJulia](https://github.com/AlgebraicJulia/) and [JuliaHealth](https://github.com/JuliaHealth) and am the current chair of the Diversity and Development Julia Community Fund"
 },
 {
  "avatar": "https://pretalx.com/media/avatars/headshot_WZJBmTV.jpg",
  "name": "Moe Kayali",
  "submissions": [
   "9JL3JZ"
  ],
  "code": "WYZDPJ",
  "biography": "I'm a PhD student in the database group at the University of Washington, Seattle. I work on discovering new techniques to accelerate data management and make its results more trustworthy."
 },
 {
  "avatar": "",
  "name": "Stefan Strömer",
  "submissions": [
   "C7DFSF"
  ],
  "code": "WZS7RV",
  "biography": "Research Engineer @ Austrian Institute of Technology\r\nPhD Student @ TU Delft\r\n\r\ncontact: stefan.stroemer@ait.ac.at"
 },
 {
  "avatar": "https://pretalx.com/media/avatars/Yun-Tien_Lee_300dpi_uoxGRBA.jpg",
  "name": "Yun-Tien Lee",
  "submissions": [
   "Z3WWTN"
  ],
  "code": "XBHLGM",
  "biography": "Yun-Tien has over 15 years of experience in the insurance and consulting industry. He has always been working as a data analyst after he gained his fellowship status at the Society of Actuaries."
 },
 {
  "avatar": "https://pretalx.com/media/avatars/20190901_103834_6GP17X3.jpg",
  "name": "Volker Karle",
  "submissions": [
   "GBD87E"
  ],
  "code": "XJDRDX",
  "biography": "I'm a PhD student at the Institute of Science and Technology Austria (in Vienna in Austria) and I work as a Quantum theorist in the field of periodically driven non-equilibrium systems that are realizable in table-top experiments such as laser-driven molecules. In my research, I try to evaluate new kind of non-Abelian topological invariants that could give rise of exotic non-equilibrium behavior. In my work, I make use of the Julia language after many years of C++/python and I'm still fascinated by certain mechanics such as multiple dispatch. I'm happy to talk about Quantum physics, high-performance programming or math-heavy computations. In my free-time I enjoy playing Chess, climbing and making music."
 },
 {
  "avatar": "https://pretalx.com/media/avatars/1517731719282_kQ1lqUk.jpeg",
  "name": "Alessio Bellisomi",
  "submissions": [
   "LZ78HV"
  ],
  "code": "XJNXX3",
  "biography": "I am a software engineer at Ark Bermuda. Currently, my main focus revolves around building the Portfolio Management platform, which aims to cover all aspects of the Reinsurance process."
 },
 {
  "avatar": "https://pretalx.com/media/avatars/p_cEINRHw.JPG",
  "name": "Anton Smirnov",
  "submissions": [
   "DESQVZ"
  ],
  "code": "XLFEY9",
  "biography": "Research Engineer living in Ukraine.\r\nInterested in differentiable graphics, 3D scene resonstruction and GPU programming."
 },
 {
  "avatar": "",
  "name": "Mitch Phillipson",
  "submissions": [
   "9UA9PH"
  ],
  "code": "XT7RPW",
  "biography": "Received his Ph.D in Mathematics from Texas A&M university and worked as a professor as a small liberal arts university for several years. Currently works with WiNDC at the University of Wisconsin Madison as a data scientist."
 },
 {
  "avatar": "",
  "name": "Robert Parker",
  "submissions": [
   "EC88TM"
  ],
  "code": "Y39LCT",
  "biography": "Postdoc at Los Alamos National Laboratory"
 },
 {
  "avatar": "https://pretalx.com/media/avatars/unnamed_YmXgVXF.jpg",
  "name": "Chialo Lee",
  "submissions": [
   "9ES8NF"
  ],
  "code": "Y3F8MZ",
  "biography": "Having 5 years of experience as a data scientist, Chialo's expertise lies in data analysis and prediction, especially in the fields of educational gaming and industrial data\r\nvisualization.\r\n\r\ncarole1727@cameo.tw"
 },
 {
  "avatar": "",
  "name": "Nathan Zimmerberg",
  "submissions": [
   "WV8YE3"
  ],
  "code": "Y3LCKR",
  "biography": null
 },
 {
  "avatar": "",
  "name": "Nicolás Monzón",
  "submissions": [
   "TCFXVE"
  ],
  "code": "YBJFG7",
  "biography": null
 },
 {
  "avatar": "https://pretalx.com/media/avatars/rasmus_YjRYGIk.jpeg",
  "name": "Rasmus Henningsson",
  "submissions": [
   "NPADF7"
  ],
  "code": "YCNJP8",
  "biography": "Rasmus Henningsson’s research interests are centered around high-dimensional biological data in general and Leukemia in particular. He is currently developing new methods for dimension reduction, analysis and visualization of single cell RNA-seq data. He got his PhD degree in applied mathematics at Lund University in 2018, working on dimension reduction, viral evolution and Leukemia."
 },
 {
  "avatar": "https://pretalx.com/media/avatars/henrique_ferrolho_uS8Jkie.jpeg",
  "name": "Henrique Ferrolho",
  "submissions": [
   "GLGFZB"
  ],
  "code": "YD9REJ",
  "biography": "Henrique Ferrolho has a B.Sc./M.Sc. in informatics and computing engineering from the University of Porto, and a Ph.D. in robotics and autonomous systems from the University of Edinburgh. Currently, he is a Robotics Engineer at Ocado Technology in the UK, developing robot manipulation solutions for picking and placing tens of thousands of grocery products of varying shapes, sizes, weights, and fragility. His research interests include robust motion planning, and optimal control of complex robotic systems like quadrupeds and humanoids."
 },
 {
  "avatar": "https://pretalx.com/media/avatars/ocots_V6AmZMs.jpg",
  "name": "Olivier Cots",
  "submissions": [
   "HDC8F7"
  ],
  "code": "YDW3SS",
  "biography": "Assistant professor of applied mathematics at IRIT - ENSEEIHT."
 },
 {
  "avatar": "https://pretalx.com/media/avatars/Screenshot_2023-07-22_at_7.24.08_PM_oYcP7Vl.png",
  "name": "Hayden Free",
  "submissions": [
   "QEBHYB"
  ],
  "code": "YLFKXQ",
  "biography": "Hayden Free is a masters student studying computer science at the Georgia Institute of Technology. He also serves as the director of software engineering for Damour Systems PBC, which provides analytics and visualization tools to universities around the country."
 },
 {
  "avatar": "https://pretalx.com/media/avatars/photo1673719699_BOH7xzz.jpeg",
  "name": "Garik Petrosyan",
  "submissions": [
   "FRZKFJ"
  ],
  "code": "YQTC7S",
  "biography": "I am machine learning researcher at Biosim AI which is a drug discovery company. My interests are machine learning, high performance computing, complex system simulation. I defended my PhD at  Yerevan State University where I am currently  Assistant Professor."
 },
 {
  "avatar": "https://pretalx.com/media/avatars/feedback_-_Copy_2_IFtYUOp.jpg",
  "name": "Anand Jain",
  "submissions": [
   "GQPUWV",
   "PRLSQN"
  ],
  "code": "YQY9SF",
  "biography": "mind body"
 },
 {
  "avatar": "",
  "name": "Allan Wollaber",
  "submissions": [
   "9AKT3R"
  ],
  "code": "YVFYX3",
  "biography": null
 },
 {
  "avatar": "",
  "name": "Katharine Hyatt",
  "submissions": [
   "QHHSUV"
  ],
  "code": "YYDPCZ",
  "biography": null
 },
 {
  "avatar": "https://pretalx.com/media/avatars/IMG_6644_2_L9wLL8I.jpeg",
  "name": "Aaron Trowbridge",
  "submissions": [
   "9SPAPT"
  ],
  "code": "YYGFAX",
  "biography": "I am a research associate working on Quantum Optimal Control (QOC) in the Robotics Exploration Lab at Carnegie Mellon University; I jointly work with the Schuster Lab at Stanford University, testing QOC methods on superconducting quantum devices.\r\n\r\nI have a dual B.S. in Physics and Mathematics from Syracuse University in 2020, where my research focused on lattice quantum gravity.  See my [website](https://aarontrowbridge.github.io/) for more about my interests.\r\n\r\nI spend my free time reading, climbing, cooking, and attempting to teach myself Italian.  My favorite book is Don Quixote."
 },
 {
  "avatar": "https://pretalx.com/media/avatars/avatar-2022_CRSkKYH.jpg",
  "name": "Michael Schlottke-Lakemper",
  "submissions": [
   "PC8PZ8"
  ],
  "code": "ZBB3MC",
  "biography": "Michael is an interim professor (Vertretungsprofessor) for Computational Mathematics and research software engineer at the Applied and Computational Mathematics Research Lab at RWTH Aachen University, Germany. His research focus is on numerical methods for adaptive multi-physics simulations, research software engineering for high-performance computing, and scientific machine learning."
 },
 {
  "avatar": "",
  "name": "Alexander Leong",
  "submissions": [
   "3REQKW"
  ],
  "code": "ZBBTQR",
  "biography": "I'm a Software Engineer and current EE Masters of AI and Robotics student at Queensland University of Technology in Brisbane, Australia. My interests include AI / Machine Learning and Applied Mathematics in Engineering Applications. For more information please see my linkedin profile https://www.linkedin.com/in/alexander-leong-581b3b85/"
 },
 {
  "avatar": "",
  "name": "Michael Kyesswa",
  "submissions": [
   "33HMQB"
  ],
  "code": "ZCE33M",
  "biography": "Michael Kyesswa is a scientific researcher at Karlsruhe Institute of Technology. His main areas of research are modelling, simulation and analysis of power systems, parallel and real-time simulations, and computational methods for power system analysis"
 },
 {
  "avatar": "https://pretalx.com/media/avatars/IMG20230113175512_dDDOYqz.jpg",
  "name": "Luca Reale",
  "submissions": [
   "WQVFEE"
  ],
  "code": "ZEM3A7",
  "biography": "I have recently graduated from the University of Canterbury with a degree in mathematics, and am currently doing a masters in computational and applied mathematics"
 },
 {
  "avatar": "",
  "name": "Gaurav Arya",
  "submissions": [
   "RRBDAA"
  ],
  "code": "ZENHMQ",
  "biography": "Undergraduate at MIT"
 },
 {
  "avatar": "",
  "name": "Guilherme Augusto Zagatti",
  "submissions": [
   "NNVBG8"
  ],
  "code": "ZHTRYC",
  "biography": "Guilherme Augusto Zagatti’s is a PhD student at the Institute of Data Science (IDS) in the National University of Singapore (NUS) and a recipient of the Integrative Sciences and Engineering Programme (ISEP) scholarship. His main research interest is point processes. He has developed data warehouses for handling such data, modeled phenomena — from disease transmission to social interactions — as such and developed simulation algorithms for it. Currently, he is investigating machine learning applications to discover patterns in point processes. Previously, he worked as a data scientist at Flowminder where he contributed to the development of analytical toolkits and socio-economic research using call detail records and remote sensing data for poverty mapping and mobility analysis. He spent two years as an Overseas Development Institute (ODI) Fellow in the Ministry of Economic Planning and Development in Eswatini. Guilherme holds a BSc in Economics and MSc in Econometrics and Mathematical Economics from the London School of Economics."
 },
 {
  "avatar": "",
  "name": "Truls Flatberg",
  "submissions": [
   "FCFKS3"
  ],
  "code": "ZSV3QP",
  "biography": null
 },
 {
  "avatar": "https://pretalx.com/media/avatars/Pict_LR_jwV2Krw.jpg",
  "name": "Ludovic Räss",
  "submissions": [
   "BLCWQW",
   "GTKJZL",
   "YKUD8Q",
   "PC8PZ8"
  ],
  "code": "ZTATFJ",
  "biography": "GPU computing and geo-HPC. Researcher at ETH Zurich, Switzerland."
 },
 {
  "avatar": "",
  "name": "Nahuel Panigo",
  "submissions": [
   "TCFXVE"
  ],
  "code": "ZWBMZH",
  "biography": null
 },
 {
  "avatar": "https://pretalx.com/media/avatars/JuliaCon2023_YyZflGM.jpeg",
  "name": "Óscar Alvarado",
  "submissions": [
   "F89ZLV"
  ],
  "code": "ZZTWND",
  "biography": "Physicist by day, Data Scientist by night. I like programming, electronics and building Legos."
 }
]
